{"key": "hail,caesar!-2016", "title": "Hail, Caesar!", "rating": "6.4", "synopsis": "Slick Hollywood fixer Eddie Mannix (Josh Brolin) is pressed into action when superstar actor Baird Whitlock (George Clooney) is kidnapped and held for ransom by a mysterious group. Mannix races to quietly collect the ransom money without gossip columnists Thessaly and Thora Thacker (Tilda Swinton in a dual role) catching wind of the scandal. Alden Ehrenreich, Ralph Fiennes, Scarlett Johansson, Jonah Hill, Frances McDormand, and Channing Tatum co-star in this comedy set in Hollywood's golden age. Directed by Joel and Ethan Coen.", "genres": ["Comedy", "Mystery"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=kMqeoW3XRa0", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/hail%2Ccaesar%21-2016?versionId=LCy5DOFAhvfd3M.vWNnWHbfToulqUFfg"}, "review": "Overworked Eddie Mannix (Josh Brolin) is a \"fixer\" -- he's employed by the Capitol Pictures movie studio during Hollywood's 1950s golden age in order to clean up the messes made by actors who can't stick to the morals clause in their contracts, and to distract snoops like competing gossip-columnist twins Thora and Thessaly Thacker (Tilda Swinton in a dual role that's equal parts Hedda Hopper and Connie Marble from Pink Flamingos) from spilling the beans about who's queer, who's knocked up, and who's a scandal waiting to happen. Mannix is deeply Catholic, but his guilt is oversized compared to his sins (he visits confession daily to report on each cigarette he shouldn't have smoked, exasperating even his priest). So when the studio's biggest star, Baird Whitlock (George Clooney), goes AWOL from the sword-and-sandal epic he's shooting, it's up to Mannix to smooth over his disappearance and determine where he's gone on a bender this time. Little does he know that Whitlock is munching finger sandwiches at a teatime \"study group\" held at a seaside estate, where many, shall we say, progressive screenwriters are in attendance and the host's dog is named \"Engels.\"The Coen brothers indulge their desire to be the head of their own movie studio in Hail, Caesar!, larding Mannix's story with authentically vintage scenes from Capitol's upcoming release slate: a singing-cowboy oater, a debonair parlor drama, a biblical epic, a musical, and an Esther Williams-style aquatic ballet. So what if swimming sensation DeeAnna Moran (Scarlett Johansson) stomps off the set in her mermaid costume, demanding that someone get her out of her \"fish ass\" so she can have a cigarette? In the moments when she's floating around at the center of a kaleidoscope of chorines, her winning smile has a wattage long lost from American movies. (And speaking of star power: It is such a pleasure to watch Channing Tatum's incisive, vigorous physicality onscreen, whether it's as an Olympic wrestler in Foxcatcher or an adult entertainer in Magic Mike, or here as a song-and-dance man performing an extended Anchors Aweigh-style musical number in sailor whites. He belongs to that rarest class of actors whose physical intelligence is the wellspring of their charisma -- indeed, the last great one before him was Bruce Lee, and before that, Gene Kelly. Jackie Chan was an exceptional athlete and John Travolta a great dancer in their respective primes, but they lacked the vital quality shared by Kelly and Lee and Tatum: You can see their muscles thinking.)The citizens of a Coen brothers' movie generally do not have character arcs. They are born whole in their first frames embodying certain attributes, like virtuous Marge Gunderson or murderous Anton Chigurh or thoroughly mellow Jeffrey \"The Dude\" Lebowski, and while they might suffer as a result of their unchangeable natures, they do not seize on painful experiences as an opportunity for growth. Sometimes this can be an exhilarating way for morality tales to unfold in ordinary spaces, as in Fargo or No Country for Old Men; and sometimes it can just be a mess, as when J.K. Simmons' CIA honcho in Burn After Reading echoes the audience's thoughts by declaring, after a particularly convoluted debriefing, \"Report back to me when this all makes sense.\" Hail, Caesar! falls somewhere between the two. It wants to be a chronicle of Mannix's moral crisis as a good man in servitude to a decadent system, with multiple shots of clock faces standing in contrast to Hollywood's unchanging, carefree (and conscience-free) \"now.\" But Mannix's ethical epiphany tiptoes in and out of the room so quietly at the climax that it's easy to miss, and its meekness opens an opportunity for the audience to shrug and say \"So what?\" to all of the admittedly entertaining high jinks that came before.The most important shot in the movie slides by without comment. There's a scene in the aquatic musical in which Moran rises crowned and beaming out of the water like Venus on the half-shell, skin and hair and swimsuit perfectly dry -- a little bit of vintage Hollywood illusion usually created by lowering the actor into the water and then running the film in reverse. But a moment later, she wrenches off her crown and stomps off the set, planting her butt in a chair and lighting a cigarette, all while still bone-dry. Is this a world where actors can emerge from the water without a drop on them if they simply will it? Or if their star power permits it? What's even stranger, none of the technicians on set comment on this ability -- it is quickly accepted and forgotten, as if it's a truth of this world in which the normal rules of behavior, whether related to sin and rectitude or cause and effect, don't apply. Hail, Caesar! can't decide if it's a historically inspired drama or an allegorical work of fantasy, and yet this is not a flaw. It's a strange puzzle box of a movie, as impenetrable in its own way as Mulholland Drive, and its slippery, shape-shifting nature defies all of the usual critical assessments, except one: It's worth seeing.", "actors": ["Josh Brolin", "George Clooney", "Alden Ehrenreich", "Ralph Fiennes"], "directors": ["Ethan Coen", "Joel Coen"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyODc3MTI2NF5BMl5BanBnXkFtZTgwNDMxMjU2NzE@._V1_SX300.jpg", "keywords": ["Communism", "gossip-columnist", "Hollywood", "movie-studio", "musical [play]", "water-ballet"], "release_year": "2016", "moods": ["Comedy on the Edge", "Memory Lane"], "urls": "karthik", "themes": ["Actor's Life", "Filmmaking", "Kidnapping", "Scandals and Cover-Ups"]}
{"key": "lifeofpi-2012", "title": "Life of Pi", "rating": "8.0", "synopsis": "Yann Martel's ponderous adventure novel gets the big-screen treatment with this Fox 2000 adaptation helmed by director Ang Lee. The coming-of-age story surrounds the son of a zookeeper who survives a shipwreck by stowing away on a lifeboat with a zebra, an orangutan, a hyena, and a Bengal tiger by the name of Richard Parker. Suraj Sharma heads up the cast as the young boy, with Gérard Depardieu, Adil Hussain, Irrfan Khan, Rafe Spall, and Bollywood actress Tabu also starring.", "genres": ["Adventure", "Drama", "Fantasy"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=j9Hjrs6WQ8M", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/lifeofpi-2012?versionId=T36ZERuw1j.8hVQHuWEi.upGD4epDwil"}, "review": "One boy's struggle to survive being shipwrecked at sea with a fierce Bengal tiger becomes a poetic meditation on faith and perseverance in Ang Lee's Life of Pi, a stunningly gorgeous adventure drama with a rich spiritual subtext. It's largely a one-man show that seduces us with lucid 3D imagery, and it resonates as a drama thanks to newcomer Suraj Sharma's ability to convincingly alternate between youthful vulnerability and ageless bravery as his character experiences an intense crisis of faith.As the film opens, a young writer (Rafe Spall) sits across from Pi (Irrfan Khan) and waits to hear a story so incredible that it will shake the foundations of the skeptical scribe's beliefs. The tale begins innocently enough, with a young Pi (Sharma) attempting to establish his spiritual identity while growing up on the grounds of his family's zoo in a French region of India. Yet just as Pi begins to experience the joys of first love, his father announces that the family will soon be starting a new life in Winnipeg. The clan and all of their exotic animals travel to Canada by boat, but a massive storm sends the vessel plunging to the ocean floor, with the terrified Pi, an injured zebra, a hyena, an orangutan, and a Bengal tiger named Richard Parker just barely managing to escape in a lifeboat. After the skies clear and the wild animals begin to clash, Pi finds himself alone in the middle of the ocean with Richard Parker as he prays for a rescue that never comes. In the days and weeks that follow, Pi and Richard Parker establish a mutually respectful bond that helps both to endure when it seems that all hope is lost. It's only later, when a pair of Japanese insurance adjustors turn up seeking to verify Pi's remarkable story, that we discover the crucial role that faith played in keeping him alive on the open seas.The first thing that grabs you about Life of Pi is Claudio Miranda's lush, intoxicatingly vivid cinematography. Opening with shots of the animals in Pi's father's zoo, director Lee establishes a peaceful, Zen-like tone as Miranda's camerawork brings to mind groundbreaking nature documentaries like the recent Planet Earth or the gorgeous Born to Be Wild. Subsequently introducing us to the protagonist as he begins to share his tale with the eager young writer, screenwriter David Magee endears us to Pi by offering a glimpse of the childhood events that would shape his spiritual beliefs and personality. Whether peppering Pi's memories of his beloved uncle with gentle humor, portraying an early bout of heartbreak with poignant brevity, or showing a painful life lesson that will later play a crucial role in the plot, Magee front-loads Life of Pi with a profundity that's perfectly complemented by Miranda's gorgeous images and Lee's inspired stylistic flourishes. The talents of all three coalesce beautifully, giving the film a rich sense of soul-searching that's violently shattered when the boat carrying Pi and his family to their new lives sinks in a scene that's sure to be remembered as one of the most intense and awe-inspiring shipwrecks ever portrayed on film. An unforgettable shot of Pi sinking beneath the waves as the massive ship plummets into the abyss is positively breathtaking, and young star Sharma handles the physically and emotionally demanding scene like a seasoned pro.Later, as the film settles into the rhythms of Pi's epic struggle to survive being stranded at sea with a traumatized (and hungry) Bengal tiger, Sharma remains in top form as Lee and Miranda turn what could have been a stagy section of the movie into a thing of visual splendor. Likewise, Magee's screenplay keeps things consistently interesting by conveying just what a profound effect the experience is having on Pi as he faces a series of unexpected challenges. It's never dull or repetitive, and by taking us inside of Pi's head as he fights to keep himself and Richard Parker alive, the filmmakers give a rather simple story compelling depth.At times it feels as if each scene in Life of Pi is more beautifully rendered than the last -- not just visually, but subtextually as well. By the time Pi reveals a side of the story few would see coming, the development catches us off guard without feeling gimmicky; it adds to the film's reflective tone rather than detracting from it, and ends Pi's incredible tale on a note that's deeply spiritual without being preachy. That's a particularly fine line to walk, but in the capable hands of Lee and company, it's done with flawless balance.", "actors": ["Suraj Sharma", "Irrfan Khan", "Ayush Tandon", "Gautam Belur"], "directors": ["Ang Lee"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTg2OTY2ODg5OF5BMl5BanBnXkFtZTcwODM5MTYxOA@@._V1_SX300.jpg", "keywords": ["cat", "chimpanzee", "hyena", "lifeboat", "lost-at-sea", "religion", "sea-disaster", "shipwreck", "tiger", "zoo"], "release_year": "2012", "moods": ["Eyepoppers"], "urls": "karthik", "themes": ["Disasters at Sea", "Stranded"]}
{"key": "chagall-malevich-2014", "title": "Chagall-Malevich", "rating": "5.7", "synopsis": "A recreation of the worlds of artists Marc Chagall and Kazimir Malevich, during Chagall's time living in what is now known as Belarus in the late 1910s.", "genres": ["Biography", "Drama", "History"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=8DWwuX8ifPE"}, "review": "", "actors": ["Leonid Bichevin", "Anatoliy Belyy", "Kristina Schneidermann", "Semyon Shkalikov"], "directors": ["Aleksandr Mitta"], "picture_url": "N/A", "keywords": ["art", "artist", "folklore", "Jewish"], "release_year": "2014", "moods": ["Only Human"], "urls": "karthik", "themes": ["Lawyers", "Life Under Occupation", "Tortured Genius"]}
{"key": "nowyouseeme2-2016", "title": "Now You See Me 2", "rating": "6.5", "synopsis": "In this sequel, the illusionists known as the Four Horsemen (Jesse Eisenberg, Woody Harrelson, Lizzy Caplan, and Dave Franco) return to perform a spectacular stunt in the hopes of clearing their names and exposing the unscrupulous behavior of a tech mogul named Walter Mabry (Daniel Radcliffe). However, Mabry soon turns the tables, and forces the group to steal a revolutionary decrypting device for him. Directed by Jon M. Chu (G.I. Joe: Retaliation).", "genres": ["Action", "Adventure", "Comedy"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=4I8rVcSQbic", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/nowyouseeme2-2016?versionId=oIRIv_yJM6QEezeaKryRI5lMHPGmpmb7"}, "review": "The expert magicians who make up the Four Horsemen drop the Robin Hood act for the sake of self-preservation in this sequel to the 2013 hit. Now You See Me 2, a movie focused on illusionists and sleight-of-hand artists, looks to make a name for itself in the same manner as any good magician: It creates arresting images in order to distract us from the trickery that makes the whole act work. The quartet (which now includes Lizzy Caplan, replacing Isla Fisher from the previous film) must once again deal with magic debunker Thaddeus Bradley (Morgan Freeman), who is now plotting against the team from jail after they framed him for a robbery he didn't commit; however, FBI agent Dylan Rhodes (Mark Ruffalo), an ally of the Horsemen, decides to deal with him by springing him from his cell. Meanwhile, the foursome are horrified when a seemingly triumphant return gig that's meant to expose a white-collar criminal is sabotaged. The incident introduces them to tech entrepreneur Walter Mabry (Daniel Radcliffe), who threatens to have his henchmen kill the crew unless they steal a highly valuable computer chip for him. And the wealthy, nefarious Arthur Tressler (Michael Caine), who lost millions thanks to a Horseman trick in the last film, is still on their trail and eager for vengeance, as is the twin brother of team member Merritt McKinney (both brothers are played by Woody Harrelson), who has a less-than-cordial relationship with his sibling.The actors who portray the central protagonists fire on all cylinders, elevating this boilerplate material in the process. Jesse Eisenberg serves as the group's smarmy, smug, yet somehow charming leader, who is able to get viewers invested in his whiz-kid-gets-his-comeuppance arc. Caplan is perhaps the most dynamic performer in the entire film, playing against type as an offbeat goofball with a sharp wit that comes out when she's tested (her wisecracks provide some of the funniest moments). Dave Franco is quietly becoming a slyly funny and versatile leading man. And there may be no safer bet in Hollywood at this point than casting Woody Harrelson as the member of an ensemble. Able to play central characters (The Messenger), comic relief (Zombieland), or even the face of pure evil (Out of the Furnace), Harrelson manages here to pull off the feat of bringing to life both Merritt and his ball-busting twin -- a dual role that, had it been essayed by someone without his sense of humor and acting chops, could have torpedoed the whole movie.Unfortunately, the plot contains several developments that come off as too trite or half-baked for a film about exposing the planning behind seemingly unexplainable feats, which means that viewers who aren't already enthralled by the art of magic will probably feel cheated. Much of the problem stems from the way the movie handles its ancillary characters. Ruffalo does his best, but he's undermined by a clunky screenplay that doesn't do justice to his character, who's supposed to be the emotional center of the story. New additions Radcliffe and Jay Chou (the latter portrays an employee at an upscale, well-respected shop for magicians) are given short shrift, as both men seem like they're playing plot devices rather than three-dimensional human beings. And Michael Caine's role as a one-note antagonist is such a slog that it's a wonder director Jon M. Chu didn't just replace him with a CGI beast, or at least give him a fake mustache to twirl.The movie as a whole doesn't satisfy as anything beyond surface-level flash; it's visually appealing, but too kitschy and airless to make any lasting impact. Like most magic shows, this film depends on the audience's investment in the spectacle: Viewers who are just looking for a good time and some well-executed tricks will be entertained, but those seeking more substantial fare will likely end up feeling slightly duped.", "actors": ["Jesse Eisenberg", "Mark Ruffalo", "Woody Harrelson", "Dave Franco"], "directors": ["Jon M. Chu"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ0NDgwODQ3NV5BMl5BanBnXkFtZTgwOTYxNjc2ODE@._V1_SX300.jpg", "keywords": ["magician [performer]"], "release_year": "2016", "moods": ["Fantastic Reality"], "urls": "karthik", "themes": ["Crime Sprees", "Dishonor Among Thieves", "Priceless Artifacts and Prized Objects", "Race Against Time", "Wizards and Magicians"]}
{"key": "brotherlylove-2015", "title": "Brotherly Love", "rating": "7.0", "synopsis": "Forging a way out of Philadelphia's roughest neighborhood is a life or death matter for siblings June, (Cory Hardrict), Sergio (Eric D. Hill Jr.) and Jackie (Keke Palmer). So when Sergio's skill on the basketball court promises an escape, it looks like he'll avoid the fate that befell the streetwise June. But the temptations of 'hood life still pull hard on a loving family trying their best in a world that's stacked against them.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=mOACSS97KQM", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/brotherlylove-2015?versionId=i9.TwhoSS8Fxcg3YYg3gKgSpvmjdJq7T"}, "review": "", "actors": ["Keke Palmer", "Cory Hardrict", "Romeo Miller", "Eric D. Hill Jr."], "directors": ["Jamal Hill"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MTEyMzA0OF5BMl5BanBnXkFtZTgwMDk1NzA0NDE@._V1_SX300.jpg", "keywords": ["basketball", "dreams", "inner-city"], "release_year": "2015", "moods": ["Only Human"], "urls": "karthik", "themes": ["Basketball Players", "Inner City Blues", "Innocence Lost", "Journey of Self-Discovery", "Kids in Trouble"]}
{"key": "hoteltransylvania-2012", "title": "Hotel Transylvania", "rating": "7.1", "synopsis": "Samurai Jack's Genndy Tartakovsky directed this animated tale concerning a hotel where monsters such as Dracula (voice of Adam Sandler), the Invisible Man (David Spade), Frankenstein (Kevin James), and his bride (Fran Drescher), along with a host of others, head to relax from a world full of humans. When a young man (Andy Samberg) stumbles onto the resort and falls for Drac's teenage daughter Mavis (Selena Gomez), comedy high jinks ensue. Cee Lo Green, Steve Buscemi, and Molly Shannon also lend their voices.", "genres": ["Animation", "Comedy", "Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=q4RK3jY7AVk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/hoteltransylvania-2012?versionId=BwGvjG7cntCJE7aNG.NfdVw7W1ZL7HhE"}, "review": "Emmy Award-winning animator and Samurai Jack creator Genndy Tartakovsky makes his feature directorial debut with Hotel Transylvania, an endearing tale about an overprotective Dracula intent on sheltering his beloved daughter from the vicious humans who killed her mother. The result is a film that will tickle parents with a soft spot for creature features while it puts a good-humored spin on familiar monster lore. Brimming with a sense of dynamic visual energy courtesy of Tartakovsky, and bursting with ghoulish gags thanks to screenwriters Robert Smigel and Peter Baynham, it falls back on current trends a bit too much to be called a true original, but succeeds at showing impressionable young viewers a playful side of the silver screen's most memorable monsters.His beloved wife killed by monster-hating humans, a grieving Dracula (voice of Adam Sandler) vows to protect his daughter Mavis (Selena Gomez) by building a massive hotel where no human will ever set foot. As a result, the Hotel Transylvania becomes the most popular vacation destination for monsters of all shapes and sizes. Everyone from Frankenstein (Kevin James) to Wayne the Wolfman (Steve Buscemi) to Griffin the Invisible Man (David Spade) all have a warm bed waiting for them at the hotel, but this year, the appearance of a wide-eyed backpacker named Jonathan (Andy Samberg) threatens to turn Mavis' 118th birthday bash into a total disaster. Incensed as Dracula is at the prospect of a human stumbling into his monster safe haven, he attempts to pass off Jonathan as a party planner and distant relative of Frankenstein's, but finds his plan falling apart when Mavis develops a crush on the mortal newcomer while dreaming of life outside of the sprawling castle she's never left.Infused with a kinetic sense of energy thanks to the talented Tartakovsky, Hotel Transylvania is a visual treat for eyes both young and old. With whimsical character designs and carefully detailed sets, Tartakovsky and company make the most of the animated format as the camera frenetically whips and cranes around the castle, and the creatures casually execute moves that would be particularly difficult in a live-action film. Although the scatological humor of the early scenes may leave some parents fearing that co-writers Smigel and Baynham have set their sights squarely at the lowest common denominator, the nuances gradually begin to show when Jonathan recounts his journey in a clear reference to the plot of Bram Stoker's Dracula. And once the festivities get underway, the writers fire off a barrage of classic monster jokes as Jonathan scrambles to maintain his creepy alter ego, and control freak Dracula loosens up while learning that being a good parent means knowing when to let go.Admittedly, the concept of monsters as the good guys and humans as the villains is nothing new in the realm of movies, but Tartakovsky keeps things moving along at a satisfying pace as the stellar voice cast have a field day with their iconic characters. And though James and Buscemi get the majority of the best lines as, respectively, Frankenstein and Wayne, honorable mention goes to Fran Drescher for her portrayal of Frank's bride Eunice as a stereotypical Jersey Shore housewife; Chris Parnell as the Fly; and Jon Lovitz as Quasimodo, the house cook who longs to whip up some Jonathan stew. And though even the most patient of parents will groan like the undead when Dracula starts singing with a vocoder during the obligatory dance number at the end, the little ones aren't likely to be nearly as cynical, making this one mad monster party that's well-worth attending.", "actors": ["Adam Sandler", "Andy Samberg", "Selena Gomez", "Kevin James"], "directors": ["Genndy Tartakovsky"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NjQyODI3M15BMl5BanBnXkFtZTcwMDM4NjM0OA@@._V1_SX300.jpg", "keywords": ["daughter", "hotel", "human", "monster", "resort", "Dracula", "Frankenstein", "hunchback", "mummy", "werewolf"], "release_year": "2012", "moods": ["Other Dimensions"], "urls": "karthik", "themes": ["Fathers and Daughters", "Vampires", "Werewolves"]}
{"key": "thingstocome-2016", "title": "Things to Come", "rating": "7.1", "synopsis": "A fiftysomething leftist philosophy professor (Isabelle Huppert) is propelled into a midlife crisis after being squeezed between caring for her deteriorating mother (Edith Scob) and learning her husband (Andre Marcon) is resigning from their marriage. The blow of confronting her own mortality is cushioned by a friendship with a younger former student (Roman Kolinka), whose invitation to visit his anarchist commune in the countryside allows her a chance to remember the more radical and less burdened person she once was.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=S-xbvt7qdHQ", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thingstocome-2016?versionId=DnWoqLXRSSKP7h2RMB5QwbcewKCizYKu"}, "review": "", "actors": ["Isabelle Huppert", "André Marcon", "Roman Kolinka", "Edith Scob"], "directors": ["Mia Hansen-Løve"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYmNhYTUyYjAtYWJhMy00MTkyLTgwY2MtYTUwOTM0YjQ2MmI3XkEyXkFqcGdeQXVyNjE2MzYxMDQ@._V1_SX300.jpg", "keywords": ["anarchy", "commune", "divorce", "Leftist", "mid-life-crisis", "professor"], "release_year": "2016", "moods": ["Only Human"], "urls": "karthik", "themes": ["Crumbling Marriages", "Death in the Family", "Existential Crisis", "Infidelity", "Journey of Self-Discovery"]}
{"key": "startrekbeyond-2016", "title": "Star Trek Beyond", "rating": "7.2", "synopsis": "In this third installment of the rebooted Star Trek film series (which began with J.J. Abrams's Star Trek in 2009), Captain Kirk (Chris Pine) struggles with a personal crisis as he and the crew of the Enterprise are attacked by a dictator named Krall (Idris Elba). When an assault by Krall leads to the destruction of their starship, the team end up marooned on a remote planet inhabited by aliens both hostile and helpful. Zachary Quinto, Karl Urban, Zoe Saldana, Simon Pegg, John Cho, and Anton Yelchin co-star. Directed by Justin Lin (Fast & Furious 6), Star Trek Beyond is dedicated to both Leonard Nimoy (who passed away in 2015) and Yelchin (who died after filming concluded).", "genres": ["Action", "Adventure", "Sci-Fi"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=XRVD32rnzOw", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/startrekbeyond-2016?versionId=l.LZpIgdt4gK_mRTFUE1uchmc8dcQ9CO"}, "review": "The Starship Enterprise is now three years into its five-year mission, and Captain James T. Kirk (Chris Pine) is getting cabin fever. \"Things are feeling a little episodic,\" he laments to Dr. \"Bones\" McCoy (Karl Urban) over a glass of purloined alien sherry as he reflects on how he's now one year older than the age at which his father, an esteemed Starfleet officer, was killed in action. It's all too heavy for this restless maverick, and so Kirk privately decides it's time to step away from the Enterprise and leave Spock (Zachary Quinto) to command the crew: Uhura (Zoe Saldana), Scotty (Simon Pegg), Sulu (John Cho), Chekov (Anton Yelchin), and all of the other ensigns of Starfleet. He wants to have a talk with Spock right after the ship refreshes its provisions at the space station of Yorktown, but a distress call from an alien ship marooned on a hostile planet interrupts his plans.The Enterprise must travel through a signal-jamming nebula to rescue that lost crew, and it's there that the vulnerable ship is attacked by a swarm of kamikaze drones that punch holes in its hull and send it plummeting to the planet below. The assault is the work of Krall (Idris Elba), a swollen-headed reptile in search of a weapon stashed onboard the Enterprise. Now, the crew must escape from his clutches with the help of native Jaylah (Sofia Boutella), a white-haired alien whose facial markings suggest Darth Maul working a second career at Sephora.Star Trek Beyond director Justin Lin also helmed four of the seven (thus far) Fast and the Furious films, and this equally, needlessly frenetic picture could be retitled \"Fast and Furious and Loud and Expensive.\" Siphoning out the fistfights and exploding spaceships from its two-hour running time would leave about 30 minutes of plot, a sign that this story is essentially an overcomplicated TV episode rather than a movie. The clumsy alien makeup looks more suited for the small screen anyway, and the CGI creatures seem strangely puffy, as if they were inflated like a water balloon. The performances are acceptable, with Zachary Quinto's subtle take on Spock well at the head of the pack, but all of the charismatic menace that Idris Elba demonstrated as the heavy in Beasts of No Nation has disappeared underneath makeup that makes his head look like a budding cactus. Why hire such a compelling actor for this role if all he's going to do is glower and sulk under latex?When the original Star Trek TV series premiered in 1966, Hollywood was on the verge of collapsing under the weight of bloated, overbudgeted spectacles like Doctor Dolittle and Hello, Dolly! It took a younger generation of directors to cut through the grease and create American New Wave masterpieces like Bonnie and Clyde and The Godfather, because the studios couldn't imagine moviemaking being done any other way. Nowadays, U.S. cinema is in the second decade of an absurd glut of superhero flicks, space operas, and recycled -- excuse me, \"rebooted\" -- franchises, cranked out due to the fact that they consistently make money. Star Trek Beyond's exorbitant budget is being bankrolled in part by Chinese investors Alibaba Pictures and Huahua Film & Media Culture, and one can't help but wonder if the character development, social commentary, and philosophical discussions that made this series the subject of intense fandom were intentionally sacrificed so Kirk & co. would be more palatable to foreign audiences. Star Trek has typically been about the excitement of what's to come, but if this is the future of American movies, who needs it?", "actors": ["Chris Pine", "Zachary Quinto", "Karl Urban", "Zoe Saldana"], "directors": ["Justin Lin"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODgzN2E1YjctODg5Yi00YzYwLWJjZjAtNDg2MGE2Y2MyYjBmXkEyXkFqcGdeQXVyNjM1MTQ0NTQ@._V1_SX300.jpg", "keywords": ["alien [not human]", "man-vs-aliens", "mission [quest]", "space", "spacecraft", "space-exploration", "spaceship", "starship"], "release_year": "2016", "moods": ["Adrenaline Rush", "Eyepoppers", "Other Dimensions"], "urls": "karthik", "themes": ["Benign Aliens", "Evil Aliens", "Finding a Way Back Home", "Hotshots", "Space Travel", "Survival in the Wilderness"]}
{"key": "abeautifulnow-2015", "title": "A Beautiful Now", "rating": "6.4", "synopsis": "When a suicidal dancer (Abigail Spencer) locks herself in a bathroom with a gun, her closest friends try to reason with her from the other side of the door. Over the course of one night, the group reflect on the events that made them who they are. Written and directed by Daniela Amavia.", "genres": ["Comedy", "Drama", "Music"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=tC1iyfb-rBo", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/abeautifulnow-2015?versionId=c6sKUbFDYIKDBX08ubqWtTFr.VLm7k3l"}, "review": "", "actors": ["Abigail Spencer", "Cheyenne Jackson", "Collette Wolfe", "Elena Satine"], "directors": ["Daniela Amavia"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NTgwMzM0Ml5BMl5BanBnXkFtZTgwODI3NTE2OTE@._V1_SX300.jpg", "keywords": ["ballerina", "ballet-dance", "ballet-dancer", "bathroom", "friend", "suicide", "suicide-attempt"], "release_year": "2015", "moods": ["Abandon All Hope", "Only Human"], "urls": "karthik", "themes": ["Dancer's Life", "Mental Breakdown", "Mental Illness", "Suicide"]}
{"key": "somekindofhate-2015", "title": "Some Kind of Hate", "rating": "4.6", "synopsis": "In this feminist twist on the slasher genre, a teenage boy (Ronen Rubinstein) gains an ally against bullies after he resurrects the vengeful spirit of a teenage girl (Sierra McCormick) who committed suicide.", "genres": ["Horror"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=07SfDv21Iy4", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/somekindofhate-2015?versionId=Q.mp1VHAezBktZc.N_ZzPb_A6qiyGLrn"}, "review": "", "actors": ["Sierra McCormick", "Andrew Bryniarski", "Spencer Breslin", "Grace Phipps"], "directors": ["Adam Egypt Mortimer"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzExNjQ1Ml5BMl5BanBnXkFtZTgwMDAwODg0NjE@._V1_SX300.jpg", "keywords": ["bully", "ghost", "girl", "high-school", "revenge", "suicide", "zombie"], "release_year": "2015", "moods": ["Blood and Gore"], "urls": "karthik", "themes": ["Deal With the Devil", "Dying Young", "Ghosts", "High School Life", "School Violence [k]", "Suicide", "Teen Angst"]}
{"key": "ayearandchange-2015", "title": "A Year and Change", "rating": "6.5", "synopsis": "After a drunken accident, Owen (Bryan Greenberg) attempts to straighten out his life and reconnect with his estranged son in this comedy-drama directed by Strephen Suettinger.", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=Krr7r1Y9OwU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/ayearandchange-2015?versionId=98rgXOQ10TMY8XRfKUqA58_IfM1mkot8"}, "review": "", "actors": ["Bryan Greenberg", "Claire van der Boom", "T.R. Knight", "Marshall Allman"], "directors": ["Stephen Suettinger"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Njg4NTY0NF5BMl5BanBnXkFtZTgwMjkwNjQ5NjE@._V1_SX300.jpg", "keywords": ["accident", "bonding [relationship]", "change [personal]", "drunk", "family", "love", "son", "time"], "release_year": "2015", "moods": ["Angsty"], "urls": "karthik", "themes": ["Arrested Adolescence", "Existential Crisis", "Fathers and Sons"]}
{"key": "theimpossible-2012", "title": "The Impossible", "rating": "7.6", "synopsis": "Director Juan Antonio Bayona follows up his critically acclaimed feature debut The Orphanage with this drama set during the 2004 Thailand tsunami, detailing one family's incredible fight for survival. Inspired by actual events, The Impossible finds Henry (Ewan McGregor), his wife Maria (Naomi Watts), and their three sons lounging poolside at a scenic Thailand resort following an eventful Christmas. But just as the family begins to forget their troubles and settle in for a relaxing tropical getaway, one of the worst natural disasters in modern history changes their lives in the blink of an eye. Meanwhile, as shock gives way to abject horror, the devoted parents fight to protect their children, encountering scenes of heart-wrenching tragedy and experiencing acts of incredible compassion as the entire country is engulfed in chaos. Tom Hollander and Geraldine Chaplin co-star.", "genres": ["Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=Bgw394ZKsis", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/theimpossible-2012?versionId=TqRTnLS6MHYI7KABe4vswJxvLaYGGKiM"}, "review": "Almost every time we walk into a movie theater, we run the risk of having our emotions manipulated. Whether we're watching a drama, a romance, a comedy, or a horror flick, one of the primary indicators as to whether or not that story will resonate lies in the filmmaker's ability to pull our strings through a delicately balanced blend of effective writing, skillful acting, powerful imagery, and music that reflects (or, in certain instances, contradicts) the mood of the action taking place onscreen. The best directors do this with a subtlety that renders this blatant appeal to our emotions invisible -- leaving us, the audience, alone with the characters up on the screen as they strive to accomplish a certain goal or navigate through a difficult situation. In his second feature The Impossible, Spanish director Juan Antonio Bayona takes us directly into the path of the 2004 Indian Ocean earthquake and tsunami, revealing the true story of how one vacationing family not only managed to persevere through the devastating natural disaster, but, incredibly, reunited amidst the chaos and confusion that immediately followed. It's a truly visceral piece of filmmaking, but alas, it's hindered more than helped by a certain composer's shameless attempts to get our tears swelling right along with his overwrought strings.Henry (Ewan McGregor), his wife Maria (Naomi Watts), and their three sons Lucas (Tom Holland), Thomas (Samuel Joslin), and Simon (Oaklee Pendergast) are lounging poolside at a scenic Thailand resort following an eventful Christmas when one of the worst natural disasters in modern history changes their lives in the blink of an eye. As shock gives way to abject horror, the devoted parents fight to protect their children, along the way encountering scenes of heart-wrenching tragedy and experiencing acts of incredible compassion as the entire country is engulfed in chaos.In 2007, Bayona burst onto the international film scene with The Orphanage. Executive produced by Guillermo del Toro, The Orphanage succeeded not simply due to its ability to frighten, but because it managed to stir our emotions by painting its specters in a tragic light. It was an effective and richly textured psychological drama served up in horror trappings. Five years later, Bayona returns with The Impossible, a film that exchanges the gothic atmosphere of The Orphanage for a sunny beach in Thailand while focusing on the all-too-real horror of a family torn apart by forces far beyond their control. On the surface The Impossible is every parent's worst nightmare brought to life, yet once the surge hits, Bayona and screenwriter Sergio G. Sánchez focus as much on the family's efforts to find each other as they do the inherent selflessness we exhibit in times of great crisis.In The Impossible, Bayona's directorial strengths are immeasurably enhanced by a cast who do an exceptional job of emphasizing the humanity of Sánchez's compact yet emotionally complex screenplay, which alternates between the story of a critically wounded mother who strives to teach her son the healing power of altruism, and a father who refuses to give up hope even when all seems lost. In his very first onscreen film role, gifted young actor Tom Holland nearly steals the show from previous Oscar nominee Watts for a couple of reasons. Holland's remarkable ability to capture the mannerisms and nuances of his movie father serves to constantly remind us of McGregor's presence even when he's offscreen, but it's the talented young actor's ability to portray an effective mix of shock and perseverance that really drives his part of the story. When Lucas first recognizes the extent of his mother's injuries, his shaken reaction perfectly encapsulates that dreaded moment when we realize our parents aren't immortal. As a result, we understand how the tragedy has forced his character to mature in ways that he may not have been ready for. Even though she's muted by an oxygen mask for a good portion of the film, Watts shines as a mother who refuses to let her son's survival instincts overshadow his duties to the less fortunate early on. As the father who's faced with the agonizing decision to leave his two younger sons behind to search for Maria and Lucas, however, it's McGregor who personifies the unwavering sense of hope at the heart of The Impossible. A scene in which Henry uses a stranger's cell phone to place an emotionally charged call home captures that awful feeling when the horrible reality of a traumatic situation begins to set in as our consciousness struggles to catch up with our physical surroundings, and it highlights how the fleeting friendships that emerge in desperate times can have lasting and profound effects.For all of the talent in front of and behind the camera, however, there's one component of The Impossible that threatens to push the entire endeavor over the emotional cliff, and that's Fernando Velázquez's irredeemably unctuous score. With a story this emotional, one can see why Velázquez would be tempted to flex his orchestral muscles, but we hardly need to be told how to feel while watching a movie about a family being ripped apart by a violent force of nature, and in his efforts to enhance the drama, he instead ends up undercutting it. His score for The Impossible is so over-the-top melodramatic that at times it borders on parody, and given the highly effective use of sound design throughout the film, the picture would have been much better served without it.That pronounced shortcoming aside, The Impossible offers a refreshing air of hope in an era obsessed with fatalism, and serves as a stunning reminder that sometimes it's the worst situations that bring out the best in people.", "actors": ["Naomi Watts", "Ewan McGregor", "Tom Holland", "Samuel Joslin"], "directors": ["J.A. Bayona"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTA3NzQ5Nl5BMl5BanBnXkFtZTcwOTYxNjY0OA@@._V1_SX300.jpg", "keywords": ["Christmas", "compassion", "courage", "family", "rescue", "son", "Thailand", "tsunami", "vacation"], "release_year": "2012", "moods": ["Triumph of the Spirit"], "urls": "karthik", "themes": ["Families in Crisis", "Forces of Nature", "Stranded"]}
{"key": "salt-2010", "title": "Salt", "rating": "6.4", "synopsis": "Director Phillip Noyce teams with screenwriters Kurt Wimmer (Equilibrium) and Brian Helgeland (Mystic River) to craft this thriller starring Angelina Jolie as dedicated CIA officer Evelyn Salt, who is accused by a defector of being a Russian spy. With each attempt Salt makes to prove her innocence, her mentor, Winter (Liev Schreiber), only grows more suspicious of her true motivations. The longer she eludes capture by ambitious CIA agent Peabody (Chiwetel Ejiofor), the higher the stakes get.", "genres": ["Action", "Crime", "Mystery"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=QZ40WlshNwU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/salt-2010?versionId=wqcwRsBzpxjcTChosG7as4bAy9mqRxEF"}, "review": "There are great action movies (Die Hard, Hard-Boiled), and then there are highly entertaining action movies (Unleashed, anything directed by Rob Cohen) that keep adrenaline junkies entertained in the downtime before the next true classic arrives. A compact, streamlined espionage thriller from screenwriter Kurt Wimmer and director Phillip Noyce, Salt would never be mistaken for the former, though it snaps into the latter category with the snug click of a perfectly placed Lego. No one who sits through Salt is likely to die of boredom, though they might exit the theater a little sore due to laughing at one of the most ridiculously unconvincing movie disguises in recent memory. But plausibility isn't generally high on the list of crucial ingredients for cooking up an entertaining action flick, and thanks to a quickly paced script and some cleverly executed twists, Salt satisfies the craving for greasy fast-food cinema.Two years after being captured in North Korea and tortured as a suspected spy, top CIA agent Evelyn Salt (Angelina Jolie) is about to celebrate her second wedding anniversary to arachnologist Mike (August Diehl) when she is accused by a terminally ill Russian defective of being a sleeper agent for the Russian government. Desperate to clear her name and protect her husband, Salt takes flight, raising the suspicions of up-and-coming CIA agent Peabody (Chiwetel Ejiofor) even as her mentor, Winter (Liev Schreiber), insists that the accusation is unfounded. Now, in order for Salt to clear her name, she must outrun and outwit both the Secret Service and the CIA, all while uncovering information on a diabolical plot to breathe a big chill back into the Cold War with a high-profile assassination. The longer Salt eludes capture, the higher the stakes get.Shortly after co-writing the screenplay for The Thomas Crown Affair (alongside Leslie Dixon), Kurt Wimmer established himself as a rising force in the realm of over-the-top action cinema by jumping into the director's chair for Equilibrium and Ultraviolet, two sci-fi flicks that took ridiculous to delirious new heights. In 2003, Wimmer edged into espionage territory as screenwriter of the lukewarmly received CIA thriller The Recruit, and now he's teamed with director Noyce to deliver a high-stakes spy thriller that's short on originality, yet bristling with intensity. This time Wimmer seems to have modeled his script on a roller coaster, allowing the butterflies to flutter in our stomachs as we slowly creep up that first giant hill, then maintaining an impressive momentum until the ride stops and we exit our seats. And while there's nothing particularly inventive about a story driven by lingering Cold War tensions, sleeper agents, and assassination plots, Wimmer does manage to sneak in some savory particulars while delving into the details of a top-secret Russian program to topple the United States as a superpower, and to throw a few expertly placed third-act sucker punches.If only Noyce's talents as an action director were better matched to Wimmer's particular abilities as a storyteller, perhaps Salt would have been a bit more than a passable diversion. A talented filmmaker with an eye for detail, Noyce handles the dialogue and setup quite well -- eliciting a palpable sense of vertigo during a tense ledge escape early on, and employing sharp diversionary tactics during a suspenseful funeral scene that kicks the plot into high gear -- but the deeper he wades into the action, the more apparent it becomes that shoot-outs and car chases aren't exactly his forte. Like most action directors these days, Noyce refuses to give viewers a real sense of space by sticking primarily to close-up shots when things start to get hairy, a factor that prevents us from truly connecting with the kinetic events unfolding onscreen. But Noyce is quite good with actors, eliciting performances from Jolie, Schreiber, Ejiofor, and Daniel Olbrychski that go a long way in counter-balancing the hastily helmed action sequences.Odds are, Salt won't be the launching point for a hugely successful blockbuster action series à la The Bourne Identity -- as the filmmakers so clearly intended with the shamelessly open ending -- but until the next time we truly taste greatness, it's digestible enough to trick our stomachs into thinking we've feasted on filet mignon and fine wine, when in reality we've just wolfed down some chicken-fried steak and a chocolate shake.", "actors": ["Angelina Jolie", "Liev Schreiber", "Chiwetel Ejiofor", "Daniel Olbrychski"], "directors": ["Phillip Noyce"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODA2NDg4NV5BMl5BanBnXkFtZTcwMjg4NDAwMw@@._V1_SX300.jpg", "keywords": ["CIA (Central-Intelligence-Agency)", "espionage", "Russian [nationality]", "spy"], "release_year": "2010", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Assassination Plots", "Flight of the Innocent"]}
{"key": "thesolomonbunch-2013", "title": "The Solomon Bunch", "rating": "5.7", "synopsis": "Five sleuthing kids team up to investigate a mysterious stranger who's just arrived in their small town, embarking on a series of clandestine missions to prove that he's up to no good, and ultimately learning an important life lesson about jumping to conclusions in this lighthearted adventure for the entire family.", "genres": ["Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=R0ETx0d2fq4", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thesolomonbunch-2013?versionId=4qC087zbh.6Ok4YOm_XAVYYlRtIG1z6a"}, "review": "", "actors": ["Craig Crumpton", "Audray McCroskey", "Todd Maynor", "Randall Franks"], "directors": ["Jason Prisk"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BNDg2NTkwNTEzOF5BMl5BanBnXkFtZTgwNzUzNjQ2MDE@._V1_SX300.jpg", "keywords": ["childhood-adventures", "investigation", "small-town", "stranger"], "release_year": "2013", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Amateur Sleuths"]}
{"key": "badwords-2013", "title": "Bad Words", "rating": "6.7", "synopsis": "Forty-year-old Guy Trilby (Jason Bateman, starring in his feature directorial debut) discovers a loophole in the National Spelling Bee rules that allows him to compete against the pre-teen participants, and he strikes up an unlikely friendship with a 10-year-old misfit named Chaitanya (Rohan Chand) as he becomes the subject of a news story by probing reporter Jenny Widgeon (Kathryn Hahn).", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=yXoZCAVTzEQ", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/badwords-2013?versionId=FQvDBst4IghAdW4Pe0FevSQL4NCwPkwW"}, "review": "Forty-year-old Guy Trilby is a monster on a mission. The sooner you accept this, the more likely it is that you'll enjoy Bad Words, an uncompromising comedy about an acerbic man who's determined to win the prestigious Golden Quill spelling bee. Like most monsters, Trilby's motives are initially unclear, which inevitably leads to his being misunderstood. Unlike many monsters, however -- and this is the factor that may prevent some from truly connecting with Bad Words, even as they're laughing in spite of themselves -- the people who incur the brunt of his foulmouthed wrath are children. In the course of exploiting an arcane loophole to compete in the bee, Trilby will insult, embarrass, and humiliate anyone who dares get in his way -- and most of the time, those unfortunate victims have yet to hit puberty.The first time we meet Guy Trilby (Jason Bateman, making his feature directorial debut here), he is preparing to participate in the regional spelling bee that will secure his entry into the Golden Quill competition. With a little assistance from his sponsor, an online journalist named Jenny (Kathryn Hahn), he eventually blusters his way onto the stage. Trilby is next seen sprinting from the building, trophy in hand, as an army of enraged parents are in hot pursuit. Clearly he has won the battle, but will he win the war by taking the top spot? Not if current Golden Quill director Dr. Bernice Deagan (Allison Janney) and president Dr. Bowman (Phillip Baker Hall) have any say in the matter. Meanwhile, as the competition gets under way, the arrogant, abrasive Trilby reluctantly begins to forge an unlikely bond with Chaitanya (Rohan Chand), a young Indian-American boy who's quickly emerging as a top contender, no thanks to his neglectful father. Later, the sleuthing Jenny conducts a clandestine background check on Trilby that reveals his true motivations, but threatens to push their increasingly strained relationship to the breaking point.In the opening scenes of Bad Words, Trilby openly admits to making impulsive, irrational decisions based on anger. Given the vitriol that he frequently hurls at women and children, there's never any doubt as to how deep his fury runs, only at whom it's primarily directed. That early confession is a rarity since we learn precious little about Trilby from his own mouth. However repellant he may be on the surface, that mystery makes him fascinating. Of course, whether or not you'll want to spend your quality time with a character who has no qualms about getting a ten-year-old boy liquored up or sending a preadolescent girl running from the stage in tears may depend largely on your ability to put your morals in a box for 89 minutes, but for those with a big enough box and a strong enough lock, Bad Words offers a wealth of deeply offensive, devil-may-care belly laughs that leave a refreshing sting -- the kind that reminds you that not all films are made by a committee or test-marketed to death before they reach the viewer.Working from a fearless screenplay by freshman scribe Andrew Dodge, Bateman makes a commendable directorial debut that reveals just how much he learned during his three decades in television. Though his direction can sometimes feel a bit pedestrian, in the sense that Bad Words occasionally looks more like a television pilot than a richly cinematic feature, he manages to keep the story moving and the laughs flowing. He handles reaction shots in particular with frame-by-frame precision (hardly a surprise given his background as a straight man), and that's only a small component of his perfect understanding of the rhythms of comic timing. Likewise, his playful interpretation of Dodge's farcical characters prevents Bad Words from ever feeling like it's trying too hard. It can be argued that some of the characters (including our antihero and his young pal, the latter played by a rising talent we'll surely be seeing more of) are broadly drawn, but Bad Words is first and foremost a comedy -- not a biting satire of the spelling-bee industry or a deep meditation on the importance of father figures (though those particular themes are present and accounted for). Even when the plot gives way to some guarded sentiment, the film never loses its unrepentant mean streak. Considering Trilby's opening remarks, those who emerge from Bad Words foaming with outrage can't say they were never warned, only that they allowed their morbid curiosity to get the best of them.", "actors": ["Jason Bateman", "Kathryn Hahn", "Rohan Chand", "Philip Baker Hall"], "directors": ["Jason Bateman"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTg0NzQ1NF5BMl5BanBnXkFtZTgwMDQ5OTMwMTE@._V1_SX300.jpg", "keywords": ["adult [vs. child]", "misfit", "spelling-bee"], "release_year": "2013", "moods": ["Comedy on the Edge"], "urls": "karthik", "themes": ["Arrested Adolescence", "Contests, Pageants and Competitions", "Unlikely Friendships"]}
{"key": "theeye-2002", "title": "The Eye", "rating": "6.7", "synopsis": "A corneal transplant sets the stage for terror in this supernatural thriller from directors Danny and Oxide Pang. Blind from the age of two, 20-year-old Mann (Angelica Lee) now has a chance to reclaim her sense of sight thanks to recent breakthroughs in technology. At first elated to have her vision restored, Mann's joy soon turns to paralyzing fear when she begins to see mysterious dark figures which foreshadow sudden, shocking deaths. Subsequently distraught over seeing Ling (Chutcha Rujinanon), the previous owner of the corneas, when she peers into the mirror, Mann's disturbing images slowly begin to chip away at her sanity until she has no choice but to track Ling's past and solve the horrifying mystery that plagues her. Traveling to Ling's former home in a small Northern Thailand village, Mann learns that Ling was driven to suicide after suffering similar visions preceding a tragic fire. When hundreds of the mysterious black figures descend upon Mann just as she is about to leave Thailand, she realizes that a horrific tragedy is set to unfold unless she can summon the courage to take action and use her supernatural gift of sight to alter the future.", "genres": ["Drama", "Horror", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=SOxzXVGaEY8", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/theeye-2002?versionId=WQaBGkofsNvGZslhPR4VVYT6GysFWXLE"}, "review": "Sustaining a palpable sense of dread throughout while providing frequent effective shocks, the latest offering from the Pang brothers successfully balances the more horrific aspects of their supernatural tale with some thoughtful personal touches. Though horror fans will inevitably draw comparisons to such aesthetically similar efforts as The Sixth Sense and The Ring, The Eye stands well enough on its own by offering a stylishly rendered tale of terror and well-drawn, sympathetic characters. As Mun (Angelica Lee) struggles to adjust to a new world of sight and Dr. Wah (Lawrence Chou) attempts to assist her in expanding her visual vocabulary, the audience truly feels how disorienting it might be to suddenly experience the world in an entirely new context. Add in the supernatural visions that she suffers upon regaining her sight and her struggles to maintain her sanity amidst increasingly disturbing encounters, and the viewer gradually grows to experience Mun's plight in a remarkably personalized way. Additionally, the subsequent effect that the death of a minor but pivotal character has on Mun provides a well-drawn transition in her understanding of how her gift may be used. Clearly attracted to Mun, the protective Dr. Wah's ethical dilemma in contrast to his older and more professional uncle renders his conflicted character equally three-dimensional. Though the characters and their plights are effectively portrayed, the fright factor is what ultimately drives this film, and the Pang brothers certainly deliver. As visual stylists, the duo is a formidable force that knows well how film a visually extravagant and horrifyingly grotesque scare. The assured cinematography and striking imagery frequently succeed in creating beautiful depictions of often disturbing events. Perfectly complementing their visual craftsmanship, their equally adept editing skills set the stage for some of the most memorably jarring set pieces in recent horror history. As usual with many successful Asian films of late, The Eye was quickly optioned for an American remake.", "actors": ["Angelica Lee", "Lawrence Chou", "Jinda Duangtoy", "Yut Lai So"], "directors": ["Danny Pang", "Oxide Chun Pang"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjRiNTk5YWYtYTRhZi00ZTg3LTkwOTYtN2RhMjA1NzdjYmYyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg", "keywords": ["woman", "corneal-transplant", "eye", "clairvoyance", "vision [eyesight]", "ghost", "supernatural-powers"], "release_year": "2002", "moods": ["Spellbinders"], "urls": "karthik", "themes": ["Ghosts", "Psychic Abilities", "Renegade Body Parts", "Woman In Jeopardy"]}
{"key": "theywillhavetokillusfirst-2015", "title": "They Will Have to Kill Us First", "rating": "7.6", "synopsis": "Defiant musicians in Mali testify to how their music scene thrives underground, despite the restrictions of Sharia law and threats from Islamic fundamentalists. The film includes performances by Songhoy Blues, Khaira Arby, Fadimata \"Disco\" Walet Oumar, and Moussa Sidi.", "genres": ["Documentary"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=3TX7ybW6nAQ", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/theywillhavetokillusfirst-2015?versionId=27s3yPTDR_dCttk9t7HDt1Rt.sksREJC"}, "review": "", "actors": ["Aliou Touré", "Oumar Touré", "Garba Touré", "Nathanael Dembélé"], "directors": ["Johanna Schwartz"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMjIzNjkzODk4OF5BMl5BanBnXkFtZTgwNzEzODE3NDE@._V1_SX300.jpg", "keywords": ["Africa", "Islam", "music", "underground [counterculture]", "world-music"], "release_year": "2015", "moods": ["Food for Thought", "Triumph of the Spirit"], "urls": "karthik", "themes": ["Fighting the System", "Life Under Occupation", "Musician's Life", "Religious Zealotry"]}
{"key": "mayallahblessfrance!-2014", "title": "May Allah Bless France!", "rating": "5.4", "synopsis": "This autobiographical film details the life of French rapper Abd al Malik (played by Marc Zinga). Aided by his tremendous musical talent, Malik rose out of extreme poverty and undesirable social circles to become a major player in France's music scene.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=2ocM5klJWhA", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/mayallahblessfrance%21-2014?versionId=4GTpZez.43bf7cJmp1kq_kWSBdSj66ee"}, "review": "", "actors": ["Marc Zinga", "Sabrina Ouazani", "Larouci Didi", "Mickaël Nagenraft"], "directors": ["Abd Al Malik"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2ODExODM2N15BMl5BanBnXkFtZTgwMTk2NzcwNjE@._V1_SX300.jpg", "keywords": ["artist", "Black [race]", "French [nationality]", "musician", "overcome", "poverty", "racism", "rap-music"], "release_year": "2014", "moods": ["Only Human"], "urls": "karthik", "themes": ["Big Break", "Inner City Blues", "Mothers and Sons", "Musician's Life", "Rags To Riches", "Street Gangs"]}
{"key": "transpecos-2016", "title": "Transpecos", "rating": "5.8", "synopsis": "Three U.S. Border Patrol agents (Johnny Simmons, Gabriel Luna, and Clifton Collins Jr.) face the ultimate test of their loyalty to each other during a sweltering day on the job in which the inspection of a vehicle returning to the United States goes awry. Now, the trio must defy the law in order to do right by one of their own. Transpecos marks the feature directorial debut of Greg Kwedar.", "genres": ["Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=RMqHXHN1b9s", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/transpecos-2016?versionId=vyFvEagE7e2Lfxa9qysATYHWCajumauM"}, "review": "", "actors": ["Johnny Simmons", "Gabriel Luna", "Clifton Collins Jr.", "David Acord"], "directors": ["Greg Kwedar"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODc0NTI0NDE5OV5BMl5BanBnXkFtZTgwNDQxMjU1OTE@._V1_SX300.jpg", "keywords": ["border-guard", "conflict", "desert", "illegality", "inspection", "loyalty", "secrets"], "release_year": "2016", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Police Corruption", "Task Forces"]}
{"key": "detectivebyomkeshbakshy-2015", "title": "Detective Byomkesh Bakshy", "rating": "7.7", "synopsis": "In 1940s wartime Calcutta, university graduate Byomkesh Bakshy (Sushant Singh Rajput) tries his hand at detective work by uncovering a criminal's fiendish plan. Meanwhile, he falls under the spell of a mysterious woman. An Indian twist on Sherlock Holmes.", "genres": ["Action", "Mystery", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=ZG--GOpi_0g", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/detectivebyomkeshbakshy-2015?versionId=C_D.Szg103.5u3yTYUDN_bt586FXvzq_"}, "review": "", "actors": ["Sushant Singh Rajput", "Anand Tiwari", "Divya Menon", "Swastika Mukherjee"], "directors": ["Dibakar Banerjee"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNzQ0MTAxNl5BMl5BanBnXkFtZTgwMDY2NjM4MzE@._V1_SX300.jpg", "keywords": ["crime-solving", "detective", "private-detective", "war-torn"], "release_year": "2015", "moods": ["Spellbinders"], "urls": "karthik", "themes": ["Hotshots", "Murder Investigations", "Private Eyes", "Star Detectives", "Street Gangs"]}
{"key": "deadend-2014", "title": "Dead End", "rating": "7.1", "synopsis": "While investigating a masked killer who opened fire at a local school, a reporter calls on the paranormal spirits that surround the investigation to uncover the truth in this horror thriller.", "genres": ["Horror", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=WOKRauvfkUU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/deadend-2014?versionId=o1fYMogd7WfpOGILhh90HjwKWDRhXfIb"}, "review": "", "actors": ["Ramez Alkhoury", "Trace Anderson", "Farhad Asghar", "Toshumba Barkus"], "directors": ["Jordan F. Ghanma"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMjM1OTUyODI4N15BMl5BanBnXkFtZTgwNDM5NzM4MTE@._V1_SX300.jpg", "keywords": ["ghost", "investigation", "paranormal", "reporter", "school-shooting"], "release_year": "2014", "moods": ["Blood and Gore"], "urls": "karthik", "themes": ["Amateur Sleuths", "Crime Sprees", "High School Life", "Serial Killers"]}
{"key": "thekingdom-2007", "title": "The Kingdom", "rating": "7.1", "synopsis": "In the aftermath of a deadly attack on American forces in Riyadh, Saudi Arabia, diplomats are slow to act, but meanwhile, FBI special agent Ronald Fleury (Jamie Foxx) assembles a secret team of U.S. counter-terrorism investigators to enter the city and find the criminal behind what has quickly become an international incident. The crew, however, finds their attempt to capture the perpetrators stalled by bureaucracy and their presence unwelcome. Desperate to gain the trust they need to accomplish their mission in just five days, the team enlists the aid of a Saudi Arabian police officer (Ashraf Barhoum), but as the agents infiltrate the dark and complex world of the Saudi crime scene, they find that the perpetrator's next target may be them. Directed by Peter Berg, The Kingdom also stars Jennifer Garner, Chris Cooper, and Jason Bateman.", "genres": ["Action", "Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=6OJArlYJQPg", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thekingdom-2007?versionId=tN1YM0F5IRh.92IPA_Vnyf36kDDEgrXU"}, "review": "The Kingdom may just be the first action movie set against the modern war on Islamic terrorism. Unfortunately, it seems pretty clear that director Peter Berg set out to make an ensemble sociopolitical thriller in the style of Syriana. His movie does start out on that track. Not only does the first act acquaint us with numerous players in various arenas, both foreign and domestic, but unlike Syriana, Berg's film deigns to help the audience sort out who's who, supplying handy title cards as characters get introduced. What's strange is that he doesn't actually need them, because most of these characters immediately drop out of the plot. The Kingdom soon abandons its Washington political wranglings and focuses exclusively on the four agents on the ground in Saudi Arabia. At first the focus on this small group sustains the picture. The investigation, such as it is, gets bogged down by the stark difference in forensic procedures (or lack thereof), the friction over whether the oppressive regime will let them do their jobs, and the treatment of Jennifer Garner's character in a society where women can't show their faces in public. (Adding to the tension, the Americans constantly complain and drop f-bombs.) The Kingdom mostly retains its sense of realism in these sections, a prized attribute indeed for films dealing with the Middle East. It's all the more problematic, then, that the last 30 minutes get sucked up by an improbable and protracted shoot-out. These video-game aesthetics -- where every character has as many bullets and/or combat skills as he or she needs -- have no place in the movie Berg was originally trying to create. They leave The Kingdom feeling like it \"cut and run\" on its instincts toward complexity, and opted for the easier route of explosions and simplistic resolutions.", "actors": ["Jamie Foxx", "Chris Cooper", "Jennifer Garner", "Jason Bateman"], "directors": ["Peter Berg"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDIzOTYwMV5BMl5BanBnXkFtZTcwMTM5OTA1MQ@@._V1_SX300.jpg", "keywords": ["agent [representative]", "bureaucracy", "counterterrorism", "FBI (Federal Bureau of Investigation)", "investigation", "police-officer", "Saudi-Arabia", "terrorist-attack"], "release_year": "2007", "moods": ["Food for Thought"], "urls": "karthik", "themes": ["Behind Enemy Lines", "Hostage Situations", "Race Against Time", "Task Forces", "Terrorism"]}
{"key": "dersamurai-2014", "title": "Der Samurai", "rating": "5.7", "synopsis": "A young policeman (Michel Diercks) in a small German village becomes involved in a peculiar murder investigation when a stranger emerges from the woods, cloaked by a feminine dress, and begins to slaughter the villagers in this energetic take on the classic werewolf story.", "genres": ["Fantasy", "Horror", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=pIc530LsSxM", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/dersamurai-2014?versionId=kUcdfnoWs0rebU3K1UNrBmT8E4cpz39O"}, "review": "", "actors": ["Michel Diercks", "Pit Bukowski", "Uwe Preuss", "Ulrike Hanke-Haensch"], "directors": ["Till Kleinert"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODU0Njg4Nl5BMl5BanBnXkFtZTgwNzY5MzMzNjE@._V1_SX300.jpg", "keywords": ["German [nationality]", "homosexual", "murder", "Samurai", "townspeople", "transvestite", "werewolf"], "release_year": "2014", "moods": ["Blood and Gore"], "urls": "karthik", "themes": ["Crisis of Conscience", "Metamorphosis", "Ninjas", "Questioning Sexuality", "Self-Destructive Romance", "Werewolves"]}
{"key": "high-rise-2015", "title": "High-Rise", "rating": "5.7", "synopsis": "Well-to-do doctor Robert Laing (Tom Hiddleston) moves into the 25th floor of an experimental high-rise apartment complex on the outskirts of London in 1975, attracted by the upper-class lifestyle promoted by its architect (Jeremy Irons). The building is secluded from the outside world and functions as its own autonomous community; in addition, it's organized by a rigid caste system, with the least wealthy residents situated on the lower floors. Laing befriends a documentary filmmaker (Luke Evans) who lives on the second floor, and soon becomes aware of the social inequities within the complex. As tensions between the tenants boil over, an all-out war erupts that divides the classes into violent tribes vying for the top floors. Ben Wheatley directed this wildly imaginative and chaotic adaptation of J.G. Ballard's 1975 novel, with Amy Jump serving as screenwriter. High-Rise premiered at the 2015 Toronto International Film Festival.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=LKPghZ5cc_E", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/high-rise-2015?versionId=0q6nOshGgknZOuJeYCuxPDjHZjRYw6un"}, "review": "", "actors": ["Tom Hiddleston", "Jeremy Irons", "Sienna Miller", "Luke Evans"], "directors": ["Ben Wheatley"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MjM4NzMwMl5BMl5BanBnXkFtZTgwMTQ4MjUzODE@._V1_SX300.jpg", "keywords": ["architect", "caste-system", "skyscraper", "tribe", "uprising"], "release_year": "2015", "moods": ["Head Trips"], "urls": "karthik", "themes": ["Class Differences", "Feuds", "Social Injustice", "Technology Run Amok"]}
{"key": "kickin'itoldskool-2007", "title": "Kickin' It Old Skool", "rating": "4.6", "synopsis": "Rendered comatose for 20 years after a freak breakdancing accident, former child dancer Justin Schumacher (Jamie Kennedy) awakens from his extended repose with no motor skills and the mental capacity of a 12-year-old. So much has changed since Justin lapsed into a coma; not only have people stopped wearing parachute pants, the Internet has connected people in a manner that no child of the 1980s could have ever imagined. Dancing, however, is the one constant that remains as popular as ever. Upon discovering that his mountainous medical bills have drained mom and dad's bank account and the love of his life (Maria Menounos) is engaged to his lifelong nemesis (Michael Rosenbaum), the breakdancing Rip Van Winkle attempts to reassemble his former dance troupe in hopes of winning back the girl and saving his parents' failing yogurt shop.", "genres": ["Comedy"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=ZPNnyR8fPDE", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/kickin%27itoldskool-2007?versionId=RhNCfV81NENWu9a57QesIF9mhgjd25pF"}, "review": "", "actors": ["Jamie Kennedy", "Maria Menounos", "Miguel A. Núñez Jr.", "Michael Rosenbaum"], "directors": ["Harvey Glazer"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzU4OTAxM15BMl5BanBnXkFtZTcwODY0OTQ0MQ@@._V1_SX300.jpg", "keywords": ["coma", "dance-troupe", "mental-retardation", "breakdancing"], "release_year": "2007", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Time Sleepers", "Otherwise Engaged", "Love Triangles"]}
{"key": "treasurebuddies-2012", "title": "Treasure Buddies", "rating": "4.6", "synopsis": "Everyone's favorite canine film series continues with this installment following five chatty pups as they venture to Egypt in search of a mythical jewel that was once the treasure of Cleocatra's collection. Upon learning that the famed Cat's Eye jewel is hidden somewhere in Egypt, Rosebud, Budderball, B-Dawg, Mudbud, and Buddha set out on the adventure of a lifetime. But they're not the only ones racing to procure the Cat's Eye, because a treacherous feline named Ubasti seeks to harness the gemstone's power to gain the ultimate advantage in the eternal war between cats and dogs. Perhaps with a little help from a friendly camel named Cammy and an artful orangutan named Babi, our four-legged heroes can track down the Cat's Eye first, and prevent a true catastrophe from disturbing the balance in the animal kingdom.", "genres": ["Comedy", "Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=dJ-4LrurxoE", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/treasurebuddies-2012?versionId=sAt.Q8e.scjsQhXBaE3_fLgGfbXyi.Jm"}, "review": "", "actors": ["Tucker Albrizzi", "Adam Alexi-Malle", "Tim Conway", "Mason Cook"], "directors": ["Robert Vince"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTc0NTI2OF5BMl5BanBnXkFtZTcwMjU2MzIzNw@@._V1_SX300.jpg", "keywords": ["jewel", "puppy", "quest", "treasure-hunt"], "release_year": "2012", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Man's Best Friend", "Talking Animals", "Treasure Hunts"]}
{"key": "thedaviddance-2014", "title": "The David Dance", "rating": "7.8", "synopsis": "A Buffalo resident named David (Don Scime) adopts a confident persona as the host of a gay-themed radio show, but remains lost and insecure in his real life. However, he must face his failures and become a better man when his sister (Antoinette LaVecchia) asks him to act as a father figure to a Brazilian orphan she's adopting. Directed by Aprill Winney, The David Dance is based on Scime's play of the same name.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=R5SZz20YoSk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thedaviddance-2014?versionId=ZHMSHmwYkp7b5.hd.qdbyWZrGnafH7e2"}, "review": "", "actors": ["Don Scime", "Guy Adkins", "Antoinette LaVecchia", "Jordan Baker"], "directors": ["Aprill Winney"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTQ1MTgwOTc0NV5BMl5BanBnXkFtZTcwNTE1Nzc5OQ@@._V1_SX300.jpg", "keywords": ["Brazilian  [nationality]", "father-figure", "insecurity", "orphan", "radio-broadcaster", "radio-personality", "radio-shop", "sister"], "release_year": "2014", "moods": ["A Good Cry", "Only Human"], "urls": "karthik", "themes": ["Adoption", "Non-Traditional Families"]}
{"key": "i.t.-2016", "title": "I.T.", "rating": "5.4", "synopsis": "Successful businessman Mike Ryan (Pierce Brosnan) enlists the help of Ed Porter (James Frecheville), his company's I.T. consultant, to improve his home's security. However, Porter begins manipulating the technology in his client's smart home after taking an inappropriate interest in Ryan's young daughter (Stefanie Scott), setting up a high-stakes battle of wits. Anna Friel co-stars in this techno-thriller directed by John Moore.", "genres": ["Crime", "Drama", "Mystery"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=hfnDTvbtDUI", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/i.t.-2016?versionId=K.v_BN6pa2bp0.VYDMvJRqmi0jb9XzN2"}, "review": "", "actors": ["Pierce Brosnan", "Jason Barry", "Karen Moskow", "Kai Ryssdal"], "directors": ["John Moore"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzY3MzYzNF5BMl5BanBnXkFtZTgwNzgzMTA3OTE@._V1_SX300.jpg", "keywords": ["businessperson", "daughter", "hacker", "security-expert", "threat"], "release_year": "2016", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Computer Paranoia", "Fathers and Daughters", "Stalkers"]}
{"key": "stuck!-2009", "title": "Stuck!", "rating": "3.5", "synopsis": "An innocent young woman is wrongfully accused of murdering her mother and sentenced to death in Firecracker director Steve Balderson's campy homage to the women in prison genre. Enslaved by her sadistic female warden and left to the mercy of her hardened fellow inmates, frightened innocent Daisy (Starina Johnson) struggles to maintain her integrity as her life becomes a living hell behind bars. Karen Black, Mink Stole, Jane Weidlin, Stacy Cunningham, and Pleasant Gehman star.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=cqFiLXN4nIc", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/stuck%21-2009?versionId=XEHNXhF0NQGai._XyvJeY_OH6XKFgpDF"}, "review": "", "actors": ["Karen Black", "Jane Wiedlin", "Mink Stole", "Susan Traylor"], "directors": ["Steve Balderson"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTU2MTk1NTkxMl5BMl5BanBnXkFtZTcwMTAyOTU5Mg@@._V1_SX300.jpg", "keywords": ["false-accusation", "false-conviction", "inmate", "prison", "sadist", "warden"], "release_year": "2009", "moods": ["Trashy"], "urls": "karthik", "themes": ["Women in Prison"]}
{"key": "camino-2015", "title": "Camino", "rating": "4.9", "synopsis": "A photojournalist (Zoe Bell) embeds herself with a group of missionaries in 1985 Colombia, but when she witnesses the group's leader (Nacho Vigalondo) commit a horrific murder, she is forced to go on the run with the evidence of his crime. Directed by Josh C. Waller.", "genres": ["Action", "Adventure", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=c8pKvWllm24", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/camino-2015?versionId=l_zFENohs4PVKjjzdrkY5DPKvNKqQ1Da"}, "review": "", "actors": ["Zoë Bell", "Nacho Vigalondo", "Francisco Barreiro", "Sheila Vand"], "directors": ["Josh C. Waller"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxOTIyNTgyNF5BMl5BanBnXkFtZTgwODM1NjQwNzE@._V1_SX300.jpg", "keywords": ["Colombia", "missionary", "murder", "photojournalist", "revolutionary"], "release_year": "2015", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Life Under Occupation", "Political Unrest", "Whistleblowers"]}
{"key": "saturdaymorningmystery-2012", "title": "Saturday Morning Mystery", "rating": "4.4", "synopsis": "Four young ghost hunters and their lovable mutt explore a derelict schoolhouse with a dark history.", "genres": ["Comedy", "Horror"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=oM3wOd-Rc2c", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/saturdaymorningmystery-2012?versionId=HVPFTk_S2HmxDFw_12rZDWvZ4hOcUiHF"}, "review": "", "actors": ["Jonny Mars", "Josephine Decker", "Adam Tate", "Ashley Spillers"], "directors": ["Spencer Parsons"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTM4OTQ1MDMwOF5BMl5BanBnXkFtZTcwMDgwMjg2OQ@@._V1_SX300.jpg", "keywords": ["dog", "ghost", "ghostbuster", "haunted", "schoolhouse", "supernatural-forces"], "release_year": "2012", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Amateur Sleuths", "Ghosts"]}
{"key": "don'tthinktwice-2016", "title": "Don't Think Twice", "rating": "7.6", "synopsis": "Mike Birbiglia (Sleepwalk With Me) wrote, directed, and stars in this bittersweet look at trying to make it in showbiz. He plays a member of a six-person improv-comedy troupe called the Commune, all of whom are still clinging to their dreams of stardom well into their thirties. When one of them actually lands a role on a hugely popular sketch-comedy TV show, the remaining members are forced to reflect on their failures and whether it's time to get a \"real\" life. Keegan-Michael Key, Gillian Jacobs, Kate Micucci, Tami Sagher, and Chris Gethard co-star. Don't Think Twice made its world premiere at the 2016 South by Southwest Film Festival.", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=9RFTpObS95U", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/don%27tthinktwice-2016?versionId=5KMUvwiyXL0bDPv0YjWRu1S4PMQqbukS"}, "review": "", "actors": ["Mike Birbiglia", "Gillian Jacobs", "Kate Micucci", "Tami Sagher"], "directors": ["Mike Birbiglia"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTkwODM2MF5BMl5BanBnXkFtZTgwNjYwNjY5ODE@._V1_SX300.jpg", "keywords": ["actor", "comedy", "improvisation", "show", "show-business", "stardom", "troupe"], "release_year": "2016", "moods": ["Food for Thought"], "urls": "karthik", "themes": ["Actor's Life", "Big Break"]}
{"key": "ismileback-2015", "title": "I Smile Back", "rating": "6.1", "synopsis": "Laney Brooks (Sarah Silverman) is a New Jersey housewife with a picturesque life, a loving and successful husband Bruce (Josh Charles) with whom they have two children. Despite the appearance of happiness, Laney has suffered from depression all her life, stemming from the father that abandoned her and her family at a young age. Laney copes with her affliction through a reckless indulgence in sex, drugs and alcohol. As her addictions worsen, they threaten to tear apart the family at its seams. Adam Salky directed this unflinching drama.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=YIBqq-AQcE0", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/ismileback-2015?versionId=Da9AsAUXNIoa5.Q3nG59xnxrty2sIOTb"}, "review": "Laney Brooks (Sarah Silverman) lives two lives. On the outside, she's a devoted wife to her insurance salesman/author husband Bruce (Josh Charles) and a loving mother to her two children (Shayne Coleman and Skylar Gaertner). She's earnestly protective and adoring of her children and supportive of her husband's career, which has afforded the family to live comfortably in suburban New Jersey. On the inside, Laney is on the brink of collapse -- her internal struggle with depression and addiction is boiling over and threatening to derail her entire family.Laney recklessly indulges in drugs, alcohol and extramarital affairs in an attempt to cope with her affliction, but the dangerous cycle only further buries her under the weight of her sorrow. She is consumed with the fear that she'll pass her depression on to her children and goes to great lengths to protect them from any thorny situations. This overprotection stems in part from her own tumultuous upbringing, in which her father left her as a pre-teen and then never reconnected later in life. Laney's inability to balance desire and obligation eventually forces the hand of Bruce, who takes her to a rehab facility to get clean. She emerges from rehab focused on being a parent and a wife but her demons once again beckon in a gripping final act.Under the steady direction of Adam Salky, I Smile Back is a fearless study of a parent in the throes of addiction and depression. The script, co-written by Amy Koppelman and Paige Dylan, was adapted from Koppelman's 2008 novel of the same name. Silverman takes a tremendous leap of faith outside of her comfort zone and gives a nuanced and emotionally draining performance as the existentially conflicted Laney. It's an incredibly demanding role for any actress, and Silverman breathes a veracity and authenticity into the well-trotted \"dysfunctional suburban housewife\" trope. I Smile Back is careful not to make Laney a one-dimensional character with \"daddy issues\" -- while her fractured relationship with her father no doubt has a role in her psyche, Laney's maladies are not easily diagnosable by pointing out one or two sources. Laney's bipolar propensities play out evocatively before our eyes; the tender moments she shares with her children are juxtaposed with hurried lines of cocaine and her destructive sexual escapism. Anyone who has dealt with depression or addiction either personally or secondhand will see the sincerity and heartbreak of Laney.The ones who make you laugh the loudest tend to be the most tortured, reserved ones in the room. As a comedienne, Silverman has spoken openly about her own battles with depression as devices in her stand-up. So much of modern comedy is built on a keen self-awareness and a seemingly never-ending barrage of self-deprecation. In her first truly dramatic leading role, Silverman is able to channel that complexity into a vulnerable and courageous turn as Laney. I Smile Back is a gritty and demanding drama with an ending that, albeit potentially divisive, will stick in your gut long after the credits roll.", "actors": ["Josh Charles", "Skylar Gaertner", "Shayne Coleman", "Sarah Silverman"], "directors": ["Adam Salky"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NDQ3MzgxOF5BMl5BanBnXkFtZTgwMDAzMjExNzE@._V1_SX300.jpg", "keywords": ["addiction", "alienation", "anxiety", "depression", "mother", "rehabilitation [detox]"], "release_year": "2015", "moods": ["Uncomfortable Viewing"], "urls": "karthik", "themes": ["Alcoholism", "Crumbling Marriages", "Drug Addiction", "Parenthood", "Suburban Dysfunction"]}
{"key": "wardogs-2016", "title": "War Dogs", "rating": "7.2", "synopsis": "In this comedy-drama based on true events, a down-on-his-luck massage therapist living in Miami (Miles Teller) teams up with a mercurial former classmate (Jonah Hill) to try to make it in the arms-dealing business. After starting small, the pals eventually get in over their heads when they land a 300-million-dollar contract with the U.S. government to supply weaponry for forces in Afghanistan. Directed by Todd Phillips.", "genres": ["Comedy", "Crime", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=Rwh9c_E3dJk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/wardogs-2016?versionId=8S89Jz6tI8MKVDduPvNlFldwaFnsWODZ"}, "review": "After directing a run of hugely successful raunchy comedies (including Old School and the Hangover series), Todd Phillips now takes on the story of two real-life bros who attempted to make a fortune by cheating the system. Based on a Rolling Stone article by Guy Lawson, War Dogs centers on two greenhorn arms dealers who sell weaponry and equipment to the U.S. military, and who eventually hit the jackpot when they land a 300-million-dollar contract with the government. The film is told from the perspective of David Packouz (Miles Teller), a frustrated, down-on-his-luck massage therapist who unexpectedly reconnects with a volatile former friend named Efraim Diveroli (a scenery-chomping turn from Jonah Hill). With a baby on the way and in desperate need of cash, Packouz teams with his old pal to exploit new legislation that requires America's armed forces to accept bids from smaller, independent contractors. Their quest for bigger money leads the two men to do business with a highly successful, yet dangerously shady, weapons kingpin (Bradley Cooper, making the most of his too-brief screen time).Anyone who's ever seen a movie about career criminals knows that the suspense revolves around when, not if, the hammer will finally drop. Phillips (who also co-wrote the script with Stephen Chin and Jason Smilovic) never lets us forget that sense of urgency, while simultaneously squeezing as much exhilaration as possible out of the pair's wild ride. The plot is quick but not rushed, and a lot of that has to do with the \"show, don't tell\" manner in which it is presented. Although the dialogue mentions several times that Packouz and Diveroli are fans of Scarface, War Dogs feels closer in spirit to some of Martin Scorsese's films; that similarity is evident in the voice-overs from Packouz, a prototypical desperate character who is slowly seduced to the dark side, as well as the freeze-frames that occasionally accompany his narration. The movie particularly owes a debt to Scorsese's 2013 The Wolf of Wall Street, which also features a group of gleefully rebellious, morally depraved protagonists.And just as in The Wolf of Wall Street, Hill skillfully mines dark humor from an immature and reckless loose cannon. The movie does itself no favors by revealing the full extent of Diveroli's sociopathic nature early on, a narrative choice that renders the character's actions during the climax less of a surprise. However, Hill still manages to carry the film by committing to the role's goofy idiosyncrasies, turning comedic quirks into signs of a disaffected, toxic personality. Teller is capable of terrific performances (as seen in his turn opposite J.K. Simmons in Whiplash), but he seems to be holding back here when sharing the screen with Hill, and his scenes at home with his wife (Ana de Armas) and child don't have the emotional heft they should.War Dogs also possesses a soundtrack full of baby-boomer rock favorites, another Scorsese trademark (especially in Goodfellas and The Departed). Unfortunately, these music picks are too on-the-nose to really work, and it's disappointing that they crowd out composer Cliff Martinez's score. Still, the film ultimately succeeds because it deftly blends together the outrageousness of a wild comedy with the tension of a gangster flick, creating something that will likely appeal to fans of both Casino and Superbad. Many movies try to be brash and outlandish, but few achieve that aim with the sharpness and authenticity of War Dogs. Audiences know by now that there's a lot more to Hill's talents than just sophomoric laughs, and director Todd Phillips makes a similar case for expanding his own range here.", "actors": ["Miles Teller", "Steve Lantz", "Gregg Weiner", "David Packouz"], "directors": ["Todd Phillips"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzQ0NzM4MV5BMl5BanBnXkFtZTgwMDI0ODM2OTE@._V1_SX300.jpg", "keywords": ["business", "capitalism", "career", "contract", "forces [military]", "government", "weapons-dealer"], "release_year": "2016", "moods": ["Comedy on the Edge"], "urls": "karthik", "themes": ["Big Break", "Schemes and Ruses"]}
{"key": "chronicle-2012", "title": "Chronicle", "rating": "7.1", "synopsis": "A loner (Dane DeHaan) escapes his abusive home life and discovers a mysterious crater that gives him and two fellow high school students psychokinetic powers in this found-footage-style superhero film from director Josh Trank and screenwriter Max Landis. DeHaan plays Andrew, a angsty teen whose mother is dying and whose father takes out his violent frustrations out on the boy. As a result, Andrew starts filming everything around him, including the dreadful night that he, his cousin Matt (Alex Russell) and the soon-to-be senior class president, Steve (Michael B. Jordan), wake up with superpowers after exploring a condemned piece of land housing an unexplained power source. The three bond over their newfound abilities, with Andrew clearly leading the pack in terms of control and strength. Despite their noble intentions, a darker streak appears in one of them as the other two try to take control over a situation that soon spirals into homicidal madness -- all of which is captured on camera.", "genres": ["Sci-Fi", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=i-M5Qx57_UU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/chronicle-2012?versionId=huW3JnPjzwEY9EBPf8tX3QjUSmPJecQG"}, "review": "Villains rarely get the lead-character treatment in Hollywood, and that alone makes Chronicle worthy viewing if one is craving a unique found-footage film. Imagine an X-Men movie in which the narrative follows the loner kid who gets superpowers, becomes popular, then spirals into madness once his crummy domestic life becomes too much. It's a fascinating -- and bold -- premise that screenwriter Max Landis and director Josh Trank have concocted for what is otherwise a straightforward Hollywood release.Though Andrew Detmer (Dane DeHaan) at first seems insufferably emo (his initial bummed-out line readings are pretty terrible), this is one character arc that's a welcome change of pace compared to the cinematic superhero tropes audiences have come to expect. The picture opens as Detmer starts videotaping his life, which is filled with verbal and physical abuse from both his father and bullies at school, along with a tragic home life that revolves around his terminally ill mother. Things turn around one night when he and two fellow students are given telekinetic powers after discovering a mysterious crater outside a rave. Soon, the three develop their gifts and go through the highs and lows of this newfound responsibility, with Andrew becoming a darker force each day as his inhuman powers grow stronger.On the technical end, the movie finds a number of satisfying ways to capture the action on camera -- which is quite the revelation when dealing with the found-footage artistic style. And while the picture may push the boundaries of this shooting aesthetic a bit too far in the end, forgiving viewers will be happy with the fantastic eye candy that's being delivered. Ironically enough, though the picture excels at breathing new life into the world of handheld fiction on the big screen, its stringent use of personal cameras could be considered a hindrance. While there are legitimate reasons why the main character would turn psychotic, there's never a clear reason as to why he is always filming himself -- even though the dialogue is filled with endless references to cameras, which in and of itself becomes bothersome. Still, Chronicle is quite an achievement, and it's a film that genre enthusiasts should not miss.", "actors": ["Dane DeHaan", "Alex Russell", "Michael B. Jordan", "Michael Kelly"], "directors": ["Josh Trank"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjYzMDQ0MV5BMl5BanBnXkFtZTcwNzE1OTM5Ng@@._V1_SX300.jpg", "keywords": ["control", "discovery", "super-power", "teenagers"], "release_year": "2012", "moods": ["Fantastic Reality"], "urls": "karthik", "themes": ["Crisis of Conscience", "Miraculous Events", "Psychic Abilities"]}
{"key": "rulesofengagement-2000", "title": "Rules of Engagement", "rating": "6.4", "synopsis": "In this drama, two U.S. Marines who stood side by side on the field of battle are reunited in a court of law. Attorney Hayes Hodges (Tommy Lee Jones) once aspired to a career as an officer, but a serious injury in Vietnam put an end to his military future, leaving him bitter and resentful. Col. Terry L. Childers (Samuel L. Jackson) fought alongside Hodges and once saved his life; when Childers is threatened with a court martial for ordering his troops to fire on civilians during a raid on an American embassy, Hodges is the only lawyer that he can trust, and the case gives Hodges a chance for revenge against the military system that he feels has wronged him. Rules of Engagement also features Kim Delaney, Ben Kingsley, Blair Underwood, and Anne Archer.", "genres": ["Drama", "Thriller", "War"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=4ACfE_R-SfA", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/rulesofengagement-2000?versionId=8DeZcI_.NqpgtBuDhaVxQ2HSyam9TASq"}, "review": "William Friedkin falls just short of success with this derivative military courtroom drama, the director's umpteenth attempt at a career comeback. Rules of Engagement begins with a one-two punch, comparing America's late 20th century political entanglements in the Middle East to the quagmire of Vietnam. Friedkin stages these early battle scenes with authentic suspense, tension, and conflict. Unfortunately, the film quickly devolves into a hybrid rip-off of A Few Good Men (1992) and Clear and Present Danger (1994), as a self-doubting lawyer confronts his demons in the courtroom while attempting to unravel a high-level political conspiracy. After posing complicated, probing questions about subjects of global significance, Rules of Engagement disappointingly falls to pieces by embracing formula, wrapping up its morally complex tale with a series of pat, too-easy answers.", "actors": ["Tommy Lee Jones", "Samuel L. Jackson", "Guy Pearce", "Ben Kingsley"], "directors": ["William Friedkin"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjZmNWI1MTgtZjVjNi00M2FjLWI4YjUtNzkwNmYyMzM4NjMwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SX300.jpg", "keywords": ["courtmartial", "embassy", "injury", "lawyer", "Marines", "military", "revenge", "veteran [military]"], "release_year": "2000", "moods": ["Spellbinders"], "urls": "karthik", "themes": ["Courts Martial", "Faltering Friendships", "Military Life", "Political Corruption"]}
{"key": "slingshot-2014", "title": "SlingShot", "rating": "7.7", "synopsis": "A documentary profiling Segway inventor Dean Kamen and his quest to deliver safe water to the world's population by developing SlingShot, a vapor compression device that produces clean water. Kamen, who is also known for inventing a variety useful of medical devices utilizes a non-linear approach to his creative process. Because many third world countries do not have access to safe water the pathogens in the water supply can cause widespread illness. Kamen has tackled this problem and developed a system that can turn poisoned well water and river sludge into safe drinking water. Directed by Paul Lazarus.", "genres": ["Documentary", "Biography", "News"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=4FlM9EEQfvU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/slingshot-2014?versionId=1a52SE35RLakm2YP1.94gOovqAHVSPX4"}, "review": "", "actors": ["Dean Kamen"], "directors": ["Paul Lazarus"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTQxMTQwNTE3MV5BMl5BanBnXkFtZTgwMjU0MDU1NjE@._V1_SX300.jpg", "keywords": ["Africa", "crisis", "inventor", "passion", "problem-solving", "safe", "technology", "Third-World", "water"], "release_year": "2014", "moods": ["Food for Thought", "Triumph of the Spirit"], "urls": "karthik", "themes": ["Heroic Mission", "Inventors", "Plagues and Epidemics", "Protecting the Innocent", "Reluctant Hero", "Wishes Come True"]}
{"key": "kingsglaive:finalfantasyxv-2016", "title": "Kingsglaive: Final Fantasy XV", "rating": "7.0", "synopsis": "In order to protect his people from an invading army, King Regis (voice of Sean Bean) summons the mighty soldiers of the Kingsglaive. The two forces then do battle for control of a powerful crystal. Takeshi Nozue directed this animated action fantasy, which serves as a tie-in movie to the video game Final Fantasy XV and tells a story that runs parallel to the game's plot. Aaron Paul and Lena Headey also provide their voices.", "genres": ["Animation", "Action", "Adventure"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=htnkOpknGok", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/kingsglaive%3Afinalfantasyxv-2016?versionId=8whS3wgFTHkFhBTpHlPihH_70rOiijzF"}, "review": "", "actors": ["Aaron Paul", "Sean Bean", "Lena Headey", "David Gant"], "directors": ["Takeshi Nozue"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNzMxNTU5M15BMl5BanBnXkFtZTgwMzMyMjg3OTE@._V1_SX300.jpg", "keywords": ["army", "attack", "empire", "forces [military]", "kingdom", "power", "soldier", "threat"], "release_year": "2016", "moods": ["For Love of Country"], "urls": "karthik", "themes": ["Bodyguards"]}
{"key": "dependent'sday-2016", "title": "Dependent's Day", "rating": "7.3", "synopsis": "A wannabe actor (Joe Burke) tries to get his life together and patch things up with his girlfriend (Benita Robledo), who is supporting him financially as he pursues his dreams of stardom. Written and directed by Michael David Lynch.", "genres": ["Comedy", "Drama", "Romance"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=MCRqlPSyD2g", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/dependent%27sday-2016?versionId=Zhn7yAG7Nxp.jh1Lf_HRgVm09k0w9ok3"}, "review": "", "actors": ["Joe Burke", "Benita Robledo", "Shannon Lucio", "Josh Staman"], "directors": ["Michael David Lynch"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODg4Nzc5MV5BMl5BanBnXkFtZTgwMDg2NDg1NzE@._V1_SX300.jpg", "keywords": ["actor", "dependence", "dreams", "girlfriend", "stardom"], "release_year": "2016", "moods": ["Comedy on the Edge", "In the Mood for Love"], "urls": "karthik", "themes": ["Actor's Life", "Life in the Arts", "Opposites Attract", "Twentysomething Life"]}
{"key": "crd-2016", "title": "CRD", "rating": "N/A", "synopsis": "A college student and budding playwright clashes with his ruthlessly strict teacher, and eventually decides to put together his own ragtag troupe in the hope of winning a competition at a theatre festival. Mrinmayee Godbole, Vinay Sharma, Saurabh Saraswat, Abhay Mahajan, and Isha Keskar star. Directed by Kranti Kanade.", "genres": ["Comedy", "Drama", "Romance"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=roN3Y_OjRSc", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/crd-2016?versionId=VSWKNf3LuXDV9WerDdfdzhr61xb.SJ1c"}, "review": "", "actors": ["Abhay Mahajan", "Mrinmayee Godbole", "Vinay Sharma", "Saurabh Saraswat"], "directors": ["Kranti Kanade"], "picture_url": "N/A", "keywords": ["college", "competition", "subversive", "teacher", "theater", "troupe"], "release_year": "2016", "moods": ["Only Human", "Uncomfortable Viewing"], "urls": "karthik", "themes": ["Actor's Life", "Betrayal", "Contests, Pageants and Competitions", "Life in the Arts", "Romantic Betrayal", "Writer's Life"]}
{"key": "liars,firesandbears-2012", "title": "Liars, Fires and Bears", "rating": "6.8", "synopsis": "A hardened 9-year-old foster child Eve (Megli Micek) teams up with a bumbling 30-year-old Dave (Lundon Boyd) for a cross country road trip.", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=wmhyZvEafs8", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/liars%2Cfiresandbears-2012?versionId=XsVmmU3cUENXpi80.OZRYraoxR9xURtO"}, "review": "", "actors": ["Megli Micek", "Lundon Boyd", "Luke Jones", "Melody Melendez"], "directors": ["Jeremy Cloe"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNDM5MzA1Ml5BMl5BanBnXkFtZTcwNjgyNDE4Nw@@._V1_SX300.jpg", "keywords": ["cross-country", "drunk", "foster-home", "precociousness", "road-trip"], "release_year": "2012", "moods": ["Off the Beaten Path", "Only Human", "Triumph of the Spirit"], "urls": "karthik", "themes": ["Alcoholism", "Dysfunctional Families", "Finding a Way Back Home", "On the Run", "Orphans", "Redemption"]}
{"key": "infernal-2015", "title": "Infernal", "rating": "3.3", "synopsis": "A young couple is thrilled to be expecting their first child, a daughter. But when she begins to display abnormal behavior they worry she may have a psychological problem. Their worry quickly turns to terror when supernatural events coincide with her strange conduct. Starring, Andy Ostroff, Heather Adair and Alyssa Koerner.", "genres": ["Horror"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=cgaxiGGfk0s", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/infernal-2015?versionId=emqJyDmVeJrU_9GiftcWugIhrcX4VOFQ"}, "review": "", "actors": ["Andy Ostroff", "Heather Adair", "Alyssa Koerner", "Jose Rosete"], "directors": ["Bryan Coyne"], "picture_url": "N/A", "keywords": ["child", "couple", "daughter", "supernatural", "terror"], "release_year": "2015", "moods": ["Nail-biters", "Spellbinders"], "urls": "karthik", "themes": ["Demonic Possession", "Evil Children"]}
{"key": "cutsnake-2014", "title": "Cut Snake", "rating": "5.7", "synopsis": "In this intense crime thriller set in mid-'70s Melbourne, an ex-con's (Alex Russell) attempts to go straight and start a new life with his fiancée (Jessica De Gouw) are endangered when his old cellmate (Sullivan Stapleton) tracks him down and asks for his help with a serious crime. Directed by Tony Ayres. The film was screened in the Contemporary World Cinema division at the 2014 Toronto International Film Festival.", "genres": ["Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=STHHZWXp-Vw", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/cutsnake-2014?versionId=D3GPJJZNp5zq_BQQ7l2orw4SeqxT.VKG"}, "review": "", "actors": ["Sullivan Stapleton", "Alex Russell", "Jessica De Gouw", "Megan Holloway"], "directors": ["Tony Ayres"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzI5Nzk3MF5BMl5BanBnXkFtZTgwMzA2Mjk4NjE@._V1_SX300.jpg", "keywords": ["cellmate", "crime", "ex-convict", "fiancee", "reform [improve]"], "release_year": "2014", "moods": ["Nail-biters", "Tough Guys"], "urls": "karthik", "themes": ["Dangerous Friends", "One Last Heist"]}
{"key": "tumbledown-2015", "title": "Tumbledown", "rating": "6.2", "synopsis": "The grieving widow (Rebecca Hall) of a singer-songwriter clashes with an acerbic journalist (Jason Sudeikis) who arrives in her small Maine town announcing he's writing a biography about her late husband and his mysterious death. What begins as a clash of wills evolves into something more profound, as the journalist's presence helps her make peace with her husband's passing. Directed by Sean Mewshaw.", "genres": ["Comedy", "Music", "Romance"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=haVs8nSq6ZY", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/tumbledown-2015?versionId=.ZlsD.NQVKedupN3zjG.6iQKZ9jSvo4O"}, "review": "", "actors": ["Rebecca Hall", "Dianna Agron", "Joe Manganiello", "Jason Sudeikis"], "directors": ["Sean Mewshaw"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzkwOTQ1M15BMl5BanBnXkFtZTgwMjcxMzg2NzE@._V1_SX300.jpg", "keywords": ["disappearance", "journalist", "memoir", "rurality", "singer/songwriter", "widow/widower", "writing"], "release_year": "2015", "moods": ["A Good Cry", "Pick-Me-Ups", "Unloveables"], "urls": "karthik", "themes": ["Death of a Partner", "Musician's Life", "Opposites Attract", "Starting Over", "Writer's Life"]}
{"key": "iamnumberfour-2011", "title": "I Am Number Four", "rating": "6.1", "synopsis": "A teenage fugitive with an incredible secret races to stay one step ahead of the mysterious forces seeking to track and destroy him in this sci-fi action thriller from director D.J. Caruso (Disturbia, Eagle Eye). With three dead and one on the run, the race to find the elusive Number Four begins. Outwardly normal teen John Smith (Alex Pettyfer) never gets too comfortable in the same identity, and along with his guardian, Henri (Timothy Olyphant), he is constantly moving from town to town -- the perpetual new kid in a series of strangely familiar schools. Despite the fact that his nomadic lifestyle has made it difficult to form meaningful connections, John experiences the joy of first love with a beautiful young woman (Dianna Agron) and begins to unlock his full potential after arriving with Henri in a small Ohio town. With each passing day, John gains a stronger grasp on his extraordinary new powers, and his bond to the beings that share his fantastic fate grows stronger.", "genres": ["Action", "Adventure", "Sci-Fi"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=g5djHG3hPu0", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/iamnumberfour-2011?versionId=yK_k.O3kUKQpuK47uHSgOt3YePuiVuJG"}, "review": "If you're going to make a movie that's frankly ridiculous, the worst thing you can do is be timid about it. A lot of sci-fi and fantasy films are built on \"Aw, come on now\"-worthy premises, but if you charge forward with enough energy and attitude, you can roll right over the viewer's suspension of disbelief. A great example is last year's wildly under-appreciated The Warrior's Way, which piled one crazy idea on another and gave them plenty of room to bounce off against each other as they cohered into gloriously absurd and rewarding entertainment. The greatest failing of I Am Number Four, the screen adaptation of Pittacus Lore's sci-fi novel, is that it keeps threatening to get full-on ridiculous, yet doesn't actually do so until the last act, when it's really too late to save the day. Most of the time, I Am Number Four doesn't know if it wants to be a young-adult War of the Worlds or a big-screen version of Dawson's Creek about the new kid who's really from out of town; most of the time it leans to the latter, which in this case was not a good choice.I Am Number Four stars Alex Pettyfer as John Smith, who has just moved to Paradise, OH, from New Mexico with his dad, Henry (Timothy Olyphant). Or at least that's what his new classmates at school think; actually, John is one of the last of the Lorians -- survivors of an alien civilization who are in hiding on Earth from the Mogadorians, their arch enemies who act like the meth-crazed school bullies of the universe. John just wants to blend in and not call attention to himself, which is just what his guardian Henry wants, since there are Mogadorians in the United States looking for them. But almost without trying, Alex gets on the wrong side of Mark (Jake Abel), the arrogant and short-tempered captain of the football team, when he befriends Sam (Callan McAuliffe), a nerdy kid obsessed with UFOs and ancient astronauts, and falls for Sarah (Dianna Agron), a pretty girl with an artsy bent who used to date Mark. Like his fellow Lorians, John has some pretty impressive superpowers, and while trying to protect Sarah from Mark, he ends up tipping his hand and revealing his true nature, not long after we learn that Sam's dad was abducted by aliens and may be unwittingly luring the Mogadorians to Paradise.In its final reels, I Am Number Four dramatically shifts gears and transforms itself into a slam-bang sci-fi action epic overloaded with special effects and full of battles between various all-powerful folks from other worlds, and if it's way over the top, it's also fun and doesn't skimp on imagination and interstellar fisticuffs. The trouble is, by the time I Am Number Four summons up the courage to get full-on ridiculous, it's too late -- the movie has spent so long dealing with John's teen angst and his played-cute romance with Sarah that the narrative has fallen into a coma, and even the closing fireworks can't rouse it. Most of the time, I Am Number Four plays more like a pilot for some basic-cable TV series about winsome teens in the Midwest than a sci-fi thriller, and while both Alex Pettyfer and Dianna Agron are both appropriately teen-star pretty, neither of them has the charisma or imagination to make their characters worth caring about after they've been together onscreen for a few minutes. Jake Abel is more effective as the jock/bully who seems almost as threatening as the Mogadorians, but he has only one move in his dramatic arsenal and it wears out long before the movie ends. Callan McAuliffe is believable as the target of Mark's sadistic pranks, though he's also annoying enough that it's easy to see why everyone picks on him. And while Teresa Palmer is fun, spunky, and kicks serious butt in the finale as another Lorian exile, she also seems to have dropped into I Am Number Four by accident from another, significantly more entertaining movie.Of course, the cast can only do so much with what they're given, and the screenplay by Alfred Gough, Miles Millar, and Marti Noxon (adapted from a novel co-written by James Frey, who has embraced a pseudonym and young-adult fiction after suffering the Wrath of Oprah) is blah and full of clichés, and can't conjure up much of a reason why the Mogadorians are out to take over the universe beyond simply being a bunch of meanies (and even if they are the bad guys, they seem to be having a lot more fun than most anyone else in this movie). And director D.J. Caruso (who, as the auteur behind Disturbia and Eagle Eye, is an expert at directing Shia LaBeouf, if nothing else) is inconsistent with his pacing, doesn't draw much from his cast, and drains the bulk of the movie of any emotional energy. Even though I Am Number Four rallies for a big finish, it almost seems as if we're watching another story when the big battle and a really teed-off Mogadorian critter finally pump some adrenaline into this picture. Better to wait until this shows up on DVD or Blu-ray so you can jump to the big stuff at the end rather than sitting through the dross that sets it up.", "actors": ["Alex Pettyfer", "Timothy Olyphant", "Teresa Palmer", "Dianna Agron"], "directors": ["D.J. Caruso"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDI1MTMyM15BMl5BanBnXkFtZTcwMDMzMTcyNA@@._V1_SX300.jpg", "keywords": ["alien [not human]", "fugitive", "escape"], "release_year": "2011", "moods": ["Fantastic Reality"], "urls": "karthik", "themes": ["Benign Aliens", "Chosen One", "On the Run"]}
{"key": "thejunglebook-2016", "title": "The Jungle Book", "rating": "7.6", "synopsis": "In this reimagining of the classic collection of stories by Rudyard Kipling, director Jon Favreau uses visually stunning CGI to create the community of animals surrounding Mowgli (Neel Sethi), a human boy adopted by a pack of wolves. The appearance of a villainous tiger named Shere Khan (voiced byIdris Elba) forces Mowgli's guardian, the panther Bagheera (Ben Kingsley), to shepherd the child to safety in the \"man village.\" Along the way, the boy meets an affable, lazy bear named Baloo (Bill Murray), as well as a snake with hypnotic powers (Scarlett Johansson) and an orangutan (Christopher Walken) who wants to harness the power of fire. Lupita Nyong'o, Giancarlo Esposito, and Garry Shandling also lend their voices to this adventure tale.", "genres": ["Adventure", "Drama", "Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=5mkm22yO-bs", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thejunglebook-2016?versionId=jB43QP.IFmRIeSoOURz3yQAV4k5A9iLU"}, "review": "Jon Favreau's ambitious retelling of the beloved 1967 Disney animated film The Jungle Book could have been a success based solely on the sum of its parts; the star wattage of its voice actors alone rivals the cast of any other popcorn flick hitting theatres this year. In order to truly do justice to its predecessors, however, the reboot needed to have enough heart to match its visually stunning CGI animals and backdrop. Fortunately, this incarnation is able to capture the spirit of the source material (which originates in Rudyard Kipling's 1894 collection of stories of the same name), paying appropriate reverence to past versions while also creating its own unique wrinkles, humor, and overall journey.We first find Mowgli (played here by newcomer Neel Sethi) struggling to fit in while living among a wolf pack, despite the diligent tutelage of his mentor and guardian, the panther Bagheera (voiced by Ben Kingsley). After direct threats from human-hating tiger Shere Khan (Idris Elba, whose vocal work is both enthralling and chilling), the boy's adoptive wolf parents Raksha (Lupita Nyong'o) and Akela (Giancarlo Esposito) are forced to let Bagheera escort their son to the \"man village\" for his own safety. But Mowgli is separated from the panther during his reluctant trip to the human refuge, and a hypnotizing encounter with the transfixing snake Kaa (Scarlett Johansson) ends with the boy being rescued at the last possible moment by an affable, lazy bear known as Baloo (Bill Murray, providing terrific comic relief). Bagheera and Baloo, uneasy acquaintances who are quickly forced to become an odd couple of sorts, help Mowgli escape the grasp of orangutan King Louie (Christopher Walken), who wishes to harness the power of fire. Later, their journey culminates in a final battle with Shere Khan.Favreau and the rest of the creative team behind this remake (especially screenwriter Justin Marks) are to be commended for crafting a well-thought-out plot that draws on prior adaptations of the story. Their choice to spend a substantial amount of time with the wolf family who raised Mowgli pays great dividends, as Nyong'o's performance offers an emotional heft that adds undeniable gravitas to the picture. This incarnation also reprises most of the 1967 film's classic tunes: Murray professes his appreciation for the \"Bear Necessities,\" and Walken does a rendition of \"I Wan'na Be Like You\" that remains an earworm while shedding most of the original version's uncomfortable racial overtones. Favreau is not afraid to go his own way here, particularly with a showdown that varies greatly from the animated version, and which leads to a fresh, distinctive coda for a new generation of viewers.Of course, there are certain aspects of the classic Disney film that are downplayed in this remake. Kaa's role has been greatly diminished, and her accompanying musical number, \"Trust in Me,\" isn't heard until the credits. Also, it's slightly disappointing that there are no Beatles-inspired vultures here who break out into a mellow, groovy tune (a number that many modern artists probably would have been eager to recreate). And the 3D gimmick of the film's theatrical release, almost compulsory for children's entertainment these days, feels unnecessary in this instance, as the finely tuned CGI work and colorful settings are immersive enough on their own. If anything, the 3D makes the movie seem too busy at times.These minor qualms don't diminish The Jungle Book's charm, though, as Favreau has not only created a wondrous world here, but crafted a heartwarming story about responsibility, loss, and the importance of utilizing one's own gifts and talents. Both neophytes and fans of the 1967 movie can enjoy this adorable yet weighty tale, which captures the spirit of the Disney canon as well as any of the studio's recent releases. Although it's a remake, this Jungle Book hits the mark by just being itself.", "actors": ["Neel Sethi", "Bill Murray", "Ben Kingsley", "Idris Elba"], "directors": ["Jon Favreau"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTUzNTI4MV5BMl5BanBnXkFtZTgwNjU0NjU5NzE@._V1_SX300.jpg", "keywords": ["boy", "jungle"], "release_year": "2016", "moods": ["Young and Old Alike"], "urls": "karthik", "themes": ["Monkeys", "Survival in the Wilderness", "Talking Animals"]}
{"key": "disorder-2015", "title": "Disorder", "rating": "6.2", "synopsis": "Vincent (Matthias Schoenaerts), a young soldier suffering from PTSD, returns home from war and becomes a security guard for a beautiful woman (Diane Kruger) while her husband is away on a business trip. When he discovers a threat made against his client, Vincent fights to protect her in this thriller directed by Alice Winocour.", "genres": ["Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=2g7oFxlBeg4", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/disorder-2015?versionId=_mBhHrdfTPC4LetWNe1lp2vrTrn1670T"}, "review": "", "actors": ["Matthias Schoenaerts", "Diane Kruger", "Paul Hamy", "Zaïd Errougui-Demonsant"], "directors": ["Alice Winocour"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Mjk5NTUwNV5BMl5BanBnXkFtZTgwNzU2Mzk2OTE@._V1_SX300.jpg", "keywords": ["post-traumatic-stress", "security-guard", "soldier", "trauma", "woman"], "release_year": "2015", "moods": ["In a Minor Key", "Spellbinders"], "urls": "karthik", "themes": ["Bodyguards", "Dangerous Attraction", "Home From the War", "Mental Illness", "Party Film"]}
{"key": "insidemen-2015", "title": "Inside Men", "rating": "7.0", "synopsis": "A powerful South Korean newspaper editor ensures a political victory for a candidate through the power of the press, but is double crossed by one of the politician's aides. Meanwhile, an investigator into the corruption begins a dogged search for the truth, seeing the case as his opportunity to make a name for himself. This political thriller is directed by Min-ho Woo.", "genres": ["Crime", "Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=ZFqPiGgFSDk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/insidemen-2015?versionId=g8s9uJ_sH8uptP1LRtwYuWorGbMqxN.J"}, "review": "", "actors": ["Byung-hun Lee", "Seung-woo Cho", "Yun-shik Baek", "Kyeong-yeong Lee"], "directors": ["Min-ho Woo"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BOWY3MGUyYmItZTZjOC00N2NlLWFmOWUtNWZkYWJiNDQ0NjhhXkEyXkFqcGdeQXVyNjQ4NTczMDE@._V1_SX300.jpg", "keywords": ["betrayal", "candidate", "corruption", "double-cross", "editor", "investigator", "Korean [nationality]", "newspaper", "power"], "release_year": "2015", "moods": ["Adrenaline Rush", "Nail-biters"], "urls": "karthik", "themes": ["Betrayal", "Conspiracies", "Criminal's Revenge", "Dangerous Friends", "One Against the Mob", "Out For Revenge", "Scandals and Cover-Ups"]}
{"key": "lovedon'tcostathing-2003", "title": "Love Don't Cost a Thing", "rating": "5.0", "synopsis": "The sophomore outing for writer/director/actress Troy Beyer, Love Don't Cost a Thing is a romantic teen comedy based on the screenplay for the 1987 Partick Dempsey film Can't Buy Me Love. Nick Cannon stars as Alvin, a brilliant but awkward teenager -- and budding engineer -- who seizes a golden opportunity when popular cheerleader Paris (Christina Milian) wrecks her parents' SUV and is strapped for cash.  They strike an agreement: Alvin will do the repairs for free if Paris pretend to be his girlfriend for two weeks, all in the hopes of elevating his social standing. Little does he know, being popular isn't all its cracked up to be. Kal Penn and Steve Harvey co-star.", "genres": ["Comedy", "Romance", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=pYh6aNsS0fE", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/lovedon%27tcostathing-2003?versionId=GA9ZXjNpWs0bL2Glmn0HYGiXI_1r5ecp"}, "review": "It has the misfortune of being named after a Jennifer Lopez song, but otherwise, Love Don't Cost a Thing is a tight little urban remake of Can't Buy Me Love. In fact, certain lines of dialogue are cut and pasted word for word, but that just increases the positive associations for those fond of the original. Though the intended audiences don't overlap, the teen-movie truths are universal -- whether it's Patrick Dempsey or Nick Cannon, they both need to check themselves before they wreck themselves. Love Don't Cost a Thing is as joyful as it is because of Cannon's charismatic performance as Alvin Johnson. He's affectionately geeky at the start, and his caricature of the bling-bling \"playa\" stops just short of offensive stereotypes. The same can be said of Steve Harvey as Alvin's father. Capable of really grating, here Harvey finds just the right pitch for the role of Alvin's overzealous sex coach, including a scene in which he humorously outlines the potential usage scenarios for a shoebox full of prophylactics. Jokes about condoms notwithstanding, the film takes a sweetly optimistic view of modern teenagers, racially integrating their social groups wherever possible (Alvin's three best friends are white, black, and Indian), and rarely offering any hint of real violence. What's more impressive is that director Troy Beyer goes well beyond the minimum competence required of her. She sets her camera up in ways that challenge the norm, including filming a conversation among popular kids by placing the camera inside the microwaves and pantry cabinets they open during home ec class. Love Don't Cost a Thing is no classic -- in fact, it's not even as good as the guilty pleasure that inspired it. But it's a lot better than it needed to be, and paints outside the numbers enough to seem pretty satisfying.", "actors": ["Nick Cannon", "Jordan Burg", "Jackie Benoit", "George Cedar"], "directors": ["Troy Byer"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTUyMTY4NDk2NF5BMl5BanBnXkFtZTcwNzU0MTYyMQ@@._V1_SX300.jpg", "keywords": ["car-mechanic", "friendship", "high-school", "nerd", "popularity"], "release_year": "2003", "moods": ["Triumph of the Geeks"], "urls": "karthik", "themes": ["Class Differences", "High School Life", "Opposites Attract", "Pygmalion Stories", "Schemes and Ruses", "Social Climbing", "Unrequited Love"]}
{"key": "hail,caesar!-2016", "title": "Hail, Caesar!", "rating": "6.4", "synopsis": "Slick Hollywood fixer Eddie Mannix (Josh Brolin) is pressed into action when superstar actor Baird Whitlock (George Clooney) is kidnapped and held for ransom by a mysterious group. Mannix races to quietly collect the ransom money without gossip columnists Thessaly and Thora Thacker (Tilda Swinton in a dual role) catching wind of the scandal. Alden Ehrenreich, Ralph Fiennes, Scarlett Johansson, Jonah Hill, Frances McDormand, and Channing Tatum co-star in this comedy set in Hollywood's golden age. Directed by Joel and Ethan Coen.", "genres": ["Comedy", "Mystery"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=kMqeoW3XRa0", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/hail%2Ccaesar%21-2016?versionId=LCy5DOFAhvfd3M.vWNnWHbfToulqUFfg"}, "review": "Overworked Eddie Mannix (Josh Brolin) is a \"fixer\" -- he's employed by the Capitol Pictures movie studio during Hollywood's 1950s golden age in order to clean up the messes made by actors who can't stick to the morals clause in their contracts, and to distract snoops like competing gossip-columnist twins Thora and Thessaly Thacker (Tilda Swinton in a dual role that's equal parts Hedda Hopper and Connie Marble from Pink Flamingos) from spilling the beans about who's queer, who's knocked up, and who's a scandal waiting to happen. Mannix is deeply Catholic, but his guilt is oversized compared to his sins (he visits confession daily to report on each cigarette he shouldn't have smoked, exasperating even his priest). So when the studio's biggest star, Baird Whitlock (George Clooney), goes AWOL from the sword-and-sandal epic he's shooting, it's up to Mannix to smooth over his disappearance and determine where he's gone on a bender this time. Little does he know that Whitlock is munching finger sandwiches at a teatime \"study group\" held at a seaside estate, where many, shall we say, progressive screenwriters are in attendance and the host's dog is named \"Engels.\"The Coen brothers indulge their desire to be the head of their own movie studio in Hail, Caesar!, larding Mannix's story with authentically vintage scenes from Capitol's upcoming release slate: a singing-cowboy oater, a debonair parlor drama, a biblical epic, a musical, and an Esther Williams-style aquatic ballet. So what if swimming sensation DeeAnna Moran (Scarlett Johansson) stomps off the set in her mermaid costume, demanding that someone get her out of her \"fish ass\" so she can have a cigarette? In the moments when she's floating around at the center of a kaleidoscope of chorines, her winning smile has a wattage long lost from American movies. (And speaking of star power: It is such a pleasure to watch Channing Tatum's incisive, vigorous physicality onscreen, whether it's as an Olympic wrestler in Foxcatcher or an adult entertainer in Magic Mike, or here as a song-and-dance man performing an extended Anchors Aweigh-style musical number in sailor whites. He belongs to that rarest class of actors whose physical intelligence is the wellspring of their charisma -- indeed, the last great one before him was Bruce Lee, and before that, Gene Kelly. Jackie Chan was an exceptional athlete and John Travolta a great dancer in their respective primes, but they lacked the vital quality shared by Kelly and Lee and Tatum: You can see their muscles thinking.)The citizens of a Coen brothers' movie generally do not have character arcs. They are born whole in their first frames embodying certain attributes, like virtuous Marge Gunderson or murderous Anton Chigurh or thoroughly mellow Jeffrey \"The Dude\" Lebowski, and while they might suffer as a result of their unchangeable natures, they do not seize on painful experiences as an opportunity for growth. Sometimes this can be an exhilarating way for morality tales to unfold in ordinary spaces, as in Fargo or No Country for Old Men; and sometimes it can just be a mess, as when J.K. Simmons' CIA honcho in Burn After Reading echoes the audience's thoughts by declaring, after a particularly convoluted debriefing, \"Report back to me when this all makes sense.\" Hail, Caesar! falls somewhere between the two. It wants to be a chronicle of Mannix's moral crisis as a good man in servitude to a decadent system, with multiple shots of clock faces standing in contrast to Hollywood's unchanging, carefree (and conscience-free) \"now.\" But Mannix's ethical epiphany tiptoes in and out of the room so quietly at the climax that it's easy to miss, and its meekness opens an opportunity for the audience to shrug and say \"So what?\" to all of the admittedly entertaining high jinks that came before.The most important shot in the movie slides by without comment. There's a scene in the aquatic musical in which Moran rises crowned and beaming out of the water like Venus on the half-shell, skin and hair and swimsuit perfectly dry -- a little bit of vintage Hollywood illusion usually created by lowering the actor into the water and then running the film in reverse. But a moment later, she wrenches off her crown and stomps off the set, planting her butt in a chair and lighting a cigarette, all while still bone-dry. Is this a world where actors can emerge from the water without a drop on them if they simply will it? Or if their star power permits it? What's even stranger, none of the technicians on set comment on this ability -- it is quickly accepted and forgotten, as if it's a truth of this world in which the normal rules of behavior, whether related to sin and rectitude or cause and effect, don't apply. Hail, Caesar! can't decide if it's a historically inspired drama or an allegorical work of fantasy, and yet this is not a flaw. It's a strange puzzle box of a movie, as impenetrable in its own way as Mulholland Drive, and its slippery, shape-shifting nature defies all of the usual critical assessments, except one: It's worth seeing.", "actors": ["Josh Brolin", "George Clooney", "Alden Ehrenreich", "Ralph Fiennes"], "directors": ["Ethan Coen", "Joel Coen"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyODc3MTI2NF5BMl5BanBnXkFtZTgwNDMxMjU2NzE@._V1_SX300.jpg", "keywords": ["Communism", "gossip-columnist", "Hollywood", "movie-studio", "musical [play]", "water-ballet"], "release_year": "2016", "moods": ["Comedy on the Edge", "Memory Lane"], "urls": "karthik", "themes": ["Actor's Life", "Filmmaking", "Kidnapping", "Scandals and Cover-Ups"]}
{"key": "lifeofpi-2012", "title": "Life of Pi", "rating": "8.0", "synopsis": "Yann Martel's ponderous adventure novel gets the big-screen treatment with this Fox 2000 adaptation helmed by director Ang Lee. The coming-of-age story surrounds the son of a zookeeper who survives a shipwreck by stowing away on a lifeboat with a zebra, an orangutan, a hyena, and a Bengal tiger by the name of Richard Parker. Suraj Sharma heads up the cast as the young boy, with Gérard Depardieu, Adil Hussain, Irrfan Khan, Rafe Spall, and Bollywood actress Tabu also starring.", "genres": ["Adventure", "Drama", "Fantasy"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=j9Hjrs6WQ8M", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/lifeofpi-2012?versionId=T36ZERuw1j.8hVQHuWEi.upGD4epDwil"}, "review": "One boy's struggle to survive being shipwrecked at sea with a fierce Bengal tiger becomes a poetic meditation on faith and perseverance in Ang Lee's Life of Pi, a stunningly gorgeous adventure drama with a rich spiritual subtext. It's largely a one-man show that seduces us with lucid 3D imagery, and it resonates as a drama thanks to newcomer Suraj Sharma's ability to convincingly alternate between youthful vulnerability and ageless bravery as his character experiences an intense crisis of faith.As the film opens, a young writer (Rafe Spall) sits across from Pi (Irrfan Khan) and waits to hear a story so incredible that it will shake the foundations of the skeptical scribe's beliefs. The tale begins innocently enough, with a young Pi (Sharma) attempting to establish his spiritual identity while growing up on the grounds of his family's zoo in a French region of India. Yet just as Pi begins to experience the joys of first love, his father announces that the family will soon be starting a new life in Winnipeg. The clan and all of their exotic animals travel to Canada by boat, but a massive storm sends the vessel plunging to the ocean floor, with the terrified Pi, an injured zebra, a hyena, an orangutan, and a Bengal tiger named Richard Parker just barely managing to escape in a lifeboat. After the skies clear and the wild animals begin to clash, Pi finds himself alone in the middle of the ocean with Richard Parker as he prays for a rescue that never comes. In the days and weeks that follow, Pi and Richard Parker establish a mutually respectful bond that helps both to endure when it seems that all hope is lost. It's only later, when a pair of Japanese insurance adjustors turn up seeking to verify Pi's remarkable story, that we discover the crucial role that faith played in keeping him alive on the open seas.The first thing that grabs you about Life of Pi is Claudio Miranda's lush, intoxicatingly vivid cinematography. Opening with shots of the animals in Pi's father's zoo, director Lee establishes a peaceful, Zen-like tone as Miranda's camerawork brings to mind groundbreaking nature documentaries like the recent Planet Earth or the gorgeous Born to Be Wild. Subsequently introducing us to the protagonist as he begins to share his tale with the eager young writer, screenwriter David Magee endears us to Pi by offering a glimpse of the childhood events that would shape his spiritual beliefs and personality. Whether peppering Pi's memories of his beloved uncle with gentle humor, portraying an early bout of heartbreak with poignant brevity, or showing a painful life lesson that will later play a crucial role in the plot, Magee front-loads Life of Pi with a profundity that's perfectly complemented by Miranda's gorgeous images and Lee's inspired stylistic flourishes. The talents of all three coalesce beautifully, giving the film a rich sense of soul-searching that's violently shattered when the boat carrying Pi and his family to their new lives sinks in a scene that's sure to be remembered as one of the most intense and awe-inspiring shipwrecks ever portrayed on film. An unforgettable shot of Pi sinking beneath the waves as the massive ship plummets into the abyss is positively breathtaking, and young star Sharma handles the physically and emotionally demanding scene like a seasoned pro.Later, as the film settles into the rhythms of Pi's epic struggle to survive being stranded at sea with a traumatized (and hungry) Bengal tiger, Sharma remains in top form as Lee and Miranda turn what could have been a stagy section of the movie into a thing of visual splendor. Likewise, Magee's screenplay keeps things consistently interesting by conveying just what a profound effect the experience is having on Pi as he faces a series of unexpected challenges. It's never dull or repetitive, and by taking us inside of Pi's head as he fights to keep himself and Richard Parker alive, the filmmakers give a rather simple story compelling depth.At times it feels as if each scene in Life of Pi is more beautifully rendered than the last -- not just visually, but subtextually as well. By the time Pi reveals a side of the story few would see coming, the development catches us off guard without feeling gimmicky; it adds to the film's reflective tone rather than detracting from it, and ends Pi's incredible tale on a note that's deeply spiritual without being preachy. That's a particularly fine line to walk, but in the capable hands of Lee and company, it's done with flawless balance.", "actors": ["Suraj Sharma", "Irrfan Khan", "Ayush Tandon", "Gautam Belur"], "directors": ["Ang Lee"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTg2OTY2ODg5OF5BMl5BanBnXkFtZTcwODM5MTYxOA@@._V1_SX300.jpg", "keywords": ["cat", "chimpanzee", "hyena", "lifeboat", "lost-at-sea", "religion", "sea-disaster", "shipwreck", "tiger", "zoo"], "release_year": "2012", "moods": ["Eyepoppers"], "urls": "karthik", "themes": ["Disasters at Sea", "Stranded"]}
{"key": "chagall-malevich-2014", "title": "Chagall-Malevich", "rating": "5.7", "synopsis": "A recreation of the worlds of artists Marc Chagall and Kazimir Malevich, during Chagall's time living in what is now known as Belarus in the late 1910s.", "genres": ["Biography", "Drama", "History"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=8DWwuX8ifPE"}, "review": "", "actors": ["Leonid Bichevin", "Anatoliy Belyy", "Kristina Schneidermann", "Semyon Shkalikov"], "directors": ["Aleksandr Mitta"], "picture_url": "N/A", "keywords": ["art", "artist", "folklore", "Jewish"], "release_year": "2014", "moods": ["Only Human"], "urls": "karthik", "themes": ["Lawyers", "Life Under Occupation", "Tortured Genius"]}
{"key": "nowyouseeme2-2016", "title": "Now You See Me 2", "rating": "6.5", "synopsis": "In this sequel, the illusionists known as the Four Horsemen (Jesse Eisenberg, Woody Harrelson, Lizzy Caplan, and Dave Franco) return to perform a spectacular stunt in the hopes of clearing their names and exposing the unscrupulous behavior of a tech mogul named Walter Mabry (Daniel Radcliffe). However, Mabry soon turns the tables, and forces the group to steal a revolutionary decrypting device for him. Directed by Jon M. Chu (G.I. Joe: Retaliation).", "genres": ["Action", "Adventure", "Comedy"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=4I8rVcSQbic", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/nowyouseeme2-2016?versionId=oIRIv_yJM6QEezeaKryRI5lMHPGmpmb7"}, "review": "The expert magicians who make up the Four Horsemen drop the Robin Hood act for the sake of self-preservation in this sequel to the 2013 hit. Now You See Me 2, a movie focused on illusionists and sleight-of-hand artists, looks to make a name for itself in the same manner as any good magician: It creates arresting images in order to distract us from the trickery that makes the whole act work. The quartet (which now includes Lizzy Caplan, replacing Isla Fisher from the previous film) must once again deal with magic debunker Thaddeus Bradley (Morgan Freeman), who is now plotting against the team from jail after they framed him for a robbery he didn't commit; however, FBI agent Dylan Rhodes (Mark Ruffalo), an ally of the Horsemen, decides to deal with him by springing him from his cell. Meanwhile, the foursome are horrified when a seemingly triumphant return gig that's meant to expose a white-collar criminal is sabotaged. The incident introduces them to tech entrepreneur Walter Mabry (Daniel Radcliffe), who threatens to have his henchmen kill the crew unless they steal a highly valuable computer chip for him. And the wealthy, nefarious Arthur Tressler (Michael Caine), who lost millions thanks to a Horseman trick in the last film, is still on their trail and eager for vengeance, as is the twin brother of team member Merritt McKinney (both brothers are played by Woody Harrelson), who has a less-than-cordial relationship with his sibling.The actors who portray the central protagonists fire on all cylinders, elevating this boilerplate material in the process. Jesse Eisenberg serves as the group's smarmy, smug, yet somehow charming leader, who is able to get viewers invested in his whiz-kid-gets-his-comeuppance arc. Caplan is perhaps the most dynamic performer in the entire film, playing against type as an offbeat goofball with a sharp wit that comes out when she's tested (her wisecracks provide some of the funniest moments). Dave Franco is quietly becoming a slyly funny and versatile leading man. And there may be no safer bet in Hollywood at this point than casting Woody Harrelson as the member of an ensemble. Able to play central characters (The Messenger), comic relief (Zombieland), or even the face of pure evil (Out of the Furnace), Harrelson manages here to pull off the feat of bringing to life both Merritt and his ball-busting twin -- a dual role that, had it been essayed by someone without his sense of humor and acting chops, could have torpedoed the whole movie.Unfortunately, the plot contains several developments that come off as too trite or half-baked for a film about exposing the planning behind seemingly unexplainable feats, which means that viewers who aren't already enthralled by the art of magic will probably feel cheated. Much of the problem stems from the way the movie handles its ancillary characters. Ruffalo does his best, but he's undermined by a clunky screenplay that doesn't do justice to his character, who's supposed to be the emotional center of the story. New additions Radcliffe and Jay Chou (the latter portrays an employee at an upscale, well-respected shop for magicians) are given short shrift, as both men seem like they're playing plot devices rather than three-dimensional human beings. And Michael Caine's role as a one-note antagonist is such a slog that it's a wonder director Jon M. Chu didn't just replace him with a CGI beast, or at least give him a fake mustache to twirl.The movie as a whole doesn't satisfy as anything beyond surface-level flash; it's visually appealing, but too kitschy and airless to make any lasting impact. Like most magic shows, this film depends on the audience's investment in the spectacle: Viewers who are just looking for a good time and some well-executed tricks will be entertained, but those seeking more substantial fare will likely end up feeling slightly duped.", "actors": ["Jesse Eisenberg", "Mark Ruffalo", "Woody Harrelson", "Dave Franco"], "directors": ["Jon M. Chu"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ0NDgwODQ3NV5BMl5BanBnXkFtZTgwOTYxNjc2ODE@._V1_SX300.jpg", "keywords": ["magician [performer]"], "release_year": "2016", "moods": ["Fantastic Reality"], "urls": "karthik", "themes": ["Crime Sprees", "Dishonor Among Thieves", "Priceless Artifacts and Prized Objects", "Race Against Time", "Wizards and Magicians"]}
{"key": "brotherlylove-2015", "title": "Brotherly Love", "rating": "7.0", "synopsis": "Forging a way out of Philadelphia's roughest neighborhood is a life or death matter for siblings June, (Cory Hardrict), Sergio (Eric D. Hill Jr.) and Jackie (Keke Palmer). So when Sergio's skill on the basketball court promises an escape, it looks like he'll avoid the fate that befell the streetwise June. But the temptations of 'hood life still pull hard on a loving family trying their best in a world that's stacked against them.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=mOACSS97KQM", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/brotherlylove-2015?versionId=i9.TwhoSS8Fxcg3YYg3gKgSpvmjdJq7T"}, "review": "", "actors": ["Keke Palmer", "Cory Hardrict", "Romeo Miller", "Eric D. Hill Jr."], "directors": ["Jamal Hill"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MTEyMzA0OF5BMl5BanBnXkFtZTgwMDk1NzA0NDE@._V1_SX300.jpg", "keywords": ["basketball", "dreams", "inner-city"], "release_year": "2015", "moods": ["Only Human"], "urls": "karthik", "themes": ["Basketball Players", "Inner City Blues", "Innocence Lost", "Journey of Self-Discovery", "Kids in Trouble"]}
{"key": "hoteltransylvania-2012", "title": "Hotel Transylvania", "rating": "7.1", "synopsis": "Samurai Jack's Genndy Tartakovsky directed this animated tale concerning a hotel where monsters such as Dracula (voice of Adam Sandler), the Invisible Man (David Spade), Frankenstein (Kevin James), and his bride (Fran Drescher), along with a host of others, head to relax from a world full of humans. When a young man (Andy Samberg) stumbles onto the resort and falls for Drac's teenage daughter Mavis (Selena Gomez), comedy high jinks ensue. Cee Lo Green, Steve Buscemi, and Molly Shannon also lend their voices.", "genres": ["Animation", "Comedy", "Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=q4RK3jY7AVk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/hoteltransylvania-2012?versionId=BwGvjG7cntCJE7aNG.NfdVw7W1ZL7HhE"}, "review": "Emmy Award-winning animator and Samurai Jack creator Genndy Tartakovsky makes his feature directorial debut with Hotel Transylvania, an endearing tale about an overprotective Dracula intent on sheltering his beloved daughter from the vicious humans who killed her mother. The result is a film that will tickle parents with a soft spot for creature features while it puts a good-humored spin on familiar monster lore. Brimming with a sense of dynamic visual energy courtesy of Tartakovsky, and bursting with ghoulish gags thanks to screenwriters Robert Smigel and Peter Baynham, it falls back on current trends a bit too much to be called a true original, but succeeds at showing impressionable young viewers a playful side of the silver screen's most memorable monsters.His beloved wife killed by monster-hating humans, a grieving Dracula (voice of Adam Sandler) vows to protect his daughter Mavis (Selena Gomez) by building a massive hotel where no human will ever set foot. As a result, the Hotel Transylvania becomes the most popular vacation destination for monsters of all shapes and sizes. Everyone from Frankenstein (Kevin James) to Wayne the Wolfman (Steve Buscemi) to Griffin the Invisible Man (David Spade) all have a warm bed waiting for them at the hotel, but this year, the appearance of a wide-eyed backpacker named Jonathan (Andy Samberg) threatens to turn Mavis' 118th birthday bash into a total disaster. Incensed as Dracula is at the prospect of a human stumbling into his monster safe haven, he attempts to pass off Jonathan as a party planner and distant relative of Frankenstein's, but finds his plan falling apart when Mavis develops a crush on the mortal newcomer while dreaming of life outside of the sprawling castle she's never left.Infused with a kinetic sense of energy thanks to the talented Tartakovsky, Hotel Transylvania is a visual treat for eyes both young and old. With whimsical character designs and carefully detailed sets, Tartakovsky and company make the most of the animated format as the camera frenetically whips and cranes around the castle, and the creatures casually execute moves that would be particularly difficult in a live-action film. Although the scatological humor of the early scenes may leave some parents fearing that co-writers Smigel and Baynham have set their sights squarely at the lowest common denominator, the nuances gradually begin to show when Jonathan recounts his journey in a clear reference to the plot of Bram Stoker's Dracula. And once the festivities get underway, the writers fire off a barrage of classic monster jokes as Jonathan scrambles to maintain his creepy alter ego, and control freak Dracula loosens up while learning that being a good parent means knowing when to let go.Admittedly, the concept of monsters as the good guys and humans as the villains is nothing new in the realm of movies, but Tartakovsky keeps things moving along at a satisfying pace as the stellar voice cast have a field day with their iconic characters. And though James and Buscemi get the majority of the best lines as, respectively, Frankenstein and Wayne, honorable mention goes to Fran Drescher for her portrayal of Frank's bride Eunice as a stereotypical Jersey Shore housewife; Chris Parnell as the Fly; and Jon Lovitz as Quasimodo, the house cook who longs to whip up some Jonathan stew. And though even the most patient of parents will groan like the undead when Dracula starts singing with a vocoder during the obligatory dance number at the end, the little ones aren't likely to be nearly as cynical, making this one mad monster party that's well-worth attending.", "actors": ["Adam Sandler", "Andy Samberg", "Selena Gomez", "Kevin James"], "directors": ["Genndy Tartakovsky"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NjQyODI3M15BMl5BanBnXkFtZTcwMDM4NjM0OA@@._V1_SX300.jpg", "keywords": ["daughter", "hotel", "human", "monster", "resort", "Dracula", "Frankenstein", "hunchback", "mummy", "werewolf"], "release_year": "2012", "moods": ["Other Dimensions"], "urls": "karthik", "themes": ["Fathers and Daughters", "Vampires", "Werewolves"]}
{"key": "thingstocome-2016", "title": "Things to Come", "rating": "7.1", "synopsis": "A fiftysomething leftist philosophy professor (Isabelle Huppert) is propelled into a midlife crisis after being squeezed between caring for her deteriorating mother (Edith Scob) and learning her husband (Andre Marcon) is resigning from their marriage. The blow of confronting her own mortality is cushioned by a friendship with a younger former student (Roman Kolinka), whose invitation to visit his anarchist commune in the countryside allows her a chance to remember the more radical and less burdened person she once was.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=S-xbvt7qdHQ", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thingstocome-2016?versionId=DnWoqLXRSSKP7h2RMB5QwbcewKCizYKu"}, "review": "", "actors": ["Isabelle Huppert", "André Marcon", "Roman Kolinka", "Edith Scob"], "directors": ["Mia Hansen-Løve"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYmNhYTUyYjAtYWJhMy00MTkyLTgwY2MtYTUwOTM0YjQ2MmI3XkEyXkFqcGdeQXVyNjE2MzYxMDQ@._V1_SX300.jpg", "keywords": ["anarchy", "commune", "divorce", "Leftist", "mid-life-crisis", "professor"], "release_year": "2016", "moods": ["Only Human"], "urls": "karthik", "themes": ["Crumbling Marriages", "Death in the Family", "Existential Crisis", "Infidelity", "Journey of Self-Discovery"]}
{"key": "startrekbeyond-2016", "title": "Star Trek Beyond", "rating": "7.2", "synopsis": "In this third installment of the rebooted Star Trek film series (which began with J.J. Abrams's Star Trek in 2009), Captain Kirk (Chris Pine) struggles with a personal crisis as he and the crew of the Enterprise are attacked by a dictator named Krall (Idris Elba). When an assault by Krall leads to the destruction of their starship, the team end up marooned on a remote planet inhabited by aliens both hostile and helpful. Zachary Quinto, Karl Urban, Zoe Saldana, Simon Pegg, John Cho, and Anton Yelchin co-star. Directed by Justin Lin (Fast & Furious 6), Star Trek Beyond is dedicated to both Leonard Nimoy (who passed away in 2015) and Yelchin (who died after filming concluded).", "genres": ["Action", "Adventure", "Sci-Fi"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=XRVD32rnzOw", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/startrekbeyond-2016?versionId=l.LZpIgdt4gK_mRTFUE1uchmc8dcQ9CO"}, "review": "The Starship Enterprise is now three years into its five-year mission, and Captain James T. Kirk (Chris Pine) is getting cabin fever. \"Things are feeling a little episodic,\" he laments to Dr. \"Bones\" McCoy (Karl Urban) over a glass of purloined alien sherry as he reflects on how he's now one year older than the age at which his father, an esteemed Starfleet officer, was killed in action. It's all too heavy for this restless maverick, and so Kirk privately decides it's time to step away from the Enterprise and leave Spock (Zachary Quinto) to command the crew: Uhura (Zoe Saldana), Scotty (Simon Pegg), Sulu (John Cho), Chekov (Anton Yelchin), and all of the other ensigns of Starfleet. He wants to have a talk with Spock right after the ship refreshes its provisions at the space station of Yorktown, but a distress call from an alien ship marooned on a hostile planet interrupts his plans.The Enterprise must travel through a signal-jamming nebula to rescue that lost crew, and it's there that the vulnerable ship is attacked by a swarm of kamikaze drones that punch holes in its hull and send it plummeting to the planet below. The assault is the work of Krall (Idris Elba), a swollen-headed reptile in search of a weapon stashed onboard the Enterprise. Now, the crew must escape from his clutches with the help of native Jaylah (Sofia Boutella), a white-haired alien whose facial markings suggest Darth Maul working a second career at Sephora.Star Trek Beyond director Justin Lin also helmed four of the seven (thus far) Fast and the Furious films, and this equally, needlessly frenetic picture could be retitled \"Fast and Furious and Loud and Expensive.\" Siphoning out the fistfights and exploding spaceships from its two-hour running time would leave about 30 minutes of plot, a sign that this story is essentially an overcomplicated TV episode rather than a movie. The clumsy alien makeup looks more suited for the small screen anyway, and the CGI creatures seem strangely puffy, as if they were inflated like a water balloon. The performances are acceptable, with Zachary Quinto's subtle take on Spock well at the head of the pack, but all of the charismatic menace that Idris Elba demonstrated as the heavy in Beasts of No Nation has disappeared underneath makeup that makes his head look like a budding cactus. Why hire such a compelling actor for this role if all he's going to do is glower and sulk under latex?When the original Star Trek TV series premiered in 1966, Hollywood was on the verge of collapsing under the weight of bloated, overbudgeted spectacles like Doctor Dolittle and Hello, Dolly! It took a younger generation of directors to cut through the grease and create American New Wave masterpieces like Bonnie and Clyde and The Godfather, because the studios couldn't imagine moviemaking being done any other way. Nowadays, U.S. cinema is in the second decade of an absurd glut of superhero flicks, space operas, and recycled -- excuse me, \"rebooted\" -- franchises, cranked out due to the fact that they consistently make money. Star Trek Beyond's exorbitant budget is being bankrolled in part by Chinese investors Alibaba Pictures and Huahua Film & Media Culture, and one can't help but wonder if the character development, social commentary, and philosophical discussions that made this series the subject of intense fandom were intentionally sacrificed so Kirk & co. would be more palatable to foreign audiences. Star Trek has typically been about the excitement of what's to come, but if this is the future of American movies, who needs it?", "actors": ["Chris Pine", "Zachary Quinto", "Karl Urban", "Zoe Saldana"], "directors": ["Justin Lin"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODgzN2E1YjctODg5Yi00YzYwLWJjZjAtNDg2MGE2Y2MyYjBmXkEyXkFqcGdeQXVyNjM1MTQ0NTQ@._V1_SX300.jpg", "keywords": ["alien [not human]", "man-vs-aliens", "mission [quest]", "space", "spacecraft", "space-exploration", "spaceship", "starship"], "release_year": "2016", "moods": ["Adrenaline Rush", "Eyepoppers", "Other Dimensions"], "urls": "karthik", "themes": ["Benign Aliens", "Evil Aliens", "Finding a Way Back Home", "Hotshots", "Space Travel", "Survival in the Wilderness"]}
{"key": "abeautifulnow-2015", "title": "A Beautiful Now", "rating": "6.4", "synopsis": "When a suicidal dancer (Abigail Spencer) locks herself in a bathroom with a gun, her closest friends try to reason with her from the other side of the door. Over the course of one night, the group reflect on the events that made them who they are. Written and directed by Daniela Amavia.", "genres": ["Comedy", "Drama", "Music"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=tC1iyfb-rBo", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/abeautifulnow-2015?versionId=c6sKUbFDYIKDBX08ubqWtTFr.VLm7k3l"}, "review": "", "actors": ["Abigail Spencer", "Cheyenne Jackson", "Collette Wolfe", "Elena Satine"], "directors": ["Daniela Amavia"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NTgwMzM0Ml5BMl5BanBnXkFtZTgwODI3NTE2OTE@._V1_SX300.jpg", "keywords": ["ballerina", "ballet-dance", "ballet-dancer", "bathroom", "friend", "suicide", "suicide-attempt"], "release_year": "2015", "moods": ["Abandon All Hope", "Only Human"], "urls": "karthik", "themes": ["Dancer's Life", "Mental Breakdown", "Mental Illness", "Suicide"]}
{"key": "somekindofhate-2015", "title": "Some Kind of Hate", "rating": "4.6", "synopsis": "In this feminist twist on the slasher genre, a teenage boy (Ronen Rubinstein) gains an ally against bullies after he resurrects the vengeful spirit of a teenage girl (Sierra McCormick) who committed suicide.", "genres": ["Horror"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=07SfDv21Iy4", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/somekindofhate-2015?versionId=Q.mp1VHAezBktZc.N_ZzPb_A6qiyGLrn"}, "review": "", "actors": ["Sierra McCormick", "Andrew Bryniarski", "Spencer Breslin", "Grace Phipps"], "directors": ["Adam Egypt Mortimer"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzExNjQ1Ml5BMl5BanBnXkFtZTgwMDAwODg0NjE@._V1_SX300.jpg", "keywords": ["bully", "ghost", "girl", "high-school", "revenge", "suicide", "zombie"], "release_year": "2015", "moods": ["Blood and Gore"], "urls": "karthik", "themes": ["Deal With the Devil", "Dying Young", "Ghosts", "High School Life", "School Violence [k]", "Suicide", "Teen Angst"]}
{"key": "ayearandchange-2015", "title": "A Year and Change", "rating": "6.5", "synopsis": "After a drunken accident, Owen (Bryan Greenberg) attempts to straighten out his life and reconnect with his estranged son in this comedy-drama directed by Strephen Suettinger.", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=Krr7r1Y9OwU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/ayearandchange-2015?versionId=98rgXOQ10TMY8XRfKUqA58_IfM1mkot8"}, "review": "", "actors": ["Bryan Greenberg", "Claire van der Boom", "T.R. Knight", "Marshall Allman"], "directors": ["Stephen Suettinger"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Njg4NTY0NF5BMl5BanBnXkFtZTgwMjkwNjQ5NjE@._V1_SX300.jpg", "keywords": ["accident", "bonding [relationship]", "change [personal]", "drunk", "family", "love", "son", "time"], "release_year": "2015", "moods": ["Angsty"], "urls": "karthik", "themes": ["Arrested Adolescence", "Existential Crisis", "Fathers and Sons"]}
{"key": "theimpossible-2012", "title": "The Impossible", "rating": "7.6", "synopsis": "Director Juan Antonio Bayona follows up his critically acclaimed feature debut The Orphanage with this drama set during the 2004 Thailand tsunami, detailing one family's incredible fight for survival. Inspired by actual events, The Impossible finds Henry (Ewan McGregor), his wife Maria (Naomi Watts), and their three sons lounging poolside at a scenic Thailand resort following an eventful Christmas. But just as the family begins to forget their troubles and settle in for a relaxing tropical getaway, one of the worst natural disasters in modern history changes their lives in the blink of an eye. Meanwhile, as shock gives way to abject horror, the devoted parents fight to protect their children, encountering scenes of heart-wrenching tragedy and experiencing acts of incredible compassion as the entire country is engulfed in chaos. Tom Hollander and Geraldine Chaplin co-star.", "genres": ["Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=Bgw394ZKsis", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/theimpossible-2012?versionId=TqRTnLS6MHYI7KABe4vswJxvLaYGGKiM"}, "review": "Almost every time we walk into a movie theater, we run the risk of having our emotions manipulated. Whether we're watching a drama, a romance, a comedy, or a horror flick, one of the primary indicators as to whether or not that story will resonate lies in the filmmaker's ability to pull our strings through a delicately balanced blend of effective writing, skillful acting, powerful imagery, and music that reflects (or, in certain instances, contradicts) the mood of the action taking place onscreen. The best directors do this with a subtlety that renders this blatant appeal to our emotions invisible -- leaving us, the audience, alone with the characters up on the screen as they strive to accomplish a certain goal or navigate through a difficult situation. In his second feature The Impossible, Spanish director Juan Antonio Bayona takes us directly into the path of the 2004 Indian Ocean earthquake and tsunami, revealing the true story of how one vacationing family not only managed to persevere through the devastating natural disaster, but, incredibly, reunited amidst the chaos and confusion that immediately followed. It's a truly visceral piece of filmmaking, but alas, it's hindered more than helped by a certain composer's shameless attempts to get our tears swelling right along with his overwrought strings.Henry (Ewan McGregor), his wife Maria (Naomi Watts), and their three sons Lucas (Tom Holland), Thomas (Samuel Joslin), and Simon (Oaklee Pendergast) are lounging poolside at a scenic Thailand resort following an eventful Christmas when one of the worst natural disasters in modern history changes their lives in the blink of an eye. As shock gives way to abject horror, the devoted parents fight to protect their children, along the way encountering scenes of heart-wrenching tragedy and experiencing acts of incredible compassion as the entire country is engulfed in chaos.In 2007, Bayona burst onto the international film scene with The Orphanage. Executive produced by Guillermo del Toro, The Orphanage succeeded not simply due to its ability to frighten, but because it managed to stir our emotions by painting its specters in a tragic light. It was an effective and richly textured psychological drama served up in horror trappings. Five years later, Bayona returns with The Impossible, a film that exchanges the gothic atmosphere of The Orphanage for a sunny beach in Thailand while focusing on the all-too-real horror of a family torn apart by forces far beyond their control. On the surface The Impossible is every parent's worst nightmare brought to life, yet once the surge hits, Bayona and screenwriter Sergio G. Sánchez focus as much on the family's efforts to find each other as they do the inherent selflessness we exhibit in times of great crisis.In The Impossible, Bayona's directorial strengths are immeasurably enhanced by a cast who do an exceptional job of emphasizing the humanity of Sánchez's compact yet emotionally complex screenplay, which alternates between the story of a critically wounded mother who strives to teach her son the healing power of altruism, and a father who refuses to give up hope even when all seems lost. In his very first onscreen film role, gifted young actor Tom Holland nearly steals the show from previous Oscar nominee Watts for a couple of reasons. Holland's remarkable ability to capture the mannerisms and nuances of his movie father serves to constantly remind us of McGregor's presence even when he's offscreen, but it's the talented young actor's ability to portray an effective mix of shock and perseverance that really drives his part of the story. When Lucas first recognizes the extent of his mother's injuries, his shaken reaction perfectly encapsulates that dreaded moment when we realize our parents aren't immortal. As a result, we understand how the tragedy has forced his character to mature in ways that he may not have been ready for. Even though she's muted by an oxygen mask for a good portion of the film, Watts shines as a mother who refuses to let her son's survival instincts overshadow his duties to the less fortunate early on. As the father who's faced with the agonizing decision to leave his two younger sons behind to search for Maria and Lucas, however, it's McGregor who personifies the unwavering sense of hope at the heart of The Impossible. A scene in which Henry uses a stranger's cell phone to place an emotionally charged call home captures that awful feeling when the horrible reality of a traumatic situation begins to set in as our consciousness struggles to catch up with our physical surroundings, and it highlights how the fleeting friendships that emerge in desperate times can have lasting and profound effects.For all of the talent in front of and behind the camera, however, there's one component of The Impossible that threatens to push the entire endeavor over the emotional cliff, and that's Fernando Velázquez's irredeemably unctuous score. With a story this emotional, one can see why Velázquez would be tempted to flex his orchestral muscles, but we hardly need to be told how to feel while watching a movie about a family being ripped apart by a violent force of nature, and in his efforts to enhance the drama, he instead ends up undercutting it. His score for The Impossible is so over-the-top melodramatic that at times it borders on parody, and given the highly effective use of sound design throughout the film, the picture would have been much better served without it.That pronounced shortcoming aside, The Impossible offers a refreshing air of hope in an era obsessed with fatalism, and serves as a stunning reminder that sometimes it's the worst situations that bring out the best in people.", "actors": ["Naomi Watts", "Ewan McGregor", "Tom Holland", "Samuel Joslin"], "directors": ["J.A. Bayona"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTA3NzQ5Nl5BMl5BanBnXkFtZTcwOTYxNjY0OA@@._V1_SX300.jpg", "keywords": ["Christmas", "compassion", "courage", "family", "rescue", "son", "Thailand", "tsunami", "vacation"], "release_year": "2012", "moods": ["Triumph of the Spirit"], "urls": "karthik", "themes": ["Families in Crisis", "Forces of Nature", "Stranded"]}
{"key": "salt-2010", "title": "Salt", "rating": "6.4", "synopsis": "Director Phillip Noyce teams with screenwriters Kurt Wimmer (Equilibrium) and Brian Helgeland (Mystic River) to craft this thriller starring Angelina Jolie as dedicated CIA officer Evelyn Salt, who is accused by a defector of being a Russian spy. With each attempt Salt makes to prove her innocence, her mentor, Winter (Liev Schreiber), only grows more suspicious of her true motivations. The longer she eludes capture by ambitious CIA agent Peabody (Chiwetel Ejiofor), the higher the stakes get.", "genres": ["Action", "Crime", "Mystery"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=QZ40WlshNwU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/salt-2010?versionId=wqcwRsBzpxjcTChosG7as4bAy9mqRxEF"}, "review": "There are great action movies (Die Hard, Hard-Boiled), and then there are highly entertaining action movies (Unleashed, anything directed by Rob Cohen) that keep adrenaline junkies entertained in the downtime before the next true classic arrives. A compact, streamlined espionage thriller from screenwriter Kurt Wimmer and director Phillip Noyce, Salt would never be mistaken for the former, though it snaps into the latter category with the snug click of a perfectly placed Lego. No one who sits through Salt is likely to die of boredom, though they might exit the theater a little sore due to laughing at one of the most ridiculously unconvincing movie disguises in recent memory. But plausibility isn't generally high on the list of crucial ingredients for cooking up an entertaining action flick, and thanks to a quickly paced script and some cleverly executed twists, Salt satisfies the craving for greasy fast-food cinema.Two years after being captured in North Korea and tortured as a suspected spy, top CIA agent Evelyn Salt (Angelina Jolie) is about to celebrate her second wedding anniversary to arachnologist Mike (August Diehl) when she is accused by a terminally ill Russian defective of being a sleeper agent for the Russian government. Desperate to clear her name and protect her husband, Salt takes flight, raising the suspicions of up-and-coming CIA agent Peabody (Chiwetel Ejiofor) even as her mentor, Winter (Liev Schreiber), insists that the accusation is unfounded. Now, in order for Salt to clear her name, she must outrun and outwit both the Secret Service and the CIA, all while uncovering information on a diabolical plot to breathe a big chill back into the Cold War with a high-profile assassination. The longer Salt eludes capture, the higher the stakes get.Shortly after co-writing the screenplay for The Thomas Crown Affair (alongside Leslie Dixon), Kurt Wimmer established himself as a rising force in the realm of over-the-top action cinema by jumping into the director's chair for Equilibrium and Ultraviolet, two sci-fi flicks that took ridiculous to delirious new heights. In 2003, Wimmer edged into espionage territory as screenwriter of the lukewarmly received CIA thriller The Recruit, and now he's teamed with director Noyce to deliver a high-stakes spy thriller that's short on originality, yet bristling with intensity. This time Wimmer seems to have modeled his script on a roller coaster, allowing the butterflies to flutter in our stomachs as we slowly creep up that first giant hill, then maintaining an impressive momentum until the ride stops and we exit our seats. And while there's nothing particularly inventive about a story driven by lingering Cold War tensions, sleeper agents, and assassination plots, Wimmer does manage to sneak in some savory particulars while delving into the details of a top-secret Russian program to topple the United States as a superpower, and to throw a few expertly placed third-act sucker punches.If only Noyce's talents as an action director were better matched to Wimmer's particular abilities as a storyteller, perhaps Salt would have been a bit more than a passable diversion. A talented filmmaker with an eye for detail, Noyce handles the dialogue and setup quite well -- eliciting a palpable sense of vertigo during a tense ledge escape early on, and employing sharp diversionary tactics during a suspenseful funeral scene that kicks the plot into high gear -- but the deeper he wades into the action, the more apparent it becomes that shoot-outs and car chases aren't exactly his forte. Like most action directors these days, Noyce refuses to give viewers a real sense of space by sticking primarily to close-up shots when things start to get hairy, a factor that prevents us from truly connecting with the kinetic events unfolding onscreen. But Noyce is quite good with actors, eliciting performances from Jolie, Schreiber, Ejiofor, and Daniel Olbrychski that go a long way in counter-balancing the hastily helmed action sequences.Odds are, Salt won't be the launching point for a hugely successful blockbuster action series à la The Bourne Identity -- as the filmmakers so clearly intended with the shamelessly open ending -- but until the next time we truly taste greatness, it's digestible enough to trick our stomachs into thinking we've feasted on filet mignon and fine wine, when in reality we've just wolfed down some chicken-fried steak and a chocolate shake.", "actors": ["Angelina Jolie", "Liev Schreiber", "Chiwetel Ejiofor", "Daniel Olbrychski"], "directors": ["Phillip Noyce"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODA2NDg4NV5BMl5BanBnXkFtZTcwMjg4NDAwMw@@._V1_SX300.jpg", "keywords": ["CIA (Central-Intelligence-Agency)", "espionage", "Russian [nationality]", "spy"], "release_year": "2010", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Assassination Plots", "Flight of the Innocent"]}
{"key": "thesolomonbunch-2013", "title": "The Solomon Bunch", "rating": "5.7", "synopsis": "Five sleuthing kids team up to investigate a mysterious stranger who's just arrived in their small town, embarking on a series of clandestine missions to prove that he's up to no good, and ultimately learning an important life lesson about jumping to conclusions in this lighthearted adventure for the entire family.", "genres": ["Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=R0ETx0d2fq4", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thesolomonbunch-2013?versionId=4qC087zbh.6Ok4YOm_XAVYYlRtIG1z6a"}, "review": "", "actors": ["Craig Crumpton", "Audray McCroskey", "Todd Maynor", "Randall Franks"], "directors": ["Jason Prisk"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BNDg2NTkwNTEzOF5BMl5BanBnXkFtZTgwNzUzNjQ2MDE@._V1_SX300.jpg", "keywords": ["childhood-adventures", "investigation", "small-town", "stranger"], "release_year": "2013", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Amateur Sleuths"]}
{"key": "badwords-2013", "title": "Bad Words", "rating": "6.7", "synopsis": "Forty-year-old Guy Trilby (Jason Bateman, starring in his feature directorial debut) discovers a loophole in the National Spelling Bee rules that allows him to compete against the pre-teen participants, and he strikes up an unlikely friendship with a 10-year-old misfit named Chaitanya (Rohan Chand) as he becomes the subject of a news story by probing reporter Jenny Widgeon (Kathryn Hahn).", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=yXoZCAVTzEQ", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/badwords-2013?versionId=FQvDBst4IghAdW4Pe0FevSQL4NCwPkwW"}, "review": "Forty-year-old Guy Trilby is a monster on a mission. The sooner you accept this, the more likely it is that you'll enjoy Bad Words, an uncompromising comedy about an acerbic man who's determined to win the prestigious Golden Quill spelling bee. Like most monsters, Trilby's motives are initially unclear, which inevitably leads to his being misunderstood. Unlike many monsters, however -- and this is the factor that may prevent some from truly connecting with Bad Words, even as they're laughing in spite of themselves -- the people who incur the brunt of his foulmouthed wrath are children. In the course of exploiting an arcane loophole to compete in the bee, Trilby will insult, embarrass, and humiliate anyone who dares get in his way -- and most of the time, those unfortunate victims have yet to hit puberty.The first time we meet Guy Trilby (Jason Bateman, making his feature directorial debut here), he is preparing to participate in the regional spelling bee that will secure his entry into the Golden Quill competition. With a little assistance from his sponsor, an online journalist named Jenny (Kathryn Hahn), he eventually blusters his way onto the stage. Trilby is next seen sprinting from the building, trophy in hand, as an army of enraged parents are in hot pursuit. Clearly he has won the battle, but will he win the war by taking the top spot? Not if current Golden Quill director Dr. Bernice Deagan (Allison Janney) and president Dr. Bowman (Phillip Baker Hall) have any say in the matter. Meanwhile, as the competition gets under way, the arrogant, abrasive Trilby reluctantly begins to forge an unlikely bond with Chaitanya (Rohan Chand), a young Indian-American boy who's quickly emerging as a top contender, no thanks to his neglectful father. Later, the sleuthing Jenny conducts a clandestine background check on Trilby that reveals his true motivations, but threatens to push their increasingly strained relationship to the breaking point.In the opening scenes of Bad Words, Trilby openly admits to making impulsive, irrational decisions based on anger. Given the vitriol that he frequently hurls at women and children, there's never any doubt as to how deep his fury runs, only at whom it's primarily directed. That early confession is a rarity since we learn precious little about Trilby from his own mouth. However repellant he may be on the surface, that mystery makes him fascinating. Of course, whether or not you'll want to spend your quality time with a character who has no qualms about getting a ten-year-old boy liquored up or sending a preadolescent girl running from the stage in tears may depend largely on your ability to put your morals in a box for 89 minutes, but for those with a big enough box and a strong enough lock, Bad Words offers a wealth of deeply offensive, devil-may-care belly laughs that leave a refreshing sting -- the kind that reminds you that not all films are made by a committee or test-marketed to death before they reach the viewer.Working from a fearless screenplay by freshman scribe Andrew Dodge, Bateman makes a commendable directorial debut that reveals just how much he learned during his three decades in television. Though his direction can sometimes feel a bit pedestrian, in the sense that Bad Words occasionally looks more like a television pilot than a richly cinematic feature, he manages to keep the story moving and the laughs flowing. He handles reaction shots in particular with frame-by-frame precision (hardly a surprise given his background as a straight man), and that's only a small component of his perfect understanding of the rhythms of comic timing. Likewise, his playful interpretation of Dodge's farcical characters prevents Bad Words from ever feeling like it's trying too hard. It can be argued that some of the characters (including our antihero and his young pal, the latter played by a rising talent we'll surely be seeing more of) are broadly drawn, but Bad Words is first and foremost a comedy -- not a biting satire of the spelling-bee industry or a deep meditation on the importance of father figures (though those particular themes are present and accounted for). Even when the plot gives way to some guarded sentiment, the film never loses its unrepentant mean streak. Considering Trilby's opening remarks, those who emerge from Bad Words foaming with outrage can't say they were never warned, only that they allowed their morbid curiosity to get the best of them.", "actors": ["Jason Bateman", "Kathryn Hahn", "Rohan Chand", "Philip Baker Hall"], "directors": ["Jason Bateman"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTg0NzQ1NF5BMl5BanBnXkFtZTgwMDQ5OTMwMTE@._V1_SX300.jpg", "keywords": ["adult [vs. child]", "misfit", "spelling-bee"], "release_year": "2013", "moods": ["Comedy on the Edge"], "urls": "karthik", "themes": ["Arrested Adolescence", "Contests, Pageants and Competitions", "Unlikely Friendships"]}
{"key": "theeye-2002", "title": "The Eye", "rating": "6.7", "synopsis": "A corneal transplant sets the stage for terror in this supernatural thriller from directors Danny and Oxide Pang. Blind from the age of two, 20-year-old Mann (Angelica Lee) now has a chance to reclaim her sense of sight thanks to recent breakthroughs in technology. At first elated to have her vision restored, Mann's joy soon turns to paralyzing fear when she begins to see mysterious dark figures which foreshadow sudden, shocking deaths. Subsequently distraught over seeing Ling (Chutcha Rujinanon), the previous owner of the corneas, when she peers into the mirror, Mann's disturbing images slowly begin to chip away at her sanity until she has no choice but to track Ling's past and solve the horrifying mystery that plagues her. Traveling to Ling's former home in a small Northern Thailand village, Mann learns that Ling was driven to suicide after suffering similar visions preceding a tragic fire. When hundreds of the mysterious black figures descend upon Mann just as she is about to leave Thailand, she realizes that a horrific tragedy is set to unfold unless she can summon the courage to take action and use her supernatural gift of sight to alter the future.", "genres": ["Drama", "Horror", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=SOxzXVGaEY8", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/theeye-2002?versionId=WQaBGkofsNvGZslhPR4VVYT6GysFWXLE"}, "review": "Sustaining a palpable sense of dread throughout while providing frequent effective shocks, the latest offering from the Pang brothers successfully balances the more horrific aspects of their supernatural tale with some thoughtful personal touches. Though horror fans will inevitably draw comparisons to such aesthetically similar efforts as The Sixth Sense and The Ring, The Eye stands well enough on its own by offering a stylishly rendered tale of terror and well-drawn, sympathetic characters. As Mun (Angelica Lee) struggles to adjust to a new world of sight and Dr. Wah (Lawrence Chou) attempts to assist her in expanding her visual vocabulary, the audience truly feels how disorienting it might be to suddenly experience the world in an entirely new context. Add in the supernatural visions that she suffers upon regaining her sight and her struggles to maintain her sanity amidst increasingly disturbing encounters, and the viewer gradually grows to experience Mun's plight in a remarkably personalized way. Additionally, the subsequent effect that the death of a minor but pivotal character has on Mun provides a well-drawn transition in her understanding of how her gift may be used. Clearly attracted to Mun, the protective Dr. Wah's ethical dilemma in contrast to his older and more professional uncle renders his conflicted character equally three-dimensional. Though the characters and their plights are effectively portrayed, the fright factor is what ultimately drives this film, and the Pang brothers certainly deliver. As visual stylists, the duo is a formidable force that knows well how film a visually extravagant and horrifyingly grotesque scare. The assured cinematography and striking imagery frequently succeed in creating beautiful depictions of often disturbing events. Perfectly complementing their visual craftsmanship, their equally adept editing skills set the stage for some of the most memorably jarring set pieces in recent horror history. As usual with many successful Asian films of late, The Eye was quickly optioned for an American remake.", "actors": ["Angelica Lee", "Lawrence Chou", "Jinda Duangtoy", "Yut Lai So"], "directors": ["Danny Pang", "Oxide Chun Pang"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjRiNTk5YWYtYTRhZi00ZTg3LTkwOTYtN2RhMjA1NzdjYmYyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg", "keywords": ["woman", "corneal-transplant", "eye", "clairvoyance", "vision [eyesight]", "ghost", "supernatural-powers"], "release_year": "2002", "moods": ["Spellbinders"], "urls": "karthik", "themes": ["Ghosts", "Psychic Abilities", "Renegade Body Parts", "Woman In Jeopardy"]}
{"key": "theywillhavetokillusfirst-2015", "title": "They Will Have to Kill Us First", "rating": "7.6", "synopsis": "Defiant musicians in Mali testify to how their music scene thrives underground, despite the restrictions of Sharia law and threats from Islamic fundamentalists. The film includes performances by Songhoy Blues, Khaira Arby, Fadimata \"Disco\" Walet Oumar, and Moussa Sidi.", "genres": ["Documentary"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=3TX7ybW6nAQ", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/theywillhavetokillusfirst-2015?versionId=27s3yPTDR_dCttk9t7HDt1Rt.sksREJC"}, "review": "", "actors": ["Aliou Touré", "Oumar Touré", "Garba Touré", "Nathanael Dembélé"], "directors": ["Johanna Schwartz"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMjIzNjkzODk4OF5BMl5BanBnXkFtZTgwNzEzODE3NDE@._V1_SX300.jpg", "keywords": ["Africa", "Islam", "music", "underground [counterculture]", "world-music"], "release_year": "2015", "moods": ["Food for Thought", "Triumph of the Spirit"], "urls": "karthik", "themes": ["Fighting the System", "Life Under Occupation", "Musician's Life", "Religious Zealotry"]}
{"key": "mayallahblessfrance!-2014", "title": "May Allah Bless France!", "rating": "5.4", "synopsis": "This autobiographical film details the life of French rapper Abd al Malik (played by Marc Zinga). Aided by his tremendous musical talent, Malik rose out of extreme poverty and undesirable social circles to become a major player in France's music scene.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=2ocM5klJWhA", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/mayallahblessfrance%21-2014?versionId=4GTpZez.43bf7cJmp1kq_kWSBdSj66ee"}, "review": "", "actors": ["Marc Zinga", "Sabrina Ouazani", "Larouci Didi", "Mickaël Nagenraft"], "directors": ["Abd Al Malik"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2ODExODM2N15BMl5BanBnXkFtZTgwMTk2NzcwNjE@._V1_SX300.jpg", "keywords": ["artist", "Black [race]", "French [nationality]", "musician", "overcome", "poverty", "racism", "rap-music"], "release_year": "2014", "moods": ["Only Human"], "urls": "karthik", "themes": ["Big Break", "Inner City Blues", "Mothers and Sons", "Musician's Life", "Rags To Riches", "Street Gangs"]}
{"key": "transpecos-2016", "title": "Transpecos", "rating": "5.8", "synopsis": "Three U.S. Border Patrol agents (Johnny Simmons, Gabriel Luna, and Clifton Collins Jr.) face the ultimate test of their loyalty to each other during a sweltering day on the job in which the inspection of a vehicle returning to the United States goes awry. Now, the trio must defy the law in order to do right by one of their own. Transpecos marks the feature directorial debut of Greg Kwedar.", "genres": ["Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=RMqHXHN1b9s", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/transpecos-2016?versionId=vyFvEagE7e2Lfxa9qysATYHWCajumauM"}, "review": "", "actors": ["Johnny Simmons", "Gabriel Luna", "Clifton Collins Jr.", "David Acord"], "directors": ["Greg Kwedar"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODc0NTI0NDE5OV5BMl5BanBnXkFtZTgwNDQxMjU1OTE@._V1_SX300.jpg", "keywords": ["border-guard", "conflict", "desert", "illegality", "inspection", "loyalty", "secrets"], "release_year": "2016", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Police Corruption", "Task Forces"]}
{"key": "detectivebyomkeshbakshy-2015", "title": "Detective Byomkesh Bakshy", "rating": "7.7", "synopsis": "In 1940s wartime Calcutta, university graduate Byomkesh Bakshy (Sushant Singh Rajput) tries his hand at detective work by uncovering a criminal's fiendish plan. Meanwhile, he falls under the spell of a mysterious woman. An Indian twist on Sherlock Holmes.", "genres": ["Action", "Mystery", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=ZG--GOpi_0g", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/detectivebyomkeshbakshy-2015?versionId=C_D.Szg103.5u3yTYUDN_bt586FXvzq_"}, "review": "", "actors": ["Sushant Singh Rajput", "Anand Tiwari", "Divya Menon", "Swastika Mukherjee"], "directors": ["Dibakar Banerjee"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNzQ0MTAxNl5BMl5BanBnXkFtZTgwMDY2NjM4MzE@._V1_SX300.jpg", "keywords": ["crime-solving", "detective", "private-detective", "war-torn"], "release_year": "2015", "moods": ["Spellbinders"], "urls": "karthik", "themes": ["Hotshots", "Murder Investigations", "Private Eyes", "Star Detectives", "Street Gangs"]}
{"key": "deadend-2014", "title": "Dead End", "rating": "7.1", "synopsis": "While investigating a masked killer who opened fire at a local school, a reporter calls on the paranormal spirits that surround the investigation to uncover the truth in this horror thriller.", "genres": ["Horror", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=WOKRauvfkUU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/deadend-2014?versionId=o1fYMogd7WfpOGILhh90HjwKWDRhXfIb"}, "review": "", "actors": ["Ramez Alkhoury", "Trace Anderson", "Farhad Asghar", "Toshumba Barkus"], "directors": ["Jordan F. Ghanma"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMjM1OTUyODI4N15BMl5BanBnXkFtZTgwNDM5NzM4MTE@._V1_SX300.jpg", "keywords": ["ghost", "investigation", "paranormal", "reporter", "school-shooting"], "release_year": "2014", "moods": ["Blood and Gore"], "urls": "karthik", "themes": ["Amateur Sleuths", "Crime Sprees", "High School Life", "Serial Killers"]}
{"key": "thekingdom-2007", "title": "The Kingdom", "rating": "7.1", "synopsis": "In the aftermath of a deadly attack on American forces in Riyadh, Saudi Arabia, diplomats are slow to act, but meanwhile, FBI special agent Ronald Fleury (Jamie Foxx) assembles a secret team of U.S. counter-terrorism investigators to enter the city and find the criminal behind what has quickly become an international incident. The crew, however, finds their attempt to capture the perpetrators stalled by bureaucracy and their presence unwelcome. Desperate to gain the trust they need to accomplish their mission in just five days, the team enlists the aid of a Saudi Arabian police officer (Ashraf Barhoum), but as the agents infiltrate the dark and complex world of the Saudi crime scene, they find that the perpetrator's next target may be them. Directed by Peter Berg, The Kingdom also stars Jennifer Garner, Chris Cooper, and Jason Bateman.", "genres": ["Action", "Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=6OJArlYJQPg", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thekingdom-2007?versionId=tN1YM0F5IRh.92IPA_Vnyf36kDDEgrXU"}, "review": "The Kingdom may just be the first action movie set against the modern war on Islamic terrorism. Unfortunately, it seems pretty clear that director Peter Berg set out to make an ensemble sociopolitical thriller in the style of Syriana. His movie does start out on that track. Not only does the first act acquaint us with numerous players in various arenas, both foreign and domestic, but unlike Syriana, Berg's film deigns to help the audience sort out who's who, supplying handy title cards as characters get introduced. What's strange is that he doesn't actually need them, because most of these characters immediately drop out of the plot. The Kingdom soon abandons its Washington political wranglings and focuses exclusively on the four agents on the ground in Saudi Arabia. At first the focus on this small group sustains the picture. The investigation, such as it is, gets bogged down by the stark difference in forensic procedures (or lack thereof), the friction over whether the oppressive regime will let them do their jobs, and the treatment of Jennifer Garner's character in a society where women can't show their faces in public. (Adding to the tension, the Americans constantly complain and drop f-bombs.) The Kingdom mostly retains its sense of realism in these sections, a prized attribute indeed for films dealing with the Middle East. It's all the more problematic, then, that the last 30 minutes get sucked up by an improbable and protracted shoot-out. These video-game aesthetics -- where every character has as many bullets and/or combat skills as he or she needs -- have no place in the movie Berg was originally trying to create. They leave The Kingdom feeling like it \"cut and run\" on its instincts toward complexity, and opted for the easier route of explosions and simplistic resolutions.", "actors": ["Jamie Foxx", "Chris Cooper", "Jennifer Garner", "Jason Bateman"], "directors": ["Peter Berg"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDIzOTYwMV5BMl5BanBnXkFtZTcwMTM5OTA1MQ@@._V1_SX300.jpg", "keywords": ["agent [representative]", "bureaucracy", "counterterrorism", "FBI (Federal Bureau of Investigation)", "investigation", "police-officer", "Saudi-Arabia", "terrorist-attack"], "release_year": "2007", "moods": ["Food for Thought"], "urls": "karthik", "themes": ["Behind Enemy Lines", "Hostage Situations", "Race Against Time", "Task Forces", "Terrorism"]}
{"key": "dersamurai-2014", "title": "Der Samurai", "rating": "5.7", "synopsis": "A young policeman (Michel Diercks) in a small German village becomes involved in a peculiar murder investigation when a stranger emerges from the woods, cloaked by a feminine dress, and begins to slaughter the villagers in this energetic take on the classic werewolf story.", "genres": ["Fantasy", "Horror", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=pIc530LsSxM", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/dersamurai-2014?versionId=kUcdfnoWs0rebU3K1UNrBmT8E4cpz39O"}, "review": "", "actors": ["Michel Diercks", "Pit Bukowski", "Uwe Preuss", "Ulrike Hanke-Haensch"], "directors": ["Till Kleinert"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODU0Njg4Nl5BMl5BanBnXkFtZTgwNzY5MzMzNjE@._V1_SX300.jpg", "keywords": ["German [nationality]", "homosexual", "murder", "Samurai", "townspeople", "transvestite", "werewolf"], "release_year": "2014", "moods": ["Blood and Gore"], "urls": "karthik", "themes": ["Crisis of Conscience", "Metamorphosis", "Ninjas", "Questioning Sexuality", "Self-Destructive Romance", "Werewolves"]}
{"key": "high-rise-2015", "title": "High-Rise", "rating": "5.7", "synopsis": "Well-to-do doctor Robert Laing (Tom Hiddleston) moves into the 25th floor of an experimental high-rise apartment complex on the outskirts of London in 1975, attracted by the upper-class lifestyle promoted by its architect (Jeremy Irons). The building is secluded from the outside world and functions as its own autonomous community; in addition, it's organized by a rigid caste system, with the least wealthy residents situated on the lower floors. Laing befriends a documentary filmmaker (Luke Evans) who lives on the second floor, and soon becomes aware of the social inequities within the complex. As tensions between the tenants boil over, an all-out war erupts that divides the classes into violent tribes vying for the top floors. Ben Wheatley directed this wildly imaginative and chaotic adaptation of J.G. Ballard's 1975 novel, with Amy Jump serving as screenwriter. High-Rise premiered at the 2015 Toronto International Film Festival.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=LKPghZ5cc_E", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/high-rise-2015?versionId=0q6nOshGgknZOuJeYCuxPDjHZjRYw6un"}, "review": "", "actors": ["Tom Hiddleston", "Jeremy Irons", "Sienna Miller", "Luke Evans"], "directors": ["Ben Wheatley"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MjM4NzMwMl5BMl5BanBnXkFtZTgwMTQ4MjUzODE@._V1_SX300.jpg", "keywords": ["architect", "caste-system", "skyscraper", "tribe", "uprising"], "release_year": "2015", "moods": ["Head Trips"], "urls": "karthik", "themes": ["Class Differences", "Feuds", "Social Injustice", "Technology Run Amok"]}
{"key": "kickin'itoldskool-2007", "title": "Kickin' It Old Skool", "rating": "4.6", "synopsis": "Rendered comatose for 20 years after a freak breakdancing accident, former child dancer Justin Schumacher (Jamie Kennedy) awakens from his extended repose with no motor skills and the mental capacity of a 12-year-old. So much has changed since Justin lapsed into a coma; not only have people stopped wearing parachute pants, the Internet has connected people in a manner that no child of the 1980s could have ever imagined. Dancing, however, is the one constant that remains as popular as ever. Upon discovering that his mountainous medical bills have drained mom and dad's bank account and the love of his life (Maria Menounos) is engaged to his lifelong nemesis (Michael Rosenbaum), the breakdancing Rip Van Winkle attempts to reassemble his former dance troupe in hopes of winning back the girl and saving his parents' failing yogurt shop.", "genres": ["Comedy"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=ZPNnyR8fPDE", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/kickin%27itoldskool-2007?versionId=RhNCfV81NENWu9a57QesIF9mhgjd25pF"}, "review": "", "actors": ["Jamie Kennedy", "Maria Menounos", "Miguel A. Núñez Jr.", "Michael Rosenbaum"], "directors": ["Harvey Glazer"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzU4OTAxM15BMl5BanBnXkFtZTcwODY0OTQ0MQ@@._V1_SX300.jpg", "keywords": ["coma", "dance-troupe", "mental-retardation", "breakdancing"], "release_year": "2007", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Time Sleepers", "Otherwise Engaged", "Love Triangles"]}
{"key": "treasurebuddies-2012", "title": "Treasure Buddies", "rating": "4.6", "synopsis": "Everyone's favorite canine film series continues with this installment following five chatty pups as they venture to Egypt in search of a mythical jewel that was once the treasure of Cleocatra's collection. Upon learning that the famed Cat's Eye jewel is hidden somewhere in Egypt, Rosebud, Budderball, B-Dawg, Mudbud, and Buddha set out on the adventure of a lifetime. But they're not the only ones racing to procure the Cat's Eye, because a treacherous feline named Ubasti seeks to harness the gemstone's power to gain the ultimate advantage in the eternal war between cats and dogs. Perhaps with a little help from a friendly camel named Cammy and an artful orangutan named Babi, our four-legged heroes can track down the Cat's Eye first, and prevent a true catastrophe from disturbing the balance in the animal kingdom.", "genres": ["Comedy", "Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=dJ-4LrurxoE", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/treasurebuddies-2012?versionId=sAt.Q8e.scjsQhXBaE3_fLgGfbXyi.Jm"}, "review": "", "actors": ["Tucker Albrizzi", "Adam Alexi-Malle", "Tim Conway", "Mason Cook"], "directors": ["Robert Vince"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTc0NTI2OF5BMl5BanBnXkFtZTcwMjU2MzIzNw@@._V1_SX300.jpg", "keywords": ["jewel", "puppy", "quest", "treasure-hunt"], "release_year": "2012", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Man's Best Friend", "Talking Animals", "Treasure Hunts"]}
{"key": "thedaviddance-2014", "title": "The David Dance", "rating": "7.8", "synopsis": "A Buffalo resident named David (Don Scime) adopts a confident persona as the host of a gay-themed radio show, but remains lost and insecure in his real life. However, he must face his failures and become a better man when his sister (Antoinette LaVecchia) asks him to act as a father figure to a Brazilian orphan she's adopting. Directed by Aprill Winney, The David Dance is based on Scime's play of the same name.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=R5SZz20YoSk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thedaviddance-2014?versionId=ZHMSHmwYkp7b5.hd.qdbyWZrGnafH7e2"}, "review": "", "actors": ["Don Scime", "Guy Adkins", "Antoinette LaVecchia", "Jordan Baker"], "directors": ["Aprill Winney"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTQ1MTgwOTc0NV5BMl5BanBnXkFtZTcwNTE1Nzc5OQ@@._V1_SX300.jpg", "keywords": ["Brazilian  [nationality]", "father-figure", "insecurity", "orphan", "radio-broadcaster", "radio-personality", "radio-shop", "sister"], "release_year": "2014", "moods": ["A Good Cry", "Only Human"], "urls": "karthik", "themes": ["Adoption", "Non-Traditional Families"]}
{"key": "i.t.-2016", "title": "I.T.", "rating": "5.4", "synopsis": "Successful businessman Mike Ryan (Pierce Brosnan) enlists the help of Ed Porter (James Frecheville), his company's I.T. consultant, to improve his home's security. However, Porter begins manipulating the technology in his client's smart home after taking an inappropriate interest in Ryan's young daughter (Stefanie Scott), setting up a high-stakes battle of wits. Anna Friel co-stars in this techno-thriller directed by John Moore.", "genres": ["Crime", "Drama", "Mystery"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=hfnDTvbtDUI", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/i.t.-2016?versionId=K.v_BN6pa2bp0.VYDMvJRqmi0jb9XzN2"}, "review": "", "actors": ["Pierce Brosnan", "Jason Barry", "Karen Moskow", "Kai Ryssdal"], "directors": ["John Moore"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzY3MzYzNF5BMl5BanBnXkFtZTgwNzgzMTA3OTE@._V1_SX300.jpg", "keywords": ["businessperson", "daughter", "hacker", "security-expert", "threat"], "release_year": "2016", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Computer Paranoia", "Fathers and Daughters", "Stalkers"]}
{"key": "stuck!-2009", "title": "Stuck!", "rating": "3.5", "synopsis": "An innocent young woman is wrongfully accused of murdering her mother and sentenced to death in Firecracker director Steve Balderson's campy homage to the women in prison genre. Enslaved by her sadistic female warden and left to the mercy of her hardened fellow inmates, frightened innocent Daisy (Starina Johnson) struggles to maintain her integrity as her life becomes a living hell behind bars. Karen Black, Mink Stole, Jane Weidlin, Stacy Cunningham, and Pleasant Gehman star.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=cqFiLXN4nIc", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/stuck%21-2009?versionId=XEHNXhF0NQGai._XyvJeY_OH6XKFgpDF"}, "review": "", "actors": ["Karen Black", "Jane Wiedlin", "Mink Stole", "Susan Traylor"], "directors": ["Steve Balderson"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTU2MTk1NTkxMl5BMl5BanBnXkFtZTcwMTAyOTU5Mg@@._V1_SX300.jpg", "keywords": ["false-accusation", "false-conviction", "inmate", "prison", "sadist", "warden"], "release_year": "2009", "moods": ["Trashy"], "urls": "karthik", "themes": ["Women in Prison"]}
{"key": "camino-2015", "title": "Camino", "rating": "4.9", "synopsis": "A photojournalist (Zoe Bell) embeds herself with a group of missionaries in 1985 Colombia, but when she witnesses the group's leader (Nacho Vigalondo) commit a horrific murder, she is forced to go on the run with the evidence of his crime. Directed by Josh C. Waller.", "genres": ["Action", "Adventure", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=c8pKvWllm24", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/camino-2015?versionId=l_zFENohs4PVKjjzdrkY5DPKvNKqQ1Da"}, "review": "", "actors": ["Zoë Bell", "Nacho Vigalondo", "Francisco Barreiro", "Sheila Vand"], "directors": ["Josh C. Waller"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxOTIyNTgyNF5BMl5BanBnXkFtZTgwODM1NjQwNzE@._V1_SX300.jpg", "keywords": ["Colombia", "missionary", "murder", "photojournalist", "revolutionary"], "release_year": "2015", "moods": ["Nail-biters"], "urls": "karthik", "themes": ["Life Under Occupation", "Political Unrest", "Whistleblowers"]}
{"key": "saturdaymorningmystery-2012", "title": "Saturday Morning Mystery", "rating": "4.4", "synopsis": "Four young ghost hunters and their lovable mutt explore a derelict schoolhouse with a dark history.", "genres": ["Comedy", "Horror"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=oM3wOd-Rc2c", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/saturdaymorningmystery-2012?versionId=HVPFTk_S2HmxDFw_12rZDWvZ4hOcUiHF"}, "review": "", "actors": ["Jonny Mars", "Josephine Decker", "Adam Tate", "Ashley Spillers"], "directors": ["Spencer Parsons"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTM4OTQ1MDMwOF5BMl5BanBnXkFtZTcwMDgwMjg2OQ@@._V1_SX300.jpg", "keywords": ["dog", "ghost", "ghostbuster", "haunted", "schoolhouse", "supernatural-forces"], "release_year": "2012", "moods": ["Just for Fun"], "urls": "karthik", "themes": ["Amateur Sleuths", "Ghosts"]}
{"key": "don'tthinktwice-2016", "title": "Don't Think Twice", "rating": "7.6", "synopsis": "Mike Birbiglia (Sleepwalk With Me) wrote, directed, and stars in this bittersweet look at trying to make it in showbiz. He plays a member of a six-person improv-comedy troupe called the Commune, all of whom are still clinging to their dreams of stardom well into their thirties. When one of them actually lands a role on a hugely popular sketch-comedy TV show, the remaining members are forced to reflect on their failures and whether it's time to get a \"real\" life. Keegan-Michael Key, Gillian Jacobs, Kate Micucci, Tami Sagher, and Chris Gethard co-star. Don't Think Twice made its world premiere at the 2016 South by Southwest Film Festival.", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=9RFTpObS95U", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/don%27tthinktwice-2016?versionId=5KMUvwiyXL0bDPv0YjWRu1S4PMQqbukS"}, "review": "", "actors": ["Mike Birbiglia", "Gillian Jacobs", "Kate Micucci", "Tami Sagher"], "directors": ["Mike Birbiglia"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTkwODM2MF5BMl5BanBnXkFtZTgwNjYwNjY5ODE@._V1_SX300.jpg", "keywords": ["actor", "comedy", "improvisation", "show", "show-business", "stardom", "troupe"], "release_year": "2016", "moods": ["Food for Thought"], "urls": "karthik", "themes": ["Actor's Life", "Big Break"]}
{"key": "ismileback-2015", "title": "I Smile Back", "rating": "6.1", "synopsis": "Laney Brooks (Sarah Silverman) is a New Jersey housewife with a picturesque life, a loving and successful husband Bruce (Josh Charles) with whom they have two children. Despite the appearance of happiness, Laney has suffered from depression all her life, stemming from the father that abandoned her and her family at a young age. Laney copes with her affliction through a reckless indulgence in sex, drugs and alcohol. As her addictions worsen, they threaten to tear apart the family at its seams. Adam Salky directed this unflinching drama.", "genres": ["Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=YIBqq-AQcE0", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/ismileback-2015?versionId=Da9AsAUXNIoa5.Q3nG59xnxrty2sIOTb"}, "review": "Laney Brooks (Sarah Silverman) lives two lives. On the outside, she's a devoted wife to her insurance salesman/author husband Bruce (Josh Charles) and a loving mother to her two children (Shayne Coleman and Skylar Gaertner). She's earnestly protective and adoring of her children and supportive of her husband's career, which has afforded the family to live comfortably in suburban New Jersey. On the inside, Laney is on the brink of collapse -- her internal struggle with depression and addiction is boiling over and threatening to derail her entire family.Laney recklessly indulges in drugs, alcohol and extramarital affairs in an attempt to cope with her affliction, but the dangerous cycle only further buries her under the weight of her sorrow. She is consumed with the fear that she'll pass her depression on to her children and goes to great lengths to protect them from any thorny situations. This overprotection stems in part from her own tumultuous upbringing, in which her father left her as a pre-teen and then never reconnected later in life. Laney's inability to balance desire and obligation eventually forces the hand of Bruce, who takes her to a rehab facility to get clean. She emerges from rehab focused on being a parent and a wife but her demons once again beckon in a gripping final act.Under the steady direction of Adam Salky, I Smile Back is a fearless study of a parent in the throes of addiction and depression. The script, co-written by Amy Koppelman and Paige Dylan, was adapted from Koppelman's 2008 novel of the same name. Silverman takes a tremendous leap of faith outside of her comfort zone and gives a nuanced and emotionally draining performance as the existentially conflicted Laney. It's an incredibly demanding role for any actress, and Silverman breathes a veracity and authenticity into the well-trotted \"dysfunctional suburban housewife\" trope. I Smile Back is careful not to make Laney a one-dimensional character with \"daddy issues\" -- while her fractured relationship with her father no doubt has a role in her psyche, Laney's maladies are not easily diagnosable by pointing out one or two sources. Laney's bipolar propensities play out evocatively before our eyes; the tender moments she shares with her children are juxtaposed with hurried lines of cocaine and her destructive sexual escapism. Anyone who has dealt with depression or addiction either personally or secondhand will see the sincerity and heartbreak of Laney.The ones who make you laugh the loudest tend to be the most tortured, reserved ones in the room. As a comedienne, Silverman has spoken openly about her own battles with depression as devices in her stand-up. So much of modern comedy is built on a keen self-awareness and a seemingly never-ending barrage of self-deprecation. In her first truly dramatic leading role, Silverman is able to channel that complexity into a vulnerable and courageous turn as Laney. I Smile Back is a gritty and demanding drama with an ending that, albeit potentially divisive, will stick in your gut long after the credits roll.", "actors": ["Josh Charles", "Skylar Gaertner", "Shayne Coleman", "Sarah Silverman"], "directors": ["Adam Salky"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NDQ3MzgxOF5BMl5BanBnXkFtZTgwMDAzMjExNzE@._V1_SX300.jpg", "keywords": ["addiction", "alienation", "anxiety", "depression", "mother", "rehabilitation [detox]"], "release_year": "2015", "moods": ["Uncomfortable Viewing"], "urls": "karthik", "themes": ["Alcoholism", "Crumbling Marriages", "Drug Addiction", "Parenthood", "Suburban Dysfunction"]}
{"key": "wardogs-2016", "title": "War Dogs", "rating": "7.2", "synopsis": "In this comedy-drama based on true events, a down-on-his-luck massage therapist living in Miami (Miles Teller) teams up with a mercurial former classmate (Jonah Hill) to try to make it in the arms-dealing business. After starting small, the pals eventually get in over their heads when they land a 300-million-dollar contract with the U.S. government to supply weaponry for forces in Afghanistan. Directed by Todd Phillips.", "genres": ["Comedy", "Crime", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=Rwh9c_E3dJk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/wardogs-2016?versionId=8S89Jz6tI8MKVDduPvNlFldwaFnsWODZ"}, "review": "After directing a run of hugely successful raunchy comedies (including Old School and the Hangover series), Todd Phillips now takes on the story of two real-life bros who attempted to make a fortune by cheating the system. Based on a Rolling Stone article by Guy Lawson, War Dogs centers on two greenhorn arms dealers who sell weaponry and equipment to the U.S. military, and who eventually hit the jackpot when they land a 300-million-dollar contract with the government. The film is told from the perspective of David Packouz (Miles Teller), a frustrated, down-on-his-luck massage therapist who unexpectedly reconnects with a volatile former friend named Efraim Diveroli (a scenery-chomping turn from Jonah Hill). With a baby on the way and in desperate need of cash, Packouz teams with his old pal to exploit new legislation that requires America's armed forces to accept bids from smaller, independent contractors. Their quest for bigger money leads the two men to do business with a highly successful, yet dangerously shady, weapons kingpin (Bradley Cooper, making the most of his too-brief screen time).Anyone who's ever seen a movie about career criminals knows that the suspense revolves around when, not if, the hammer will finally drop. Phillips (who also co-wrote the script with Stephen Chin and Jason Smilovic) never lets us forget that sense of urgency, while simultaneously squeezing as much exhilaration as possible out of the pair's wild ride. The plot is quick but not rushed, and a lot of that has to do with the \"show, don't tell\" manner in which it is presented. Although the dialogue mentions several times that Packouz and Diveroli are fans of Scarface, War Dogs feels closer in spirit to some of Martin Scorsese's films; that similarity is evident in the voice-overs from Packouz, a prototypical desperate character who is slowly seduced to the dark side, as well as the freeze-frames that occasionally accompany his narration. The movie particularly owes a debt to Scorsese's 2013 The Wolf of Wall Street, which also features a group of gleefully rebellious, morally depraved protagonists.And just as in The Wolf of Wall Street, Hill skillfully mines dark humor from an immature and reckless loose cannon. The movie does itself no favors by revealing the full extent of Diveroli's sociopathic nature early on, a narrative choice that renders the character's actions during the climax less of a surprise. However, Hill still manages to carry the film by committing to the role's goofy idiosyncrasies, turning comedic quirks into signs of a disaffected, toxic personality. Teller is capable of terrific performances (as seen in his turn opposite J.K. Simmons in Whiplash), but he seems to be holding back here when sharing the screen with Hill, and his scenes at home with his wife (Ana de Armas) and child don't have the emotional heft they should.War Dogs also possesses a soundtrack full of baby-boomer rock favorites, another Scorsese trademark (especially in Goodfellas and The Departed). Unfortunately, these music picks are too on-the-nose to really work, and it's disappointing that they crowd out composer Cliff Martinez's score. Still, the film ultimately succeeds because it deftly blends together the outrageousness of a wild comedy with the tension of a gangster flick, creating something that will likely appeal to fans of both Casino and Superbad. Many movies try to be brash and outlandish, but few achieve that aim with the sharpness and authenticity of War Dogs. Audiences know by now that there's a lot more to Hill's talents than just sophomoric laughs, and director Todd Phillips makes a similar case for expanding his own range here.", "actors": ["Miles Teller", "Steve Lantz", "Gregg Weiner", "David Packouz"], "directors": ["Todd Phillips"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzQ0NzM4MV5BMl5BanBnXkFtZTgwMDI0ODM2OTE@._V1_SX300.jpg", "keywords": ["business", "capitalism", "career", "contract", "forces [military]", "government", "weapons-dealer"], "release_year": "2016", "moods": ["Comedy on the Edge"], "urls": "karthik", "themes": ["Big Break", "Schemes and Ruses"]}
{"key": "chronicle-2012", "title": "Chronicle", "rating": "7.1", "synopsis": "A loner (Dane DeHaan) escapes his abusive home life and discovers a mysterious crater that gives him and two fellow high school students psychokinetic powers in this found-footage-style superhero film from director Josh Trank and screenwriter Max Landis. DeHaan plays Andrew, a angsty teen whose mother is dying and whose father takes out his violent frustrations out on the boy. As a result, Andrew starts filming everything around him, including the dreadful night that he, his cousin Matt (Alex Russell) and the soon-to-be senior class president, Steve (Michael B. Jordan), wake up with superpowers after exploring a condemned piece of land housing an unexplained power source. The three bond over their newfound abilities, with Andrew clearly leading the pack in terms of control and strength. Despite their noble intentions, a darker streak appears in one of them as the other two try to take control over a situation that soon spirals into homicidal madness -- all of which is captured on camera.", "genres": ["Sci-Fi", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=i-M5Qx57_UU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/chronicle-2012?versionId=huW3JnPjzwEY9EBPf8tX3QjUSmPJecQG"}, "review": "Villains rarely get the lead-character treatment in Hollywood, and that alone makes Chronicle worthy viewing if one is craving a unique found-footage film. Imagine an X-Men movie in which the narrative follows the loner kid who gets superpowers, becomes popular, then spirals into madness once his crummy domestic life becomes too much. It's a fascinating -- and bold -- premise that screenwriter Max Landis and director Josh Trank have concocted for what is otherwise a straightforward Hollywood release.Though Andrew Detmer (Dane DeHaan) at first seems insufferably emo (his initial bummed-out line readings are pretty terrible), this is one character arc that's a welcome change of pace compared to the cinematic superhero tropes audiences have come to expect. The picture opens as Detmer starts videotaping his life, which is filled with verbal and physical abuse from both his father and bullies at school, along with a tragic home life that revolves around his terminally ill mother. Things turn around one night when he and two fellow students are given telekinetic powers after discovering a mysterious crater outside a rave. Soon, the three develop their gifts and go through the highs and lows of this newfound responsibility, with Andrew becoming a darker force each day as his inhuman powers grow stronger.On the technical end, the movie finds a number of satisfying ways to capture the action on camera -- which is quite the revelation when dealing with the found-footage artistic style. And while the picture may push the boundaries of this shooting aesthetic a bit too far in the end, forgiving viewers will be happy with the fantastic eye candy that's being delivered. Ironically enough, though the picture excels at breathing new life into the world of handheld fiction on the big screen, its stringent use of personal cameras could be considered a hindrance. While there are legitimate reasons why the main character would turn psychotic, there's never a clear reason as to why he is always filming himself -- even though the dialogue is filled with endless references to cameras, which in and of itself becomes bothersome. Still, Chronicle is quite an achievement, and it's a film that genre enthusiasts should not miss.", "actors": ["Dane DeHaan", "Alex Russell", "Michael B. Jordan", "Michael Kelly"], "directors": ["Josh Trank"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjYzMDQ0MV5BMl5BanBnXkFtZTcwNzE1OTM5Ng@@._V1_SX300.jpg", "keywords": ["control", "discovery", "super-power", "teenagers"], "release_year": "2012", "moods": ["Fantastic Reality"], "urls": "karthik", "themes": ["Crisis of Conscience", "Miraculous Events", "Psychic Abilities"]}
{"key": "rulesofengagement-2000", "title": "Rules of Engagement", "rating": "6.4", "synopsis": "In this drama, two U.S. Marines who stood side by side on the field of battle are reunited in a court of law. Attorney Hayes Hodges (Tommy Lee Jones) once aspired to a career as an officer, but a serious injury in Vietnam put an end to his military future, leaving him bitter and resentful. Col. Terry L. Childers (Samuel L. Jackson) fought alongside Hodges and once saved his life; when Childers is threatened with a court martial for ordering his troops to fire on civilians during a raid on an American embassy, Hodges is the only lawyer that he can trust, and the case gives Hodges a chance for revenge against the military system that he feels has wronged him. Rules of Engagement also features Kim Delaney, Ben Kingsley, Blair Underwood, and Anne Archer.", "genres": ["Drama", "Thriller", "War"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=4ACfE_R-SfA", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/rulesofengagement-2000?versionId=8DeZcI_.NqpgtBuDhaVxQ2HSyam9TASq"}, "review": "William Friedkin falls just short of success with this derivative military courtroom drama, the director's umpteenth attempt at a career comeback. Rules of Engagement begins with a one-two punch, comparing America's late 20th century political entanglements in the Middle East to the quagmire of Vietnam. Friedkin stages these early battle scenes with authentic suspense, tension, and conflict. Unfortunately, the film quickly devolves into a hybrid rip-off of A Few Good Men (1992) and Clear and Present Danger (1994), as a self-doubting lawyer confronts his demons in the courtroom while attempting to unravel a high-level political conspiracy. After posing complicated, probing questions about subjects of global significance, Rules of Engagement disappointingly falls to pieces by embracing formula, wrapping up its morally complex tale with a series of pat, too-easy answers.", "actors": ["Tommy Lee Jones", "Samuel L. Jackson", "Guy Pearce", "Ben Kingsley"], "directors": ["William Friedkin"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjZmNWI1MTgtZjVjNi00M2FjLWI4YjUtNzkwNmYyMzM4NjMwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SX300.jpg", "keywords": ["courtmartial", "embassy", "injury", "lawyer", "Marines", "military", "revenge", "veteran [military]"], "release_year": "2000", "moods": ["Spellbinders"], "urls": "karthik", "themes": ["Courts Martial", "Faltering Friendships", "Military Life", "Political Corruption"]}
{"key": "slingshot-2014", "title": "SlingShot", "rating": "7.7", "synopsis": "A documentary profiling Segway inventor Dean Kamen and his quest to deliver safe water to the world's population by developing SlingShot, a vapor compression device that produces clean water. Kamen, who is also known for inventing a variety useful of medical devices utilizes a non-linear approach to his creative process. Because many third world countries do not have access to safe water the pathogens in the water supply can cause widespread illness. Kamen has tackled this problem and developed a system that can turn poisoned well water and river sludge into safe drinking water. Directed by Paul Lazarus.", "genres": ["Documentary", "Biography", "News"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=4FlM9EEQfvU", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/slingshot-2014?versionId=1a52SE35RLakm2YP1.94gOovqAHVSPX4"}, "review": "", "actors": ["Dean Kamen"], "directors": ["Paul Lazarus"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTQxMTQwNTE3MV5BMl5BanBnXkFtZTgwMjU0MDU1NjE@._V1_SX300.jpg", "keywords": ["Africa", "crisis", "inventor", "passion", "problem-solving", "safe", "technology", "Third-World", "water"], "release_year": "2014", "moods": ["Food for Thought", "Triumph of the Spirit"], "urls": "karthik", "themes": ["Heroic Mission", "Inventors", "Plagues and Epidemics", "Protecting the Innocent", "Reluctant Hero", "Wishes Come True"]}
{"key": "kingsglaive:finalfantasyxv-2016", "title": "Kingsglaive: Final Fantasy XV", "rating": "7.0", "synopsis": "In order to protect his people from an invading army, King Regis (voice of Sean Bean) summons the mighty soldiers of the Kingsglaive. The two forces then do battle for control of a powerful crystal. Takeshi Nozue directed this animated action fantasy, which serves as a tie-in movie to the video game Final Fantasy XV and tells a story that runs parallel to the game's plot. Aaron Paul and Lena Headey also provide their voices.", "genres": ["Animation", "Action", "Adventure"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=htnkOpknGok", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/kingsglaive%3Afinalfantasyxv-2016?versionId=8whS3wgFTHkFhBTpHlPihH_70rOiijzF"}, "review": "", "actors": ["Aaron Paul", "Sean Bean", "Lena Headey", "David Gant"], "directors": ["Takeshi Nozue"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNzMxNTU5M15BMl5BanBnXkFtZTgwMzMyMjg3OTE@._V1_SX300.jpg", "keywords": ["army", "attack", "empire", "forces [military]", "kingdom", "power", "soldier", "threat"], "release_year": "2016", "moods": ["For Love of Country"], "urls": "karthik", "themes": ["Bodyguards"]}
{"key": "dependent'sday-2016", "title": "Dependent's Day", "rating": "7.3", "synopsis": "A wannabe actor (Joe Burke) tries to get his life together and patch things up with his girlfriend (Benita Robledo), who is supporting him financially as he pursues his dreams of stardom. Written and directed by Michael David Lynch.", "genres": ["Comedy", "Drama", "Romance"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=MCRqlPSyD2g", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/dependent%27sday-2016?versionId=Zhn7yAG7Nxp.jh1Lf_HRgVm09k0w9ok3"}, "review": "", "actors": ["Joe Burke", "Benita Robledo", "Shannon Lucio", "Josh Staman"], "directors": ["Michael David Lynch"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODg4Nzc5MV5BMl5BanBnXkFtZTgwMDg2NDg1NzE@._V1_SX300.jpg", "keywords": ["actor", "dependence", "dreams", "girlfriend", "stardom"], "release_year": "2016", "moods": ["Comedy on the Edge", "In the Mood for Love"], "urls": "karthik", "themes": ["Actor's Life", "Life in the Arts", "Opposites Attract", "Twentysomething Life"]}
{"key": "crd-2016", "title": "CRD", "rating": "N/A", "synopsis": "A college student and budding playwright clashes with his ruthlessly strict teacher, and eventually decides to put together his own ragtag troupe in the hope of winning a competition at a theatre festival. Mrinmayee Godbole, Vinay Sharma, Saurabh Saraswat, Abhay Mahajan, and Isha Keskar star. Directed by Kranti Kanade.", "genres": ["Comedy", "Drama", "Romance"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=roN3Y_OjRSc", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/crd-2016?versionId=VSWKNf3LuXDV9WerDdfdzhr61xb.SJ1c"}, "review": "", "actors": ["Abhay Mahajan", "Mrinmayee Godbole", "Vinay Sharma", "Saurabh Saraswat"], "directors": ["Kranti Kanade"], "picture_url": "N/A", "keywords": ["college", "competition", "subversive", "teacher", "theater", "troupe"], "release_year": "2016", "moods": ["Only Human", "Uncomfortable Viewing"], "urls": "karthik", "themes": ["Actor's Life", "Betrayal", "Contests, Pageants and Competitions", "Life in the Arts", "Romantic Betrayal", "Writer's Life"]}
{"key": "liars,firesandbears-2012", "title": "Liars, Fires and Bears", "rating": "6.8", "synopsis": "A hardened 9-year-old foster child Eve (Megli Micek) teams up with a bumbling 30-year-old Dave (Lundon Boyd) for a cross country road trip.", "genres": ["Comedy", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=wmhyZvEafs8", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/liars%2Cfiresandbears-2012?versionId=XsVmmU3cUENXpi80.OZRYraoxR9xURtO"}, "review": "", "actors": ["Megli Micek", "Lundon Boyd", "Luke Jones", "Melody Melendez"], "directors": ["Jeremy Cloe"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNDM5MzA1Ml5BMl5BanBnXkFtZTcwNjgyNDE4Nw@@._V1_SX300.jpg", "keywords": ["cross-country", "drunk", "foster-home", "precociousness", "road-trip"], "release_year": "2012", "moods": ["Off the Beaten Path", "Only Human", "Triumph of the Spirit"], "urls": "karthik", "themes": ["Alcoholism", "Dysfunctional Families", "Finding a Way Back Home", "On the Run", "Orphans", "Redemption"]}
{"key": "infernal-2015", "title": "Infernal", "rating": "3.3", "synopsis": "A young couple is thrilled to be expecting their first child, a daughter. But when she begins to display abnormal behavior they worry she may have a psychological problem. Their worry quickly turns to terror when supernatural events coincide with her strange conduct. Starring, Andy Ostroff, Heather Adair and Alyssa Koerner.", "genres": ["Horror"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=cgaxiGGfk0s", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/infernal-2015?versionId=emqJyDmVeJrU_9GiftcWugIhrcX4VOFQ"}, "review": "", "actors": ["Andy Ostroff", "Heather Adair", "Alyssa Koerner", "Jose Rosete"], "directors": ["Bryan Coyne"], "picture_url": "N/A", "keywords": ["child", "couple", "daughter", "supernatural", "terror"], "release_year": "2015", "moods": ["Nail-biters", "Spellbinders"], "urls": "karthik", "themes": ["Demonic Possession", "Evil Children"]}
{"key": "cutsnake-2014", "title": "Cut Snake", "rating": "5.7", "synopsis": "In this intense crime thriller set in mid-'70s Melbourne, an ex-con's (Alex Russell) attempts to go straight and start a new life with his fiancée (Jessica De Gouw) are endangered when his old cellmate (Sullivan Stapleton) tracks him down and asks for his help with a serious crime. Directed by Tony Ayres. The film was screened in the Contemporary World Cinema division at the 2014 Toronto International Film Festival.", "genres": ["Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=STHHZWXp-Vw", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/cutsnake-2014?versionId=D3GPJJZNp5zq_BQQ7l2orw4SeqxT.VKG"}, "review": "", "actors": ["Sullivan Stapleton", "Alex Russell", "Jessica De Gouw", "Megan Holloway"], "directors": ["Tony Ayres"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzI5Nzk3MF5BMl5BanBnXkFtZTgwMzA2Mjk4NjE@._V1_SX300.jpg", "keywords": ["cellmate", "crime", "ex-convict", "fiancee", "reform [improve]"], "release_year": "2014", "moods": ["Nail-biters", "Tough Guys"], "urls": "karthik", "themes": ["Dangerous Friends", "One Last Heist"]}
{"key": "tumbledown-2015", "title": "Tumbledown", "rating": "6.2", "synopsis": "The grieving widow (Rebecca Hall) of a singer-songwriter clashes with an acerbic journalist (Jason Sudeikis) who arrives in her small Maine town announcing he's writing a biography about her late husband and his mysterious death. What begins as a clash of wills evolves into something more profound, as the journalist's presence helps her make peace with her husband's passing. Directed by Sean Mewshaw.", "genres": ["Comedy", "Music", "Romance"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=haVs8nSq6ZY", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/tumbledown-2015?versionId=.ZlsD.NQVKedupN3zjG.6iQKZ9jSvo4O"}, "review": "", "actors": ["Rebecca Hall", "Dianna Agron", "Joe Manganiello", "Jason Sudeikis"], "directors": ["Sean Mewshaw"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzkwOTQ1M15BMl5BanBnXkFtZTgwMjcxMzg2NzE@._V1_SX300.jpg", "keywords": ["disappearance", "journalist", "memoir", "rurality", "singer/songwriter", "widow/widower", "writing"], "release_year": "2015", "moods": ["A Good Cry", "Pick-Me-Ups", "Unloveables"], "urls": "karthik", "themes": ["Death of a Partner", "Musician's Life", "Opposites Attract", "Starting Over", "Writer's Life"]}
{"key": "iamnumberfour-2011", "title": "I Am Number Four", "rating": "6.1", "synopsis": "A teenage fugitive with an incredible secret races to stay one step ahead of the mysterious forces seeking to track and destroy him in this sci-fi action thriller from director D.J. Caruso (Disturbia, Eagle Eye). With three dead and one on the run, the race to find the elusive Number Four begins. Outwardly normal teen John Smith (Alex Pettyfer) never gets too comfortable in the same identity, and along with his guardian, Henri (Timothy Olyphant), he is constantly moving from town to town -- the perpetual new kid in a series of strangely familiar schools. Despite the fact that his nomadic lifestyle has made it difficult to form meaningful connections, John experiences the joy of first love with a beautiful young woman (Dianna Agron) and begins to unlock his full potential after arriving with Henri in a small Ohio town. With each passing day, John gains a stronger grasp on his extraordinary new powers, and his bond to the beings that share his fantastic fate grows stronger.", "genres": ["Action", "Adventure", "Sci-Fi"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=g5djHG3hPu0", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/iamnumberfour-2011?versionId=yK_k.O3kUKQpuK47uHSgOt3YePuiVuJG"}, "review": "If you're going to make a movie that's frankly ridiculous, the worst thing you can do is be timid about it. A lot of sci-fi and fantasy films are built on \"Aw, come on now\"-worthy premises, but if you charge forward with enough energy and attitude, you can roll right over the viewer's suspension of disbelief. A great example is last year's wildly under-appreciated The Warrior's Way, which piled one crazy idea on another and gave them plenty of room to bounce off against each other as they cohered into gloriously absurd and rewarding entertainment. The greatest failing of I Am Number Four, the screen adaptation of Pittacus Lore's sci-fi novel, is that it keeps threatening to get full-on ridiculous, yet doesn't actually do so until the last act, when it's really too late to save the day. Most of the time, I Am Number Four doesn't know if it wants to be a young-adult War of the Worlds or a big-screen version of Dawson's Creek about the new kid who's really from out of town; most of the time it leans to the latter, which in this case was not a good choice.I Am Number Four stars Alex Pettyfer as John Smith, who has just moved to Paradise, OH, from New Mexico with his dad, Henry (Timothy Olyphant). Or at least that's what his new classmates at school think; actually, John is one of the last of the Lorians -- survivors of an alien civilization who are in hiding on Earth from the Mogadorians, their arch enemies who act like the meth-crazed school bullies of the universe. John just wants to blend in and not call attention to himself, which is just what his guardian Henry wants, since there are Mogadorians in the United States looking for them. But almost without trying, Alex gets on the wrong side of Mark (Jake Abel), the arrogant and short-tempered captain of the football team, when he befriends Sam (Callan McAuliffe), a nerdy kid obsessed with UFOs and ancient astronauts, and falls for Sarah (Dianna Agron), a pretty girl with an artsy bent who used to date Mark. Like his fellow Lorians, John has some pretty impressive superpowers, and while trying to protect Sarah from Mark, he ends up tipping his hand and revealing his true nature, not long after we learn that Sam's dad was abducted by aliens and may be unwittingly luring the Mogadorians to Paradise.In its final reels, I Am Number Four dramatically shifts gears and transforms itself into a slam-bang sci-fi action epic overloaded with special effects and full of battles between various all-powerful folks from other worlds, and if it's way over the top, it's also fun and doesn't skimp on imagination and interstellar fisticuffs. The trouble is, by the time I Am Number Four summons up the courage to get full-on ridiculous, it's too late -- the movie has spent so long dealing with John's teen angst and his played-cute romance with Sarah that the narrative has fallen into a coma, and even the closing fireworks can't rouse it. Most of the time, I Am Number Four plays more like a pilot for some basic-cable TV series about winsome teens in the Midwest than a sci-fi thriller, and while both Alex Pettyfer and Dianna Agron are both appropriately teen-star pretty, neither of them has the charisma or imagination to make their characters worth caring about after they've been together onscreen for a few minutes. Jake Abel is more effective as the jock/bully who seems almost as threatening as the Mogadorians, but he has only one move in his dramatic arsenal and it wears out long before the movie ends. Callan McAuliffe is believable as the target of Mark's sadistic pranks, though he's also annoying enough that it's easy to see why everyone picks on him. And while Teresa Palmer is fun, spunky, and kicks serious butt in the finale as another Lorian exile, she also seems to have dropped into I Am Number Four by accident from another, significantly more entertaining movie.Of course, the cast can only do so much with what they're given, and the screenplay by Alfred Gough, Miles Millar, and Marti Noxon (adapted from a novel co-written by James Frey, who has embraced a pseudonym and young-adult fiction after suffering the Wrath of Oprah) is blah and full of clichés, and can't conjure up much of a reason why the Mogadorians are out to take over the universe beyond simply being a bunch of meanies (and even if they are the bad guys, they seem to be having a lot more fun than most anyone else in this movie). And director D.J. Caruso (who, as the auteur behind Disturbia and Eagle Eye, is an expert at directing Shia LaBeouf, if nothing else) is inconsistent with his pacing, doesn't draw much from his cast, and drains the bulk of the movie of any emotional energy. Even though I Am Number Four rallies for a big finish, it almost seems as if we're watching another story when the big battle and a really teed-off Mogadorian critter finally pump some adrenaline into this picture. Better to wait until this shows up on DVD or Blu-ray so you can jump to the big stuff at the end rather than sitting through the dross that sets it up.", "actors": ["Alex Pettyfer", "Timothy Olyphant", "Teresa Palmer", "Dianna Agron"], "directors": ["D.J. Caruso"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NDI1MTMyM15BMl5BanBnXkFtZTcwMDMzMTcyNA@@._V1_SX300.jpg", "keywords": ["alien [not human]", "fugitive", "escape"], "release_year": "2011", "moods": ["Fantastic Reality"], "urls": "karthik", "themes": ["Benign Aliens", "Chosen One", "On the Run"]}
{"key": "thejunglebook-2016", "title": "The Jungle Book", "rating": "7.6", "synopsis": "In this reimagining of the classic collection of stories by Rudyard Kipling, director Jon Favreau uses visually stunning CGI to create the community of animals surrounding Mowgli (Neel Sethi), a human boy adopted by a pack of wolves. The appearance of a villainous tiger named Shere Khan (voiced byIdris Elba) forces Mowgli's guardian, the panther Bagheera (Ben Kingsley), to shepherd the child to safety in the \"man village.\" Along the way, the boy meets an affable, lazy bear named Baloo (Bill Murray), as well as a snake with hypnotic powers (Scarlett Johansson) and an orangutan (Christopher Walken) who wants to harness the power of fire. Lupita Nyong'o, Giancarlo Esposito, and Garry Shandling also lend their voices to this adventure tale.", "genres": ["Adventure", "Drama", "Family"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=5mkm22yO-bs", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/thejunglebook-2016?versionId=jB43QP.IFmRIeSoOURz3yQAV4k5A9iLU"}, "review": "Jon Favreau's ambitious retelling of the beloved 1967 Disney animated film The Jungle Book could have been a success based solely on the sum of its parts; the star wattage of its voice actors alone rivals the cast of any other popcorn flick hitting theatres this year. In order to truly do justice to its predecessors, however, the reboot needed to have enough heart to match its visually stunning CGI animals and backdrop. Fortunately, this incarnation is able to capture the spirit of the source material (which originates in Rudyard Kipling's 1894 collection of stories of the same name), paying appropriate reverence to past versions while also creating its own unique wrinkles, humor, and overall journey.We first find Mowgli (played here by newcomer Neel Sethi) struggling to fit in while living among a wolf pack, despite the diligent tutelage of his mentor and guardian, the panther Bagheera (voiced by Ben Kingsley). After direct threats from human-hating tiger Shere Khan (Idris Elba, whose vocal work is both enthralling and chilling), the boy's adoptive wolf parents Raksha (Lupita Nyong'o) and Akela (Giancarlo Esposito) are forced to let Bagheera escort their son to the \"man village\" for his own safety. But Mowgli is separated from the panther during his reluctant trip to the human refuge, and a hypnotizing encounter with the transfixing snake Kaa (Scarlett Johansson) ends with the boy being rescued at the last possible moment by an affable, lazy bear known as Baloo (Bill Murray, providing terrific comic relief). Bagheera and Baloo, uneasy acquaintances who are quickly forced to become an odd couple of sorts, help Mowgli escape the grasp of orangutan King Louie (Christopher Walken), who wishes to harness the power of fire. Later, their journey culminates in a final battle with Shere Khan.Favreau and the rest of the creative team behind this remake (especially screenwriter Justin Marks) are to be commended for crafting a well-thought-out plot that draws on prior adaptations of the story. Their choice to spend a substantial amount of time with the wolf family who raised Mowgli pays great dividends, as Nyong'o's performance offers an emotional heft that adds undeniable gravitas to the picture. This incarnation also reprises most of the 1967 film's classic tunes: Murray professes his appreciation for the \"Bear Necessities,\" and Walken does a rendition of \"I Wan'na Be Like You\" that remains an earworm while shedding most of the original version's uncomfortable racial overtones. Favreau is not afraid to go his own way here, particularly with a showdown that varies greatly from the animated version, and which leads to a fresh, distinctive coda for a new generation of viewers.Of course, there are certain aspects of the classic Disney film that are downplayed in this remake. Kaa's role has been greatly diminished, and her accompanying musical number, \"Trust in Me,\" isn't heard until the credits. Also, it's slightly disappointing that there are no Beatles-inspired vultures here who break out into a mellow, groovy tune (a number that many modern artists probably would have been eager to recreate). And the 3D gimmick of the film's theatrical release, almost compulsory for children's entertainment these days, feels unnecessary in this instance, as the finely tuned CGI work and colorful settings are immersive enough on their own. If anything, the 3D makes the movie seem too busy at times.These minor qualms don't diminish The Jungle Book's charm, though, as Favreau has not only created a wondrous world here, but crafted a heartwarming story about responsibility, loss, and the importance of utilizing one's own gifts and talents. Both neophytes and fans of the 1967 movie can enjoy this adorable yet weighty tale, which captures the spirit of the Disney canon as well as any of the studio's recent releases. Although it's a remake, this Jungle Book hits the mark by just being itself.", "actors": ["Neel Sethi", "Bill Murray", "Ben Kingsley", "Idris Elba"], "directors": ["Jon Favreau"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTUzNTI4MV5BMl5BanBnXkFtZTgwNjU0NjU5NzE@._V1_SX300.jpg", "keywords": ["boy", "jungle"], "release_year": "2016", "moods": ["Young and Old Alike"], "urls": "karthik", "themes": ["Monkeys", "Survival in the Wilderness", "Talking Animals"]}
{"key": "disorder-2015", "title": "Disorder", "rating": "6.2", "synopsis": "Vincent (Matthias Schoenaerts), a young soldier suffering from PTSD, returns home from war and becomes a security guard for a beautiful woman (Diane Kruger) while her husband is away on a business trip. When he discovers a threat made against his client, Vincent fights to protect her in this thriller directed by Alice Winocour.", "genres": ["Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=2g7oFxlBeg4", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/disorder-2015?versionId=_mBhHrdfTPC4LetWNe1lp2vrTrn1670T"}, "review": "", "actors": ["Matthias Schoenaerts", "Diane Kruger", "Paul Hamy", "Zaïd Errougui-Demonsant"], "directors": ["Alice Winocour"], "picture_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Mjk5NTUwNV5BMl5BanBnXkFtZTgwNzU2Mzk2OTE@._V1_SX300.jpg", "keywords": ["post-traumatic-stress", "security-guard", "soldier", "trauma", "woman"], "release_year": "2015", "moods": ["In a Minor Key", "Spellbinders"], "urls": "karthik", "themes": ["Bodyguards", "Dangerous Attraction", "Home From the War", "Mental Illness", "Party Film"]}
{"key": "insidemen-2015", "title": "Inside Men", "rating": "7.0", "synopsis": "A powerful South Korean newspaper editor ensures a political victory for a candidate through the power of the press, but is double crossed by one of the politician's aides. Meanwhile, an investigator into the corruption begins a dogged search for the truth, seeing the case as his opportunity to make a name for himself. This political thriller is directed by Min-ho Woo.", "genres": ["Crime", "Drama", "Thriller"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=ZFqPiGgFSDk", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/insidemen-2015?versionId=g8s9uJ_sH8uptP1LRtwYuWorGbMqxN.J"}, "review": "", "actors": ["Byung-hun Lee", "Seung-woo Cho", "Yun-shik Baek", "Kyeong-yeong Lee"], "directors": ["Min-ho Woo"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BOWY3MGUyYmItZTZjOC00N2NlLWFmOWUtNWZkYWJiNDQ0NjhhXkEyXkFqcGdeQXVyNjQ4NTczMDE@._V1_SX300.jpg", "keywords": ["betrayal", "candidate", "corruption", "double-cross", "editor", "investigator", "Korean [nationality]", "newspaper", "power"], "release_year": "2015", "moods": ["Adrenaline Rush", "Nail-biters"], "urls": "karthik", "themes": ["Betrayal", "Conspiracies", "Criminal's Revenge", "Dangerous Friends", "One Against the Mob", "Out For Revenge", "Scandals and Cover-Ups"]}
{"key": "lovedon'tcostathing-2003", "title": "Love Don't Cost a Thing", "rating": "5.0", "synopsis": "The sophomore outing for writer/director/actress Troy Beyer, Love Don't Cost a Thing is a romantic teen comedy based on the screenplay for the 1987 Partick Dempsey film Can't Buy Me Love. Nick Cannon stars as Alvin, a brilliant but awkward teenager -- and budding engineer -- who seizes a golden opportunity when popular cheerleader Paris (Christina Milian) wrecks her parents' SUV and is strapped for cash.  They strike an agreement: Alvin will do the repairs for free if Paris pretend to be his girlfriend for two weeks, all in the hopes of elevating his social standing. Little does he know, being popular isn't all its cracked up to be. Kal Penn and Steve Harvey co-star.", "genres": ["Comedy", "Romance", "Drama"], "video_urls": {"youtube_url": "http://www.youtube.com/watch?v=pYh6aNsS0fE", "s3_url": "https://bigdatagsa277.s3.amazonaws.com/lovedon%27tcostathing-2003?versionId=GA9ZXjNpWs0bL2Glmn0HYGiXI_1r5ecp"}, "review": "It has the misfortune of being named after a Jennifer Lopez song, but otherwise, Love Don't Cost a Thing is a tight little urban remake of Can't Buy Me Love. In fact, certain lines of dialogue are cut and pasted word for word, but that just increases the positive associations for those fond of the original. Though the intended audiences don't overlap, the teen-movie truths are universal -- whether it's Patrick Dempsey or Nick Cannon, they both need to check themselves before they wreck themselves. Love Don't Cost a Thing is as joyful as it is because of Cannon's charismatic performance as Alvin Johnson. He's affectionately geeky at the start, and his caricature of the bling-bling \"playa\" stops just short of offensive stereotypes. The same can be said of Steve Harvey as Alvin's father. Capable of really grating, here Harvey finds just the right pitch for the role of Alvin's overzealous sex coach, including a scene in which he humorously outlines the potential usage scenarios for a shoebox full of prophylactics. Jokes about condoms notwithstanding, the film takes a sweetly optimistic view of modern teenagers, racially integrating their social groups wherever possible (Alvin's three best friends are white, black, and Indian), and rarely offering any hint of real violence. What's more impressive is that director Troy Beyer goes well beyond the minimum competence required of her. She sets her camera up in ways that challenge the norm, including filming a conversation among popular kids by placing the camera inside the microwaves and pantry cabinets they open during home ec class. Love Don't Cost a Thing is no classic -- in fact, it's not even as good as the guilty pleasure that inspired it. But it's a lot better than it needed to be, and paints outside the numbers enough to seem pretty satisfying.", "actors": ["Nick Cannon", "Jordan Burg", "Jackie Benoit", "George Cedar"], "directors": ["Troy Byer"], "picture_url": "http://ia.media-imdb.com/images/M/MV5BMTUyMTY4NDk2NF5BMl5BanBnXkFtZTcwNzU0MTYyMQ@@._V1_SX300.jpg", "keywords": ["car-mechanic", "friendship", "high-school", "nerd", "popularity"], "release_year": "2003", "moods": ["Triumph of the Geeks"], "urls": "karthik", "themes": ["Class Differences", "High School Life", "Opposites Attract", "Pygmalion Stories", "Schemes and Ruses", "Social Climbing", "Unrequited Love"]}
